[{"title":"群晖WordPress升级版本提示输入FTP账户信息","date":"2021-10-30T13:13:00.000Z","path":"posts/39371.html","text":"在WP后台安装插件时提示输入FTP账户信息，其实出现这个的问题的原因是Apache/Nginx的执行身份非文件属主身份。 群晖用的是虚拟主机，可以在wp-config.php里加入下面代码 define(“FS_METHOD”, “direct”);define(“FS_CHMOD_DIR”, 0777);define(“FS_CHMOD_FILE”, 0777); OK,WP安装插件提示输入FTP账户信息已经解决了。","tags":[]},{"title":"windows11无TPM升级、在线推送更新无损应用文件","date":"2021-07-19T14:26:00.000Z","path":"posts/45036.html","text":"有TPM2.0的就最好了，在主板里打开即可； 没有TPM也可以申请DEV通道升级！直接上步骤 没有dev渠道的，打开注册表（打开运行框输入：regedit 回车即可进入注册表、搜索框搜索也可以）定位到以下注册表修改相应的数值！（没有选项可以在对应文件夹下面自建）、两个位置一样的操作方法。[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsSelfHost\\Applicability]“BranchName”=”Dev”[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsSelfHost\\UI\\Selection]“UIBranch”=”Dev” 修改完成之后重启，在预览计划处就可以看到在dev渠道了，红字提示不满足最低要求，不用管！直接在第一项更新处 检查更新即可！在下载安装到8%的时候又会提示没有TPM2.0，这个时候打开c盘定位到这个文件C:\\$WINDOWS.~BT\\Sources\\appraiserres.dll，删除！就可以跳过tpm2.0，继续更新即可！","tags":[]},{"title":"win10 IDE改AHCI，无需重装系统","date":"2021-07-19T01:50:00.000Z","path":"posts/28303.html","text":"输入“regedit”，回车，打开注册表 找到StartOverride那个名称是0的值，数据列那里默认是3的改成0，重启进BIOS改AHCI就可以了HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\storahci\\StartOverride我改后重启进入系统再找到这个地方原来的键值已经变了","tags":[]},{"title":"各种排气罩的排气量计算公式","date":"2021-07-16T07:26:46.000Z","path":"posts/26497.html","text":"下表引自由王纯，张殿印主编的《废气处理工程技术手册》第十七章第二节相关内容。该手册由化学工业出版社于2012年11月出版发行。","tags":[]},{"title":"奥维地图自定义可用图源","date":"2021-07-15T12:32:00.000Z","path":"posts/23944.html","text":"链接：https://pan.baidu.com/s/1iTW7mcr6Q9-B2FIR6\\_cJFw 提取码：ph4p","tags":[]},{"title":"群晖无法进入后台管理重置引导","date":"2021-07-14T02:50:23.000Z","path":"posts/24322.html","text":"一、重新做引导 nas连接显示器，u盘装好pe，进入pe，删除16gb分区，使用写入工具写入引导文件，由于洗白原因，本次沿用原来的引导，3617更稳定，但是型号会发生变化。 二、系统恢复 群晖助手显示恢复出错，本地在线无法登录，重新上一步，直接采用在线安装方式，保数据和设置未成功，仅保数据提升格式化硬盘2，无耐选择，其实安装好后，除了套件不在了，基本上数据还在。 三、同步drive 这是主要使用功能，软件安装后，原有的同步连接均失效 四、获取root密码，可行方案如下： 控制面板 - 终端机和SNMP里，开启SSH功能。 通过SSH 登陆群晖，使用系统相同的帐号及密码： 输入 sudo -i 回车，输入群晖的密码，切换到root用户： 输入 cd /etc/ssh 定位到该目录 输入 chmod 755 sshd_config 赋予权限 输入 vim /etc/ssh/sshd_config 修改config文件，输入 i 编辑 将 #PermitRootLogin prohibit password 修改为：PermitRootLogin yes 前面的#号记得去掉 7.按一下键盘 ESC 退出编辑模式，再输入 :wq 回车保存 输入下面命令修改root默认密码： synouser –setpw root xxxxxx 后面的xxxxx 更换成你自己的密码。 输入 reboot 重启群晖 五、洗白 在安装Optware环境时，如果出现下列情况 Optware Bootstrap for syno-i686.Extracting archive… please waitbootstrap/bootstrap/bootstrap.shbootstrap/ipkg-opt.ipk1216+1 records in1216+1 records out249302 bytes (249 kB) copied, 0.118297 s, 2.1 MB/sbootstrap/ipkg.shbootstrap/optware-bootstrap.ipkbootstrap/wget.ipkBackup your configuration settings, then type: rm -rf /volume1/@optware rm -rf /usr/lib/ipkgThis will remove all existing optware packages.You must *reboot* and then restart the bootstrap script.执行如下 rm -rf /volume1/@optware rm -rf /usr/lib/ipk 六、登录qc 在线管理时，不可采用兼容模式，应使用极速模式进行 七、配置wordpress 套件中心下载php、apache安装，记得配置php，勾选全部扩展。不然wordpress采用sq数据库不能被识别。 八、配置nat123 注意重启方式，设置重启后自动登录等。","tags":[]},{"title":"生态空间管控区域与生态保护红线","date":"2021-07-14T02:18:01.000Z","path":"posts/51989.html","text":"生态空间是指具有自然属性、以提供生态服务或生态产品为主体功能的国土空间，包括森林、草原、湿地、河流、湖泊、滩涂、岸线、海洋、荒地、荒漠、戈壁、冰川、高山冻原、无居民海岛等。 生态保护红线是指在生态空间范围内具有特殊重要生态功能、必须强制性严格保护的区域，是保障和维护国家生态安全的底线和生命线。 生态空间是区别于生态保护红线的。","tags":[]},{"title":"群晖中sqlite3在wordpress中无法登录后台","date":"2021-07-13T04:11:06.000Z","path":"posts/44641.html","text":"群晖中sqlite3在wordpress中无法登录后台，是因为wordpress文件夹未设置可写入权限，按如下设置","tags":[]},{"title":"移动宽带之桥接","date":"2020-08-16T13:31:41.000Z","path":"posts/24199.html","text":"1. 获取超级管理员账号好！ 网上找到的账号是这样的 账号：CMCCAdmin密码：aDm8H%MdA 然而我的型号并不能行，最终通过打客服，找到维修人员索取到 CMCCAdmin CMCCAdmintCGPw3dt 2. 怎么改成我上述想改的模式2.1 登录超级账号打开浏览器，输入192.168.1.1 然后输入我上面的账号密码 2.2 把无线功能关掉 2.3 改成桥接模式 这里先删除原来的带有INTERNET，再新建一个，考虑实际只勾选了LAN1，最后id用的50，使能0 2.4 完成然后重启光猫、重新设置路由器即可！ 京东无线宝内的拨号设置， 发现，拨号设置情况下，光猫后台打不开，切换成自动ip即可。","tags":[]},{"title":"重大变动还是技改？","date":"2020-07-30T07:49:00.000Z","path":"posts/12528.html","text":"在实际工作中，技改项目往往要求项目先进行三同时验收，再进行技改，可操作性较高 重大变动应重新报批环评的，通过编制报告书，应重点评价变动前后的影响分析，对于已经建成的项目，也要有实际的监测数据，通过监测评价影响分析的变化。 在编制难度上，技改项目有比较成熟的模式，容易操作。","tags":[{"name":"环评","slug":"环评","permalink":"http://7086.site/tags/%E7%8E%AF%E8%AF%84/"}]},{"title":"水电站涉饮用水源保护区，也面临关停的风险","date":"2020-07-21T08:01:00.000Z","path":"posts/57283.html","text":"在当下的环保高压中，涉及环保问题，特别是涉及自然保护区的水电站，均面临关停的风险。而针对饮用水源保护区的水电站，目前这方面的监管并未特别明朗，不过早前部分省市政府亦有展开调查。 涉饮用水水源相关法律规定 目前针对饮用水源保护的法律法规主要有：《水污染防治法》、《饮用水水源保护区污染防治管理规定》。 有关饮用水水源一级保护区的相关规定，《水污染防治法》第六十五条：“禁止在饮用水水源一级保护区内新建、改建、扩建与供水设施和保护水源无关的建设项目；已建成的与供水设施和保护水源无关的建设项目，由县级以上人民政府责令拆除或者关闭。” 因此，涉及饮用水水源一级保护区的电站，面临关停的风险极高。 对饮用水水源二级保护区的相关规定，水污染防治法第六十六条：“禁止在饮用水水源二级保护区内新建、改建、扩建排放污染物的建设项目；已建成的排放污染物的建设项目，由县级以上人民政府责令拆除或者关闭。” 因此，据此条款，涉及饮用水水源二级保护区的电站，需注意废弃油污的处置，一般不会关停。 水电站涉饮用水水源相关事件 案例之一：福建漳州诏安县环境保护局依法提请拆除或者关闭北蔗四级电站 据诏安县政府网站的公开消息报道：“诏安县环保局在水源地保护区及周边敏感区全面摸底排查行动中，发现我县亚湖水库饮用水源保护区一级保护区内有北蔗四级电站，该电站虽然在饮用水源保护区一级保护区规划批复前已建成，但属于与供水设施和保护水源无关的建设项目。根据《中华人民共和国水污染防治法》第六十五条第一款：“禁止在饮用水水源一级保护区内新建、改建、扩建与供水设施和保护水源无关的建设项目。”县环保局已向县人民政府申请拆除或者关闭北蔗四级电站，不得对饮用水源造成影响。” 根据2018年5月10日，《福建省政府关于报送4月份饮用水水源地环境问题清理整治进展情况的函》【闽政函〔2018〕32 号】，目前诏安县正在制定方案关闭北蔗四级电站。 案例之二：浙江杭州临安区饮用水水源一级保护区内农村水电站调查及处置建议 无有独偶，2018年3月13日，杭州市临安区水利水电局、杭州市临安区环境保护局发布的《关于省政府批准的饮用水水源一级保护区内农村水电站调查及处置建议情况汇报》【临水〔2018〕46号】，其中对涉及饮用水水源一级保护区的电站里畈水库水电站（国有）作出了处置建议，“本着“尊重历史、照顾现实、依法依规、协商解决”的原则，经请示领导同意，并根据多年来电站运行情况与供水现状，建议保留临安饮用水源区一级保护区内里畈水库水电站”， 提请省水利厅、环保厅予以保留该电站。","tags":[{"name":"保护区","slug":"保护区","permalink":"http://7086.site/tags/%E4%BF%9D%E6%8A%A4%E5%8C%BA/"}]},{"title":"全面解读建设项目&ldquo;重大变动&rdquo;","date":"2020-07-08T07:45:00.000Z","path":"posts/47024.html","text":"日前，生态环境部就淀粉等五个行业的重大变动清单公开征求意见。继已经发布的二十四个行业清单之后，清单家族将再添五位新成员。 对建设单位而言，项目发生重大变动，如处理不当将被罚款甚至被责令关闭。对环评单位而言，项目变更可能涉及重大变动时，需要了解相关的规定及应当注意的问题，确保环评文件编制质量。对环保部门而言，对涉重大变动的违法行为进行立案处理时，应当充分理解重大变动的含义和界定规则，做到依法行政。 那么，到底何为“重大变动”，又应该注意哪些问题？ 一、“重大变动”表述变迁 1986年《建设项目环境保护管理办法》(已失效)第十八条规定：建设项目的性质、规模、建设地点等发生较大改变时，报审建设项目的单位应当适时地修改环境影响报告书或环境影响报告表，并按照规定的审批程序重新报批。此时已有“重大变动”概念雏形，表述上使用的是“较大改变”。 1990年《建设项目环境保护管理程序》(已失效)规定：建设项目如有重大变动，建设单位及评价单位应及时向环保部门报告。此时表述为“重大变动”。 1993年《国家环保局、国家计委、财政部、中国人民银行关于加强国际金融组织贷款建设项目环境影响评价管理工作的通知》(已失效)、1995年《电力工业部关于加强利用外资电力建设项目环境影响评价管理工作的通知》(已失效)、1998年硬核环保法规《建设项目环境保护管理条例》以及1999年《海洋石油勘探开发环境保护管理若干问题暂行规定》(已失效)转而使用“重大变化”。 直到2003年环评影响评价专门法律《环境影响评价法》出台，重新使用“重大变动”并沿用至今。为了与《环境影响评价法》的表述一致，2017年《建设项目环境保护管理条例》(下称《管理条例》)将“重大变化”改为“重大变动”。 无论“变化”还是“变动”，仅表述不同，含义基本相同。以上可以看出，我国自1986年开始在环境影响评价领域对建设项目重大变动进行立法规制，迄今已有三十多年历史。 二、现行法律法规对重大变动的定义 现行《环境影响评价法》(下称《环评法》)第二十四条规定：建设项目的环境影响评价文件经批准后，建设项目的性质、规模、地点、采用的生产工艺或者防治污染、防止生态破坏的措施发生重大变动的，建设单位应当重新报批建设项目的环境影响评价文件。 《管理条例》第十二条规定：建设项目环境影响报告书、环境影响报告表经批准后，建设项目的性质、规模、地点、采用的生产工艺或者防治污染、防止生态破坏的措施发生重大变动的，建设单位应当重新报批建设项目环境影响报告书、环境影响报告表。 两者在表述上的唯一差别是“环境影响评价文件”与“环境影响报告书、环境影响报告表”。 依据《环评法》第十六条，环境影响报告书、环境影响报告表或者环境影响登记表统称环境影响评价文件。《环评法》第二十二条和《管理条例》第九条均规定环境影响登记表实行备案制，而非审批制。因此《环评法》第二十四条所指“环境影响评价文件”，实际只能是环境影响报告书和环境影响报告表。《环评法》与《管理条例》对重大变动的定义是一致的。 据此，重大变动是指建设项目的性质、规模、地点、采用的生产工艺或者防治污染、防止生态破坏的措施发生重大变动。从字面理解，界定建设项目的重大变动，一要看是否落在“性质、规模、地点、采用的生产工艺或者防治污染、防止生态破坏的措施”(下称五个因素)范围之内，二要看是否达到“重大”的程度。同时符合这两个条件时，界定为重大变动，建设单位应当重新报批项目环评文件。 该定义并不考虑变动带来的环境影响变化，侧重于变动的形式，而非变动的结果。 三、重大变动清单制度 虽然法律法规层面对重大变动作出定义，但规定得较为原则、不够具体，实务操作时尺度不易把握。环保部门出于履职尽责的目的，易将重大变动范围搞得过大。这也是偏重形式判断的弊端。 譬如，五个因素各自的具体内容是什么？拿“性质”来说，项目资金来源、项目投资主体、项目开发任务等是否属于项目性质的范畴？拿“生产工艺”来说，污染影响为主的项目其生产工艺所指内容较易把握，但生态影响为主的项目如水利水电、油气管道等，其生产工艺到底包含哪些内容，边界比较模糊。再譬如，关于“重大”，变动程度达到多大可以认定为重大？轻影响工程与重影响工程的选址选线，同样变动程度产生的环境影响变化却差别很大，是平等对待还是区分把握？ 另外，一些与项目相关、涉及环境影响显著变化的因素可能不在五个因素之内(至少从字面理解是不包含的)。譬如项目因选线变化致使周边的环境敏感点数量显著增加，项目的不利环境影响将明显加重。但选线变化本身未必达到“重大”的程度。类似这种情形，如果界定为重大变动，缺少明确依据；如果不界定，又很不合理。 考虑到诸多实务问题，为了规范重大变动的界定，生态环境部及其办公厅相继出台了一系列文件，开始建立并逐步完善重大变动清单制度。 2012年1月21日《关于铁路建设项目变更环境影响评价有关问题的通知》对铁路项目的重大变动进行了界定。但是该《通知》规定“项目变更如包括三项或三项以上重大变动的，应开展该项目的全面环境影响评价并报批环境影响评价文件”，与《环评法》及《管理条例》有冲突。该《通知》于2016年6月30日废止。 2012年7月3日《关于进一步加强环境影响评价管理防范环境风险的通知》指出：相关建设项目的环境影响评价文件经批准后，环境风险防范设施发生重大变动的，建设单位应按《环评法》要求重新办理报批手续。该《通知》精神被之后陆续颁布的行业重大变动清单贯彻。 2012年12月18日《关于独立中央空调系统办理环境影响评价手续有关问题的复函》指出：我部认为粤环报〔2012〕76号文件中所提到的独立中央空调系统办理环评手续问题应属于《环境影响评价法》第二十四条第一款规定的情形，而不应将其作为独立的项目纳入《建设项目环境影响评价分类管理名录》进行管理。该《复函》明确将新增独立中央空调系统纳入项目重大变动范畴。 2015年6月4日《关于印发环评管理中部分行业建设项目重大变动清单的通知》(下称《九清单》)制定了水利等九个行业建设项目重大变动清单。《九清单》还提出了重大变动的界定原则、一般变动的管理原则，并赋予省级环保部门制定本省特殊行业重大变动清单的权力。该文件对重大变动清单制度意义非凡。 2016年7月15日《“十三五”环境影响评价改革实施方案》提出“更新和补充项目环评重大变动清单”。 2016年8月8日《关于印发&lt;输变电建设项目重大变动清单(试行)&gt;的通知》(下称《输变电清单》)制定了输变电行业建设项目重大变动清单。 2017年11月14日《关于做好环境影响评价制度与排污许可制衔接相关工作的通知》(下称《衔接通知》)提出“国家将分行业制定建设项目重大变动清单”，明确重大变动清单制度将继续走“行业”之路。 2018年1月25日《关于强化建设项目环境影响评价事中事后监管的实施意见》提出：地方各级环保部门应严格执行建设项目环评文件审批和重大变动界定要求，统一建设项目环评管理尺度。这意味着，地级、县级环保部门暂时只有清单执行权(执行义务)，没有解释权及制定权。 2018年1月29日《关于印发制浆造纸等十四个行业建设项目重大变动清单的通知》(下称《十四清单》)制定了制浆造纸等十四个行业建设项目重大变动清单。《十四清单》还进一步厘清了重大变动清单与产业政策之间的关系：清单虽列出了有关产能增加的变动事项，但不等于认可该变动符合产业政策。 2019年9月18日《关于征求淀粉等五个行业建设项目重大变动清单(试行)(征求意见稿)意见的函》(下称《五清单征》)意味着重大变动清单制度将进一步完善。 从各清单的行文结构来看：第二批、第四批以及第五批(征求意见)采用了统一行文结构，即按照性质、规模、地点、生产工艺、环境保护措施(基本与五个因素对应)分类，每类之下细化列举若干重大变动事项。第三批并未依此分类，而是直接列出十项重大变动事项。这可能与起草机构的不同有关。《输变电清单》是辐射源安全监管司负责起草，《九清单》、《十四清单》及《五清单征》均系环境影响评价与排放管理司(原环境影响评价司)负责起草。 四、清单制度下两种重大变动界定原则 以上清单文件里，《九清单》地位比较特殊。它提出了界定重大变动的基本原则：建设项目的性质、规模、地点、生产工艺和环境保护措施五个因素中的一项或一项以上发生重大变动，且可能导致环境影响显著变化(特别是不利环境影响加重)的，界定为重大变动。 相比《环评法》和《管理条例》的定义，这一原则增加了“且可能导致环境影响显著变化(特别是不利环境影响加重)”的界定条件，使重大变动的界定更加严格。也就是说，如果发生了重大的变动事项，但不会导致环境影响显著变化，则不应被界定为重大变动。 该原则使重大变动的界定从“形式判断”走向考虑环境影响变化的“形式和实质判断”，更切合环境影响评价制度精神。 那么，“可能导致环境影响显著变化(特别是不利环境影响加重)”如何具体判断？是由环保部门直接认定，还是经专门技术机构评估认定，抑或其他方式？ 生态环境部部长信箱《关于建设项目变动的疑问的回复》(2017年5月8日)中明确：已在《九清单》中列明的变动，属于重大变动，无需单独通过确认其环境影响是否显著变化来判定是否属于重大变动。即，清单内的变动无需再判断“可能导致环境影响显著变化(特别是不利环境影响加重)”。这符合清单制度的本意。至于尚未制定清单的行业如何具体判断，目前生态环境部未明确。一些省级环保部门已经制定了本省行业清单及界定程序，这个问题有望被逐步解决。 《九清单》之后的《输变电清单》提出了输变电行业的界定原则，与《九清单》原则略有不同。《输变电清单》规定：输变电建设项目发生清单中一项或一项以上，且可能导致不利环境影响显著加重的，界定为重大变动。 这表达了两层重要意思。先说第一层意思：落在清单内的变动，还须符合“可能导致不利环境影响显著加重”的条件，才能界定为重大变动。部长信箱《关于输变电建设项目重大变动如何认定的回复》(2018年5月18日)提到：根据《输变电清单》，输变电建设项目发生清单中一项或一项以上，且可能导致不利环境影响显著加重的，界定为重大变动。若经环境影响评价，工程变更未导致不利环境影响显著加重的，应当界定为一般变动，无需重新报批环境影响评价文件。即“可能导致不利环境影响显著加重”需要经环境影响评价确认。这是对第一层意思的确认。 这其中有困惑需要解决。清单本意是为了操作方便并统一尺度，如果有清单可对照的情况下还要动用环评手段，清单的存在意义就大大降低。在生态环境部网站搜索相关涉重大变动输变电项目的变更环评报告，基本都是直接比照清单进行界定，走的是“界定→编制→报批”路径，而不是先环评再界定。所以《输变电清单》提出的界定原则以及部长信箱的回复，与实务操作有不尽一致之处，我们需谨慎对待。 再说第二层意思：将《九清单》“可能导致环境影响显著变化(特别是不利环境影响加重)”的表述限缩为“可能导致不利环境影响显著加重”，排除了不利影响显著减弱的情形。 另外，《输变电清单》没有以《九清单》为制定依据，这有异于《十四清单》及《五清单征》。可以认为，《输变电清单》不受《九清单》的约束，输变电行业重大变动界定自成一体。 总之，两部清单在界定原则上的差异，体现了非辐射类行业与辐射类行业在环评管理思路上的不同。 五、“不利影响显著减弱”是否应排除重大变动范畴 《九清单》原则虽然更多关注不利环境影响显著加重，但没有排除不利影响显著减弱的情形。 项目不利环境影响显著减弱对环境质量有益无害，但并不意味着对环境管理秩序没有影响。不利环境影响减弱往往意味着环境容量的增加。譬如本项目排放总量减少意味着其他新增同类污染物排放总量的项目具有指标空间。如果企业不履行重新报批程序，那么环保部门可能经过较长时间才能得知该项目腾出了总量指标。在此期间，一些本可以被批准的潜在项目未能通过环评审批，对潜在项目和地方经济都是一种损失。再譬如项目重大变动后环评类别降级，甚至变成登记表项目，如果仍按照原审批意见实施监管，将造成执法资源浪费。 所以《九清单》原则未排除不利影响显著减弱的情形，有其合理原因。 六、尚未制定清单的行业重大变动界定原则 从监管思路及清单格式来看，《九清单》原则应当是非辐射类行业界定重大变动应遵循的原则。例如原上海市环保局《上海市建设项目变更重新报批环境影响评价文件工作指南(2016年版)》将重大变动清单分为“非辐射类”和“辐射类”。 部长信箱《关于明确VOCs等环境工程环评类别建议的回复》(2017年9月7日)指出：关于“环境保护措施发生变化使得不利环境影响减弱的情形，是否属于重大变动”的问题，在操作过程中，应结合项目实际情况，按照《九清单》相关要求，界定项目变动是否属于重大变动。该回复确认对VOCs及其他污染物环境治理行业重大变动界定应遵循《九清单》原则。 《输变电清单》原则只适用于输变电行业。辐射类的其他行业是否可以参照执行，目前并未明确。 七、重大变动清单设有兜底条款是否恰当 《上海市建设项目变更重新报批环境影响评价文件工作指南(2016年版)》在“未纳入环办﹝2015﹞52号文的其他非产业类建设项目”一节中规定“其他经环保部门审查认为属于重大变动的情况”。原江苏省环保厅《关于加强建设项目重大变动环评管理的通知》规定“其他可能导致环境影响或环境风险增大的环保措施变动”。 生态环境部《关于生态环境领域进一步深化“放管服”改革，推动经济高质量发展的指导意见》在“进一步深化简政放权，转变政府职能”一节中提到“健全并严格落实重大变动清单”。这表明清单意在“收缩”而不是“放大”监管范围。部制清单中设有兜底条款的：《九清单》石油炼制与石油化工行业的“环境保护措施”一节，《十四清单》钢铁行业的“环境保护措施”一节，《五清单征》没有。可见，生态环境部对兜底条款持谨慎态度。 省级环保部门清单之所以设定兜底条款，或有“挂万漏一”之担忧，或为让重大变动的界定更为灵活。但无论如何，应尽量贴近部制清单制定思路，贯彻简政放权的政策要求。 八、地市、区县环保部门是否有清单制定权 部分地市、区县环保部门对清单制定进行了探索。例如原池州市环保局于2018年7月发布《池州市建设项目重大变动认定原则(试行)》，原慈溪市环保局于2016年5月发布《关于印发环评管理中建设项目重大变动清单的通知》。 但是，目前地市、区县环保部门未被赋予清单制定权，省级环保部门可否授权其制定也无明确依据。甚至有的清单偏严，如池州市清单将变动幅度基准线普遍定为15%，相较部制清单普遍30%的基准线，其合理性及政策符合性有待商榷。而且，在已有部制清单、省级环保部门清单的情况下，再去制定地市甚至区县的清单，是否确有必要？ 由此引发的顾虑是，地市、区县环保部门如依据其制定的清单界定重大变动，继而实施行政许可或行政处罚，恐惹争议。 九、重大变动的“白名单” 重大变动的界定，除依照重大变动清单制度进行直接界定外，还可依据“白名单”进行排除。白名单对于尚未制定清单的行业尤为重要。 2004年原国家环境保护总局《关于企业工商变更登记环境影响评价制度适用问题的复函》指出：办理工商变更登记的企业如果只是变更法人代表、企业名称，项目的性质、规模、地点或者采用的生产工艺未发生重大变动的，无须报批或者重新报批建设项目环境影响评价文件。 部长信箱《关于验收过程中总量指标变动的问题回复》(2018年6月26日)和《关于建设项目环保验收总量超标的回复》(2019年5月21日)明确：排放总量超标不属于重大变动。实际上，排放总量超标根本不属于“变动”的范畴。 此外，一些省级环保部门也对白名单进行了探索。 原山东省环保厅曾在2012年《关于办理环境影响评价文件变更有关事项的通知》中将“投资主体发生变更”、“变更后产业政策、环境风险、污染治理措施、防止生态破坏的措施及污染源强等不易判断”、“增加重金属污染物或危险废物排放”、“环境风险隐患较大”以及兜底条款“其他可能对周围环境产生重大影响”列入须重新报批环评文件范围。不过在《九清单》及《十四清单》(征求意见稿)出台之后，该《通知》于2018年1月废止。照此精神，上述情形是不被直接视为重大变动的。 原重庆市环保局2014年印发《重庆市建设项目重大变动界定程序规定》，规定下列情形原则上不界定为重大变动：项目名称、建设单位、投资金额等发生变化，但项目实际建设内容未发生变化的；项目建设内容部分发生变化，但新方案有利于环境保护，减轻了不良环境影响的。 原广东省环保厅2018年《关于企业吸收合并环境影响评价手续办理问题的复函》指出：若企业间吸收合并经合法程序完成后，相关项目的性质、规模、地点、采用的生产工艺和污染防治措施均未发生重大变动，则企业无须报批或者重新报批建设项目环境影响评价文件。 安徽省生态环境厅被问及“项目环评已获批，只是建设主体发生变更，其他内容没有变动，是否需要重新报批环评手续”，于2019年2月12日答复：建设主体变更不在《环评法》规定的应当重新报批建设项目的环境影响评价文件的范畴内。 十、登记表项目发生重大变动如何处理 环境影响登记表实行备案管理，不须报批，所以《环评法》和《管理条例》关于重大变动的规定不适用于登记表项目。既然如此，登记表项目发生重大变动可否置之不理？ 《建设项目环境影响登记表备案管理办法》规定：建设单位对其填报的建设项目环境影响登记表内容的真实性、准确性和完整性负责，在填报登记表时弄虚作假致使备案内容失实的给予行政处理。这意味着项目实际情况要与登记表的记载相一致，项目发生重大变动不能“不管不问”，应当有所行动。 关于项目变更的处理，该《办法》仅规定：建设项目环境影响登记表备案完成后，建设单位或者其法定代表人或者主要负责人在建设项目建成并投入生产运营前发生变更的，建设单位应当依照本办法规定再次办理备案手续。该条指出可以“再次办理备案手续”，但适用的情形不包括项目重大变动，且仅指项目投产运营前发生的变更。如果参照“再次办理备案手续”方式处理重大变动，需要将整个项目(包含重大变动部分)再备案一次。有些地区对再次办理备案手续作出了更细致的规定，各位读者可以到当地环保部门网站或者登记表备案系统查看。至于“变更备案手续”，《办法》尚无相关规定，生态环境部登记表备案系统（全国统一平台）也未见变更操作入口。 如果项目发生重大变动后，按照《建设项目环境影响评价分类管理名录》不再属于登记表项目，变为应报批报告书、报告表的项目，则应依法履行相应的报批手续，而非备案。否则，环保部门将依据《办法》第二十条作出备案无效及行政处罚等处理。 由此延申出的问题是：因重大变动导致报告书、报告表项目变为登记表项目的如何处理？虽然依法应重新报批，但由于编制的是登记表，本身又无须报批。参考《九清单》(因输变电行业没有登记表项目所以不考虑《输变电清单》)确定的重大变动界定原则，不利环境影响显著减弱不是监管重点。结合简政放权的政策要求，笔者认为报告书、报告表项目发生重大变动变为登记表项目的，备案即可。 十一、重大变动重新报批的适用时段 《环评法》及《管理条例》对重大变动重新报批适用时段的规定是“建设项目的环境影响评价文件经批准后”，并未明确截止时点。《九清单》指出：属于重大变动的应当重新报批环境影响评价文件，不属于重大变动的纳入竣工环境保护验收管理。从字面理解，《九清单》为重大变动重新报批加上了一个截止时点，即通过验收。这种理解是否正确？笔者从三个方面分析。 首先，如果不以通过验收为截止时点，已验收项目的重大变动重新报批必然涉及重新组织验收的问题。但重新组织验收并无明确法律规定。同时，《管理条例》关于验收的规定，是针对“项目”而言，不是针对项目的“重大变动部分”。所以重新验收意味着整个项目须重新验收。如重新审批和重新验收都通过，新验收手续生效，原验收手续不再有效，倒没什么问题；如重新审批通过但重新验收未通过，原验收手续因原审批意见失效而失效，新验收手续却未取得，致使整个项目(不仅是重大变动部分)都不能投产，等于剥夺了原项目合法的生产权利，显然不合理。 其次，已验收项目都已投产或预期投产，建设单位可享有经营收益。重新报批期间，项目被“冻结”，应当停止生产。建设单位的经营收益减少，经济秩序稳定性也受到冲击。已验收项目发生重大变动并非必须以重新报批的方式解决，可以通过报批新建、改建、扩建及技术改造项目的方式将变动部分“拿出”单独作为一个项目处理，对建设单位和经济秩序的影响更小。环保部门实施行政管理可以采取多种措施实现行政目的的，应当选择最有利于保护建设单位合法权益的措施。 最后，环评文件编制报批实务的一般做法是：未验收项目发生重大变动的，编制调整或变更环境影响评价报告(具体名称范式依各地环保部门要求)重新报批；已验收项目发生变动的，根据变动的内容按照新建、改建、扩建或技改项目编制并报批环评文件。 综合上述分析，重大变动重新报批的截止时点应为项目通过验收。 另外需要注意，未经验收擅自投产的项目，因不具备验收手续也不应享有经营收益，无需考虑前述因素，仍然适用重大变动重新报批的规定。这在原环保部2015年2月25日行政处罚决定书(安徽马钢罗河矿业有限责任公司)和2015年2月25日行政处罚决定书(铁法煤业集团大强煤矿有限责任公司)，以及最高法于2016年3月30日发布的人民法院环境保护行政案件十大案例之一“威海阿科帝斯电子有限公司诉威海市环境保护局环保行政处罚案”中均得到体现。 十二、重新报批期间原环评文件及审批意见的有效性 首先需要说明环评文件与审批意见的关系。两者关系可从两方面理解。 第一，环评文件是环保部门作出审批意见的主要依据。 第二，环评文件和审批意见均具有强制力，但环评文件的强制力来自于审批意见。在获得批准之前，环评文件只是一册技术文件，无论环保部门是否已经受理该环评文件，其对企业履行环境责任不具有强制力。但在获得同意批复之后，环评文件即可视为审批意见的附件，对审批意见具有释明作用。这是因为审批意见限于文件性质及篇幅，一般只以相对固定的行文结构提出基本环保要求，不会对环评文件的主要内容铺开论述。无论对于企业的建设运营还是环保部门的日常监管，审批意见的可操作性都是有限的，必须结合环评文件中对应的具体内容来理解审批意见提出的要求。 《环评法》第二十六条、第二十七条以及《管理条例》第二十条对环评文件和审批意见的强制力作了具体规定，在此不作赘述。 然后谈一谈重新报批期间环评文件和审批意见的有效性问题。 前文述及，环评文件的强制力来自于审批意见，所以这个问题实质是审批意见的有效性问题。审批意见的法律性质是行政许可。《行政许可法》规定：准予行政许可所依据的客观情况发生重大变化的，为了公共利益的需要，行政机关可以依法变更或者撤回已经生效的行政许可。据此，在依法被变更或撤回之前，行政许可有效。 当项目内容发生重大变动，建设单位须重新报批环评文件，审批意见也应当重新作出。当新审批意见作出，原审批意见即应视为被撤回，从而失效。 然而，实务中的撤回可能是不完全的。譬如生态环境部2019年5月24日《关于山西中煤华晋晋城能源有限责任公司里必矿井及选煤厂变更环境影响报告书的批复》明确指出“其他要求仍按照环审〔2011〕86号(原批复意见)执行”。类似批复还有若干。此时相当于只对原审批意见进行了部分撤回，未被撤回的部分仍有效。于是就存在一份有效审批意见和一份部分有效的审批意见。 如果重新编制的环评文件未被批准，即不予许可，建设单位因此停止执行重大变动甚至恢复原状，整个项目的环境影响仍落在原环评文件及审批意见范围内，原审批意见理应有效。如果建设单位因各种原因必须执行重大变动，将面临行政处罚，行政处罚认定重大变动的事实必须以原环评文件及审批意见为依据，原审批意见应当有效。 所以原环评文件和审批意见只有在批准重大变动的审批意见作出后且新审批意见中未保留原审批意见强制力的情况下，才视为失效。 十三、重新报批的环评文件由谁审批 环评审批权力下放，可能导致原环评文件审批部门在重新报批时已不是有权审批的部门。此时应报原审批部门批准，还是报有审批权的部门批准？ 原环保部2015年7月30日《关于建设项目重大变动环境影响评价文件审批权限的复函》指出：发生重大变动的，建设单位应当按现行分级审批规定，向有审批权的环保部门报批项目重大变动环境影响评价文件。 所以原环评文件审批部门与重新报批时的审批部门未必一致。建设单位应当注意，避免多跑腿；环保部门更要留神，切勿越权审批。 十四、重新报批后排污许可证如何处理 依据《衔接通知》和《排污许可管理办法(试行)》(下称《许可办法》)，申请及核发排污许可证的时段为项目环评审批之后、试生产或投产之前。这一时段与重大变动重新报批的适用时段存在重合。核发排污许可证之后，如果项目发生重大变动须重新报批环评文件，以环评文件及审批意见为前提和依据的排污许可证应如何处理？《衔接通知》仅规定：发生重大变动的，建设单位应当依法重新报批环境影响评价文件，并在申请排污许可时提交重新报批的环评批复(文号)。并未规定已有排污许可证的项目重大变动重新报批后原排污许可证如何处理。 可能的处理方式无非两种，重新核发或变更。 关于重新核发，《许可办法》并未规定这项制度，《衔接通知》及其他相关文件也未见提及。关于变更，《许可办法》规定：下列与排污单位有关的事项发生变化的，排污单位应当在规定时间内向核发环保部门提出变更排污许可证的申请：……(二)因排污单位原因许可事项发生变更之日前三十个工作日内。据此，在重新报批的环评文件获得批准之后，排污单位应及时就变更事项向核发部门提出变更申请。 十五、以“未批先建”为由处罚重大变动，投资额如何确定 《环评法》第三十一条规定：建设单位未依法报批建设项目环境影响报告书、报告表，或者未依照本法第二十四条的规定重新报批或者报请重新审核环境影响报告书、报告表，擅自开工建设的……。此即“未批先建”。对该行为应“处建设项目总投资额1%以上5%以下的罚款”。 对于重大变动的建设项目，虽然要求重新报批环评文件，但未批先建实际仅涉及重大变动部分。如果一律以项目总投资额为处罚依据，或有失公允。如果只考虑重大变动部分的投资额，又无明确法律依据。 生态环境部办公厅2019年4月1日《关于建设项目总投资额认定有关意见的复函》指出：分期建设的项目可以当期工程总投资额作为处罚依据。该《复函》开启了以项目内容的一部分而非整个项目确定投资额的先河。似乎可以推断出：未批先建部分可以明确投资额的，可以该部分投资额作为处罚依据。然而这仅是推断。 笔者认为，以“未批先建”为由对建设项目重大变动进行处罚时，以重大变动部分的投资额为依据，符合过罚相当原则，是比较合理的。如果环保部门认为项目的环境影响变化不局限于重大变动直接引起的部分，可以收集证据加以证明，继而扩大投资额认定范围。 结语 建设项目重大变动有关问题，既涉及环境影响评价制度和建设项目管理法律体系，也关乎环境技术，还与实务操作联系紧密，具有系统性、综合性、动态发展的特点。虽然重大变动已经提了三十多年，但仍有许多问题需要逐步界定清楚。本文抛砖引玉，对这些问题略涉一二，希望对各位同仁能有所启发。","tags":[{"name":"环评","slug":"环评","permalink":"http://7086.site/tags/%E7%8E%AF%E8%AF%84/"}]},{"title":"sqlite3在wordpress中的使用","date":"2020-07-05T12:39:00.000Z","path":"posts/16056.html","text":"作为个人的笔记中心（博客），并没有什么访问量，数据也不会很多，所以我并不打算用mariadb数据库。这里使用sqlite3作为数据库。而且使用sqlite3的好处是，数据库、照片直接保存在文件夹内，wordpress备份只需要把整个文件夹拷贝一下就OK了，无需操作mariadb数据库。 在套件中心安装好 Web Station 和 PHP 7.3这2个应用就好了。 Web Station配置1. 在常规设置里选择PHP 7.3作为运行环境 2. 在PHP 设置里把扩展全部打勾 3. 去下载最新版的wordpress https://cn.wordpress.org/latest-zh_CN.zip，解压缩后复制到 群晖/web的目录下 4. 下载sqlite插件qlite-integration.1.8.1，解压后把文件夹复制到/web/wordpress/wp-content/plugins ,目录下 5. 复制 /web/wordpress/wp-content/plugins/sqlite-integration 下的“db.php”到 /web/wordpress/wp-content 目录 6. 把 /web/wordpress 文件夹下的 wp-config-sample.php 拷贝一份，重命名为 wp-config.php 7. 对“File Station”对wordpress文件夹进行“写入”授权 三、登录wordpress在浏览器里输入你的网址 https://xxx.myds.me:10086/ ，登陆你的wordpress Have fun! 小叮咛： wordpress的备份只需要copy这个文件夹就好了，数据库就在/web/wordpress/wp-content/database 文件夹里，随身携带","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"NOx控制措施及选用原则","date":"2020-07-02T08:52:00.000Z","path":"posts/25029.html","text":"大气污染物中，氮氧化物的量比较大，次于二氧化硫，能促进酸雨的形成，对动物的呼吸系统危害较大。煤燃烧是主要的工业生产中氮氧化物形成源。煤燃烧过程中，主要通过低氮燃烧技术从根本上减少氮氧化物的排放，当采用低氮燃烧器后氮氧化物的排放仍不达标的情况下，燃煤烟气还须采用非选择性催化还原技术SNCR和选择性催化还原技术SCR脱硝装置来控制氮氧化物的排放.SNCR和SCR技术主要是在有或没有催化剂时，将氮氧化物选择性地还原为水和氮气，前者的效率较低，一般在40%以下，后者可以达到90%以上的效率。燃煤电厂燃用烟煤、褐煤时，宜采用低氮燃烧技术；燃用贫煤、无烟煤以及环境敏感地区不能达到环保要求时，应增设烟气脱硝系统。（1）低氮燃烧技术低氮燃烧技术一直是应用最广泛、经济实用的措施。它是通过改变燃烧设备的燃烧条件来降低NOX，的形成，具体来说，是通过调节燃烧温度、烟气中的氧的浓度、烟气在高温区的停留时间等方法来抑制NOX，的生成或破坏已生成的NO2。低氮燃烧技术的方法很多，这里介绍两种常用的方法。 ①排烟再循环法。利用一部分温度较低的烟气返回燃烧区，含氧量较低，从而降低燃烧区的温度和氧浓度，抑制氮氧化物的生成，此法对温度型NOx，比较有效，对燃烧型NOx，基本上没有效果。 ②二段燃烧法。该法是目前应用最广泛的分段燃烧技术，将燃料的燃烧过程分阶段来完成。第一阶段燃烧中，只将总燃烧空气量的70%75%（理论空气量的80%）供入炉膛，使燃料在缺氧的富燃料条件下燃烧，能抑制NOx，的生成；第二阶段通过足量的空气，使剩余燃料燃尽，此段中氧气过量，但温度低，生成的NOx，也较少。这种方法可使烟气中的NOx，减少25%50%。（2）选择性催化还原技术SCR SCR过程是以氨为还原剂，在催化剂作用下将NO，还原为N2和水。催化剂的活性材料通常由贵金属、碱性金属氧化物、沸石等组成。NO，按以下过程被选择性地还原为N2和水：","tags":[{"name":"工程技术","slug":"工程技术","permalink":"http://7086.site/tags/%E5%B7%A5%E7%A8%8B%E6%8A%80%E6%9C%AF/"}]},{"title":"wordpress+sqlite3 轻量级博客系统搭建","date":"2020-06-30T10:21:00.000Z","path":"posts/35840.html","text":"自行搭建php运行环境(如果你是小白,且是windows系统,我推荐使用xampp) 1.准备工作1.自行搭建php运行环境(如果你是小白,且是windows系统,我推荐使用xampp)2.下载wordpress3.下载SQLite Integration 插件2.安装wordpress解压下载的wordpress压缩包到php 运行目录(我拿xampp为例目录是在xampp安装目录下的htdocs目录)将目录下的wp-config-sample.php复制粘贴一份重命名为wp-config.php 示例 示例 打开wp-config.php修改以下配置原始文件:123456789101112131415161718// ** MySQL 设置 - 具体信息来自您正在使用的主机 ** ///** WordPress数据库的名称 */define(&#x27;DB_NAME&#x27;, &#x27;database_name_here&#x27;);/** MySQL数据库用户名 */define(&#x27;DB_USER&#x27;, &#x27;username_here&#x27;);/** MySQL数据库密码 */define(&#x27;DB_PASSWORD&#x27;, &#x27;password_here&#x27;);/** MySQL主机 */define(&#x27;DB_HOST&#x27;, &#x27;localhost&#x27;);/** 创建数据表时默认的文字编码 */define(&#x27;DB_CHARSET&#x27;, &#x27;utf8&#x27;);/** 数据库整理类型。如不确定请勿更改 */define(&#x27;DB_COLLATE&#x27;, &#x27;&#x27;); 修改为:1234567891011121314151617181920// ** MySQL 设置 - 具体信息来自您正在使用的主机 ** ///** WordPress数据库的名称 */define(&#x27;DB_NAME&#x27;, &#x27;MyBlog&#x27;);//MyBlog&lt;====这是数据库名,可以自定义/** MySQL数据库用户名 */define(&#x27;DB_USER&#x27;, &#x27;&#x27;);/** MySQL数据库密码 */define(&#x27;DB_PASSWORD&#x27;, &#x27;&#x27;);/** MySQL主机 */define(&#x27;DB_HOST&#x27;, &#x27;localhost&#x27;);/** 创建数据表时默认的文字编码 */define(&#x27;DB_CHARSET&#x27;, &#x27;utf8&#x27;);/** 数据库整理类型。如不确定请勿更改 */define(&#x27;DB_COLLATE&#x27;, &#x27;&#x27;);//define(&#x27;WP_ALLOW_REPAIR&#x27;, true);//数据库修复时使用define(&#x27;DB_TYPE&#x27;, &#x27;sqlite&#x27;); //mysql or sqlite` 解压SQLite Integration到wordpress安装目录下wp-content\\plugins\\ 示例 找到db.php 无标题.png 复制到到wordpress安装目录下的wp-content目录中 示例 3.运行并配置博客如果你还未运行apache服务器 那就请先运行浏览器访问网站比如:http://127.0.0.1:8080/根据页面显示填写完整信息后点击底下安装 示例 配置完成后会自动进入管理员界面 示例 4.开始你的wordpress博客之旅吧","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"解决群晖 Synlolgy 上 WordPress 安装更新主题插件需要 FTP 的问题","date":"2020-06-30T04:42:00.000Z","path":"posts/45046.html","text":"为什么运行在群晖 NAS 上的 WordPress 升级更新需要输入 FTP 用户名和密码？安装、更新 WordPress 插件也需要 FTP 用户名密码？到底该如何设置目录权限？本文将为你揭晓真正的原因。作为一个程序员，我在把 PHP Web 开发环境搭在了 NAS 上，这样可以让家里和公司的电脑自动同步，另外开发机也不用安装环境，运行效率更好。但随之而来的是，明明在服务器或开发机上跑的很好的 WordPress，为什么在群晖 NAS 上却发生各种奇怪的问题。 故障描述WordPress 没有写权限，导致无论是升级/更新 WordPress、安装/更新插件都要求输入 FTP 密码。 WordPress 要求输入 FTP 的用户名密码 就算是把 wwwroot 根目录的权限改成 http 用户可读可写也无效。 群晖 DMS 的文件夹权限配置 UI 故障原因因为某种神奇的原因，更新 WordPress 版本或安装插件时的用户身份是 nobody，而 WordPress 目录权限身份是 http，因此导致目录权限身份不符引发权限问题。 通常情况下运行 WordPress 的所有目录权限设置为 755 就够了，因为 WordPress 安装/更新插件需要 644（4+2）的权限，更新升级 WordPress 自身的话需要 7（4+2+1）权限。所有 WordPress 的文件设置为 664 即可，例外的是：wp-config.php 应设为 600，以防其它用户读取。 解决方法找到问题的症结后，就能对症下药了。既然更新文件时使用了奇怪的用户身份，那我们来强制 WordPress 使用 PHP 的读写身份就行了。 1. 开启 Web station 的 zip/ 打开 Web Station——PHP 设置——编辑配置文件 在拓展名里找到 zip 并打钩，开启 zip 支持； 群晖 DMS 的 PHP 配置文件 UI 2. 修改 wp-config.php 在 WordPress 的根目录下找到wp-config.php文件； 在好了！请不要再继续编辑这行代码的前面新增这行代码：define(&#39;FS_METHOD&#39;, &#39;direct&#39;);，这行代码告诉 WordPress 强制使用 PHP 的读写身份运行文件读写操作。就像下面这样，保存后上传到你的服务器。 define(``&#39;FS_METHOD&#39;``, &#39;direct&#39;``); /* 好了！请不要再继续编辑。请保存本文件。使用愉快！ */ /** WordPress 目录的绝对路径。 */ if ( !defined(``&#39;ABSPATH&#39;``) ) define(``&#39;ABSPATH&#39;``, dirname(``__FILE__``) . &#39;/&#39;``); /** 设置 WordPress 变量和包含文件。 */ require_once``(ABSPATH . &#39;wp-settings.php&#39;``); 结束语其实看得出来：群晖在引导用户从套件中心安装群晖打包的 WordPress，而不想让用户在 NAS 上安装 WordPress 官方版。群晖甚至在自己打包的 WordPress 的配置文件 config.php 中添加了禁用 WordPress 官方更新的代码。这意味着如果你选择群晖版 WordPress 就算在后台看到“更新提示”也无法升级，只能等群晖的包，然后从套件中心来升级。","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"副路由有线连接组建局域网","date":"2020-06-30T04:40:00.000Z","path":"posts/37599.html","text":"断开主路由连接 副路由lan口接电脑，进入设置，关闭dhcp，设置lan网络地址与主路由在同一个ip，如主是192.168.0.1，副可以设置为192.168.0.80 副路由的wan不用设置 设置完毕后，主路由lan口接副路由lan口，副路由wan口始终空置 开机，则在同一个局域网了。","tags":[{"name":"路由","slug":"路由","permalink":"http://7086.site/tags/%E8%B7%AF%E7%94%B1/"}]},{"title":"关于本站端口的选择","date":"2020-06-30T04:30:00.000Z","path":"posts/55570.html","text":"外网80被封了，转发的时候要把80转发其他端口（假设88）， 如直接安装，那么外网访问的时候用：http://域名:88/wordpress。 如果设置了虚拟机，并设置博客目录web/wordpress，设置好外部映射，则可以实现http://域名:88/访问，本站便是。 如果设置了虚拟主机，且有443，外网用二级域名访问博客：https://wp.域名.com，也很完美。我自己没成功，可能443被封了。有待进一不研究。","tags":[{"name":"NAS","slug":"NAS","permalink":"http://7086.site/tags/NAS/"}]},{"title":"群晖Moments无法识别人像解决方法","date":"2020-06-30T04:13:00.000Z","path":"posts/63244.html","text":"在第1.3.5-0706版本中，似乎解决了DS1019+,DS918+,DS718+,DS418play,DS218+的识别问题，大家更新到最新版本，等待几个小时，看是否能识别，如果不能识别，建议完全删除moments以及数据再次安装即可解决，如果依然不能识别，请检查下是否洗白，洗白教程自行搜索，最终不行再参考本帖关键字：moments不能识别，还有XXX张照片待发现，moments无法分类 问题：如果你用的黑群晖，安装moments后，人物、主题、位置等栏目无法识别你的照片，并且一直提示：还有XXXX张照片待发现的话，本文可以解决你的问题 第一步：开启SSH和SCP控制面板–文件服务–FTP–SFTP开启 控制面板–文件服务–rsync–rsync开启 控制面板–终端机–启用SSH功能 第二步：安装winscp和putty都是百度能直接搜索安装到的 第三步：开启root登陆权限1、打开putty，在Host Name处输入你的NAS内网地址 2、点击open 3、输入群晖管理员用户名，回车 4、输入密码（密码不会显示），回车 5、输入 sudo -i 回车 6、再次输入密码 7、输入 vi /etc/ssh/sshd_config 回车后按 i 键，进入编辑模式 8、按方向键下，找到#PermitRootLogin prohibit password这一行 光标停留在这一行最后，按回车，然后输入 PermitRootLogin yes 然后按ESC键，退出编辑模式 9、输入:wq，回车保存 10、手动输入 synouser –-setpw root 你的密码 “你的密码”更换为你的密码，如synouser –-setpw root 123456，然后回车 11、输入reboot重启群晖，等待群晖重启完毕。 第四步：替换moments插件文件1、刚才我们操作的步骤主要是开启通过winscp的root登陆权限，现在我们打开winscp 2、登陆窗口，文件协议选择SCP，主机名为群晖内网地址，用户名为root，密码为刚才最后一步你设置的密码，然后登陆 3、登陆后，右侧为你的服务器文件，找到目录：/var/packages/SynologyMoments/target/usr/lib/libsynophoto-plugin-detection.so 4、下载此文件，放到你的左侧目录（左侧目录为你的本机文件） 链接: https://pan.baidu.com/s/1WXNt5-rmU-SaVZSNt_G3Ag 提取码: cgbr 确认无误后，右键，上传到服务器（上传前请在群晖安装好moments，并停用moments），替换原有文件 5、打开moments，上传照片，查看效果。 PS：出于安全考虑，操作完成后，最好关掉SSH和SCP。 PSS：如果还有不太懂的，可以在下面回复我。","tags":[{"name":"NAS","slug":"NAS","permalink":"http://7086.site/tags/NAS/"}]},{"title":"群晖采用root用户登录","date":"2020-06-30T04:11:00.000Z","path":"posts/31436.html","text":"在控制面板中开启 ssh 登录 通过有 管理员权限的用户登录 通过输入 sudo -i 或者 sudo su - , 然后输入当前用户密码, 进入 root 输入如下命令可以修改root 用户的密码 synouser –setpw root 123456 (123456为密码) 如果通过ssh登录不进去, 需要去开启 进入文件 vi /etc/ssh/sshd_config 搜索文件 “PermitRootLogin” 更改为 yes, 或者 打开注释(如果是注释掉的话) 重启 ssh 服务, 在此群晖中没有找到合适的命令, 可以通过网页中的控制面板禁用,启用服务生效. 配置root账号 login as：输入admin账号。就是当时第一次配置DSM输入的账号。输入admin的密码。（输入完按回车） 登录成功后，输入sudo -i 会提示输入密码password，这边还是输入admin密码。 看到root@……：~#这样的信息就是已经进入到root账号了。 设置root账号密码，输入synouser –setpw root password 这里的password最好和admin密码一样，这样不容易搞错。 注：DSM6.1.7到上面为止就可以root登陆了，但DSM 6.2还需要做以下操作： 1、输入vi /etc/ssh/sshd_config 修改ssh配置文件，按“i”键进入insert模式，修改#PermitRootLogin prohibit-password 为 PermitRootLogin yes，然后按ESC键输入:wq保存退出 2、输入reboot重启DSM","tags":[{"name":"NAS","slug":"NAS","permalink":"http://7086.site/tags/NAS/"}]},{"title":"黑群晖要部署optwar","date":"2020-06-30T04:07:00.000Z","path":"posts/62112.html","text":"只要是普通电脑装Optware都选择这个http://ipkg.nslu2-linux.org/feeds/optware/syno-i686/cross/unstable/syno-i686-bootstrap\\_1.2-7\\_i686.xsh具体命令如下: cd /volume1/@tmp wget http://ipkg.nslu2-linux.org/feeds/optware/syno-i686/cross/unstable/syno-i686-bootstrap\\_1.2-7\\_i686.xsh chmod +x syno-i686-bootstrap_1.2-7_i686.xsh sh syno-i686-bootstrap_1.2-7_i686.xsh rm /volume1/@tmp/syno-i686-bootstrap_1.2-7_i686.xsh vi /root/.profile 复制代码 然后按i进行编辑，编辑好按esc，然后按： 接着输入wq 回车键 保存在 #PATH=/sbin:/bin:/usr/sbin:/usr/bin:/usr/syno/sbin:/usr/syno/bin:/usr/local/sbin #export PATH 复制代码 这两行之前加上#号（之前是没有的）然后esc ： wq 回车 保存使用群晖系统自带的重新启动， 重启（不是物理按键，也不能使用命令行reboot）之后用 ipkg Update 复制代码","tags":[{"name":"NAS","slug":"NAS","permalink":"http://7086.site/tags/NAS/"}]},{"title":"世隔多年的回归","date":"2020-06-30T03:58:00.000Z","path":"posts/43611.html","text":"多年没写博文了，最近买个nas玩玩，写一些学习笔记，以防多年后自己老年痴呆。 博客定义为私人云笔记本，记录一些私认为比较重要又 要偶尔查询的东西 以后也分享一些比较好用的环保方面办公类应用 就酱","tags":[{"name":"心态","slug":"心态","permalink":"http://7086.site/tags/%E5%BF%83%E6%80%81/"}]},{"title":"水解酸化处理与厌氧处理的区别","date":"2017-02-06T15:02:12.000Z","path":"posts/6087.html","text":"水解酸化实际上就是厌氧消化. 水解酸化是厌氧的第一和第二个过程,就是为了防止沼气产生,将其控制在水解和酸化阶段,只要目的是为了提高废水的生化性,以利于以后的好氧生物处理,一般用于COD相对较低的工艺中 厌氧主要用于高负荷的污水处理. 沼气发酵有三个阶段,水解、酸化、甲烷化三个阶段.水解酸化就是用于一、二阶段,厌氧池用于甲烷化. 水解酸化池是为提高可生化行.减少厌氧停留时间.DO一般在0~0.2. 厌氧池是为了高效降解COD的. 这里的A不是厌氧，而是缺氧，厌氧还缺氧是有本质不同的。 缺氧一般溶解氧在0.5mg/L以下，少量的曝气会机械搅拌都是没问题的 而厌氧溶解氧在0.2mg/L以下，绝对不能曝气","tags":[{"name":"废水设计","slug":"废水设计","permalink":"http://7086.site/tags/%E5%BA%9F%E6%B0%B4%E8%AE%BE%E8%AE%A1/"}]},{"title":"旋风除尘器与布袋除尘器的区别","date":"2017-01-04T09:32:02.000Z","path":"posts/33441.html","text":"旋风除尘器与布袋除尘器都是气流烘干机设备、干燥设备系统中重要的组成部分，主要用来对高粉尘废气进行粉尘回收和捕集。但是他们究竟有何不同，我们对其分别做一详细介绍，以来做为区分。 一、旋风除尘器 旋风除尘器也叫旋风分离器广泛应用在对流干燥、烘干系统中，是从气体中收集产品的主要除尘设备。旋风分离器结构简单，制造方便，只要设计合理，制造恰当，可以获得很高的分离效率。对含尘量很高的气体，同样可以直接进行分离，并且压力损失也比较小，没有运动部件，所以经久耐用。除了磨削性物料对旋风分离器的内壁产生磨损或细粉粘附外，没有其它缺点。在正常情况下，理论上旋风分离器能够捕集5μm以上的粉体，分离效率可达90％以上。但是，在实际生产运行中，往往由于制造不良，安装使用不当或操作管理不完善等原因，造成分离效率下降。一般只有50%～80%，有时甚至更低。 二、布袋除尘器 布袋除尘器（袋滤器或袋式除尘器）经常作为从干燥尾气中分离粉状产品的最后一级气固分离设备，是截留尾气中粉体的最后一道防线。布袋除尘器的特点是捕集效率高，可以说，在众多的气固分离设备中，它的捕集效率是其它设备所不及的，特别是捕集20μm以下的粒子时更加明显，效率达到99％以上。布袋除尘器主要由滤袋、袋架和壳体组成，壳体由箱体和净气室组成，布袋安装在箱体与净气室中间的隔板上。含尘气体进入箱体后，粉体产生惯性、扩散、粘附、静电作用附着在滤布表面，清洁气体穿过滤布的孔隙从净气室排出，滤布上的粉尘通过反吹或振击作用脱离滤布而堕入料斗中。","tags":[{"name":"除尘","slug":"除尘","permalink":"http://7086.site/tags/%E9%99%A4%E5%B0%98/"}]},{"title":"常用的化学基团及物质名称缩写","date":"2016-10-24T05:50:00.000Z","path":"posts/40207.html","text":"Me甲基Et乙基n-Pr正丙基i-Pr异丙基n-Bu正丁基s-Bu仲丁基i-Bu异丁基t-Bu叔丁基Ts对甲基苯磺酰基Ms甲磺酰基TMS三甲基硅基TBDMS二甲基叔丁基硅基Bn苄基Boc叔丁氧羰基Ac乙酰基Ph苯基 起始字母为 A英文缩写 全称A/MMA 丙烯腈/甲基丙烯酸甲酯共聚物AA 丙烯酸AAS 丙烯酸酯-丙烯酸酯-苯乙烯共聚物ABFN 偶氮(二)甲酰胺ABN 偶氮(二)异丁腈ABPS 壬基苯氧基丙烷磺酸钠ABR 聚丙烯酸酯ABS 苯乙烯-丙烯腈-丁二烯共聚物ABVN 偶氮(二)异庚腈AC 偶氮(二)碳酰胺ACB 2-氨基-4-氯苯胺ACNU 嘧啶亚硝脲ACP 三氧化铝ACR 丙烯酸脂共聚物ACS 苯乙烯-丙烯腈-氯化聚乙烯共聚物ACTA 促皮质素ADC 偶氮甲酰胺ADCA 偶氮二甲酰胺AE 脂肪醇聚氧乙烯醚AES 脂肪醇聚氧乙烯醚硫酸酯钠盐AI 酰胺-酰亚胺(聚合物)AK 醇酸树脂AM 丙烯酰胺AN 丙烯腈AN-AE 丙烯腈-丙烯酸酯共聚物ANM 丙烯腈-丙烯酸酯合成橡胶AP 多羟基胺基聚醚APP 无规聚丙烯AR 丙烯酸酯橡胶AS 丙烯腈-苯乙烯共聚物ASA 丙烯腈-苯乙烯-丙烯酸酯共聚物ATT 靛蓝AU 聚酯型聚氨酯橡胶AW 6-乙氧基-2，2，4-三甲基-1，2-二氢化喹啉起始字母为 B英文缩写 全称BAA 正丁醛苯胺缩合物BAC 碱式氯化铝BACN 新型阻燃剂BAD 双水杨酸双酚A酯BAL 2，3-巯(基)丙醇BBP 邻苯二甲酸丁苄酯BBS N-叔丁基-乙-苯并噻唑次磺酰胺BC 叶酸BCD β－环糊精BCG 苯顺二醇BCNU 氯化亚硝脲BD 丁二烯BE 丙烯酸乳胶外墙涂料BEE 苯偶姻乙醚BFRM 硼纤维增强塑料BG 丁二醇BGE 反应性稀释剂BHA 特丁基-4羟基茴香醚BHT 二丁基羟基甲苯BL 丁内酯BLE 丙酮-二苯胺高温缩合物BLP 粉末涂料流平剂BMA 甲基丙烯酸丁酯BMC 团状模塑料BMU 氨基树脂皮革鞣剂BN 氮化硼BNE 新型环氧树脂BNS β－萘磺酸甲醛低缩合物BOA 己二酸辛苄酯BOP 邻苯二甲酰丁辛酯BLP 粉末涂料流平剂BMA 甲基丙烯酸丁酯BMC 团状模塑料BMU 氨基树脂皮革鞣剂BN 氮化硼BNE 新型环氧树脂BNS β－萘磺酸甲醛低缩合物BOA 己二酸辛苄酯BOP 邻苯二甲酰丁辛酯BPP 过氧化特戊酸特丁酯BPPD 过氧化二碳酸二苯氧化酯BPS 4，4’-硫代双(6-特丁基-3-甲基苯酚)BPTP 聚对苯二甲酸丁二醇酯BR 丁二烯橡胶BRN 青红光硫化黑BROC 二溴(代)甲酚环氧丙基醚BS 丁二烯-苯乙烯共聚物BS-1S 新型密封胶BSH 苯磺酰肼BSU N，N’-双(三甲基硅烷)脲BT 聚丁烯-1热塑性塑料BTA 苯并三唑BTX 苯-甲苯-二甲苯混合物BX 渗透剂BXA 己二酸二丁基二甘酯BZ 二正丁基二硫代氨基甲酸锌起始字母为 C英文缩写 全称CA 醋酸纤维素CAB 醋酸-丁酸纤维素CAN 醋酸-硝酸纤维素CAP 醋酸-丙酸纤维素CBA 化学发泡剂CDP 磷酸甲酚二苯酯CF 甲醛-甲酚树脂,碳纤维CFE 氯氟乙烯CFM 碳纤维密封填料CLF 含氯纤维CMC 羧甲基纤维素CMCNa 羧甲基纤维素钠CMD 代尼尔纤维CMS 羧甲基淀粉CN 硝酸纤维素CNA α-蒎烯树脂CFRP 碳纤维增强塑料COPP 共聚聚丙烯CP 丙酸纤维素CPE 氯化聚乙烯CPL 己内酰胺CPPG 聚氯醚CPVC 氯化聚氯乙烯(过氯乙烯 )CR 氯丁橡胶CS 酪蛋白塑料(酪素塑料)CSPE 氯横化聚乙烯CTA 三醋酸纤维素CTEE 三氟氯乙烯(氯化三氟乙烯)CUP 铜氨纤维CV 粘胶纤维起始字母为 D英文缩写 全称DAF 富马酸二烯丙酯DAIP 间苯二甲酸二烯丙酯DAM 马来酸二烯丙酯DAP 间苯二甲酸二烯丙酯DATBP 四溴邻苯二甲酸二烯丙酯DBA 己二酸二丁酯DBEP 邻苯二甲酸二丁氧乙酯DBP 邻苯二甲酸二丁酯DBR 二苯甲酰间苯二酚DBS 癸二酸二癸酯DCCA 二氯异氰脲酸DCCK 二氯异氰脲酸钾DCCNa 二氯异氰脲酸钠DCHP 邻苯二甲酸二环乙酯DCPD 过氧化二碳酸二环乙酯DDA 己二酸二癸酯DDP 邻苯二甲酸二癸酯DEAE 二乙胺基乙基纤维素DEP 邻苯二甲酸二乙酯DETA 二乙撑三胺DFA 薄膜胶粘剂DHA 己二酸二己酯DHP 邻苯二甲酸二己酯DHS 癸二酸二己酯DIBA 己二酸二异丁酯DIDA 己二酸二异癸酯DIDG 戊二酸二异癸酯DIDP 邻苯二甲酸二异癸酯DINA 己二酸二异壬酯DINP 邻苯二甲酸二异壬酯DINZ 壬二酸二异壬酯DIOA 己酸二异辛酯DIOP 邻苯二甲酸二异辛酯DIOS 癸二酸二异辛酯DIOZ 壬二酸二异辛酯DIPA 二异丙醇胺DMA 二甲胺DMC 碳酸二甲酯DMEP 邻苯二甲酸二甲氧基乙酯DMF 二甲基甲酰胺DMP 邻苯二甲酸二甲酯DMS 癸二酸二甲酯DMSO 二甲基亚砜DMT 对苯二甲酸二甲酯DNA 己二酸二壬酯DNP 邻苯二甲酸二壬酯DNS 癸二酸壬酯DOP 邻苯二甲酸二辛酯DOPP 对苯二甲酸二辛酯DOS 癸二酸二辛酯DOTP 对苯二甲酸二异辛酯DOZ 壬二酸二辛酯DPA 二苯胺DVB 二乙烯基苯起始字母为 E英文缩写 全称E/EA 乙烯/丙烯酸乙酯共聚物E/P 乙烯/丙烯共聚物E/P/D 乙烯/丙烯/二烯三元共聚物E/TEE 乙烯/四氟乙烯共聚物E/VAC 乙烯/醋酸乙烯酯共聚物E/VAL 乙烯/乙烯醇共聚物EAA 乙烯-丙烯酸共聚物EAK 乙基戊丙酮EBM 挤出吹塑模塑EC 乙基纤维素ECB 乙烯共聚物和沥青的共混物ECD 环氧氯丙烷橡胶ECTEE 聚(乙烯-三氟氯乙烯)ED-3 环氧酯EDC 二氯乙烷EDTA 乙二胺四醋酸EEA 乙烯-醋酸丙烯共聚物EG 乙二醇2-EH ： 异辛醇EO 环氧乙烷EOT 聚乙烯硫醚EP 环氧树脂EPI 环氧氯丙烷EPM 乙烯-丙烯共聚物EPOR 三元乙丙橡胶EPR 乙丙橡胶EPS 可发性聚苯乙烯EPSAN 乙烯-丙烯-苯乙烯-丙烯腈共聚物EPT 乙烯丙烯三元共聚物EPVC 乳液法聚氯乙烯EU 聚醚型聚氨酯EVA 乙烯-醋酸乙烯共聚物EVE 乙烯基乙基醚EXP 醋酸乙烯-乙烯-丙烯酸酯三元共聚乳液起始字母为 F英文缩写 全称F/VAL 乙烯/乙烯醇共聚物F-23 四氟乙烯-偏氯乙烯共聚物F-30 三氟氯乙烯-乙烯共聚物F-40 四氟氯乙烯-乙烯共聚物FDY 丙纶全牵伸丝FEP 全氟(乙烯-丙烯)共聚物FNG 耐水硅胶FPM 氟橡胶FRA 纤维增强丙烯酸酯FRC 阻燃粘胶纤维FRP 纤维增强塑料FRPA-101 玻璃纤维增强聚癸二酸癸胺(玻璃纤维增强尼龙1010树脂)FRPA-610 玻璃纤维增强聚癸二酰乙二胺(玻璃纤维增强尼龙610树脂)FWA 荧光增白剂起始字母为 G英文缩写 全称GF 玻璃纤维GFRP 玻璃纤维增强塑料GFRTP 玻璃纤维增强热塑性塑料促进剂GOF 石英光纤GPS 通用聚苯乙烯GR-1 异丁橡胶GR-N 丁腈橡胶GR-S 丁苯橡胶GRTP 玻璃纤维增强热塑性塑料GUV 紫外光固化硅橡胶涂料GX 邻二甲苯GY 厌氧胶起始字母为 H英文缩写 全称H 乌洛托品HDI 六甲撑二异氰酸酯HDPE 低压聚乙烯(高密度)HEDP 1-羟基乙*-1，1-二膦酸HFP 六氟丙烯HIPS 高抗冲聚苯乙烯HLA 天然聚合物透明质胶HLD 树脂性氯丁胶HM 高甲氧基果胶HMC 高强度模塑料HMF 非干性密封胶HOPP 均聚聚丙烯HPC 羟丙基纤维素HPMC 羟丙基甲基纤维素HPMCP 羟丙基甲基纤维素邻苯二甲酸酯HPT 六甲基磷酸三酰胺HS 六苯乙烯HTPS 高冲击聚苯乙烯起始字母为 I英文缩写 全称IEN 互贯网络弹性体IHPN 互贯网络均聚物IIR 异丁烯-异戊二烯橡胶IO 离子聚合物IPA 异丙醇IPN 互贯网络聚合物IR 异戊二烯橡胶IVE 异丁基乙烯基醚起始字母为 J英文缩写 全称JSF 聚乙烯醇缩醛胶JZ 塑胶粘合剂起始字母为 K英文缩写 全称KSG 空分硅胶起始字母为 L英文缩写 全称LAS 十二烷基苯磺酸钠LCM 液态固化剂LDJ 低毒胶粘剂LDN 氯丁胶粘剂LDPE 高压聚乙烯(低密度)LDR 氯丁橡胶LF 脲LGP 液化石油气LHPC 低替代度羟丙基纤维素LIM 液体侵渍模塑LIPN 乳胶互贯网络聚合物LJ 接体型氯丁橡胶LLDPE 线性低密度聚乙烯LM 低甲氧基果胶LMG 液态甲烷气LMWPE 低分子量聚乙稀LN 液态氮LRM 液态反应模塑LRMR 增强液体反应模塑LSR 羧基氯丁乳胶起始字母为 M英文缩写 全称MA 丙烯酸甲酯MAA 甲基丙烯酸MABS 甲基丙烯酸甲酯-丙烯腈-丁二烯-苯乙烯共聚物MAL 甲基丙烯醛MBS 甲基丙烯酸甲酯-丁二烯-苯乙烯共聚物MBTE 甲基叔丁基醚MC 甲基纤维素MCA 三聚氰胺氰脲酸盐MCPA-6 改性聚己内酰胺(铸型尼龙6)MCR 改性氯丁冷粘鞋用胶MDI 3，3’-二甲基-4，4’-二氨基二苯甲烷MDI 二苯甲烷二异氰酸酯(甲撑二苯基二异氰酸酯)MDPE 中压聚乙烯(高密度)MEK 丁酮(甲乙酮)MEKP 过氧化甲乙酮MES 脂肪酸甲酯磺酸盐MF 三聚氰胺-甲醛树脂M-HIPS 改性高冲聚苯乙烯MIBK 甲基异丁基酮MMA 甲基丙烯酸甲酯MMF 甲基甲酰胺MNA 甲基丙烯腈MPEG 乙醇酸乙酯MPF 三聚氨胺-酚醛树脂MPK 甲基丙基甲酮M-PP 改性聚丙烯MPPO 改性聚苯醚MPS 改性聚苯乙烯MS 苯乙烯-甲基丙烯酸甲酯树脂MSO 石油醚MTBE 甲基叔丁基醚MTT 氯丁胶新型交联剂MWR 旋转模塑MXD-10/6 醇溶三元共聚尼龙MXDP 间苯二甲基二胺起始字母为 N英文缩写 全称NBR 丁腈橡胶NDI 二异氰酸萘酯NDOP 邻苯二甲酸正癸辛酯NHDP 邻苯二甲酸己正癸酯NHTM 偏苯三酸正己酯NINS 癸二酸二异辛酯NLS 正硬脂酸铅NMP N-甲基吡咯烷酮NODA 己二酸正辛正癸酯NODP 邻苯二甲酸正辛正癸酯NPE 壬基酚聚氧乙烯醚NR 天然橡胶起始字母为 O英文缩写 全称OBP 邻苯二甲酸辛苄酯ODA 己二酸异辛癸酯ODPP 磷酸辛二苯酯OIDD 邻苯二甲酸正辛异癸酯OPP 定向聚丙烯(薄膜)OPS 定向聚苯乙烯(薄膜)OPVC 正向聚氯乙烯OT 气熔胶起始字母为 P英文缩写 全称PA 聚酰胺(尼龙)PA-1010 聚癸二酸癸二胺(尼龙1010)PA-11 聚十一酰胺(尼龙11)PA-12 聚十二酰胺(尼龙12)PA-6 聚己内酰胺(尼龙6)PA-610 聚癸二酰乙二胺(尼龙610)PA-612 聚十二烷二酰乙二胺(尼龙612)PA-66 聚己二酸己二胺(尼龙66)PA-8 聚辛酰胺(尼龙8)PA-9 聚9-氨基壬酸(尼龙9)PAA 聚丙烯酸PAAS 水质稳定剂PABM 聚氨基双马来酰亚胺PAC 聚氯化铝PAEK 聚芳基醚酮PAI 聚酰胺-酰亚胺PAM 聚丙烯酰胺PAMBA 抗血纤溶芳酸PAMS 聚α－甲基苯乙烯PAN 聚丙烯腈PAP 对氨基苯酚PAPA 聚壬二酐PAPI 多亚甲基多苯基异氰酸酯PAR 聚芳酰胺PAR 聚芳酯(双酚A型)PAS 聚芳砜(聚芳基硫醚)PB 聚丁二烯-［1，3］PBAN 聚(丁二烯-丙烯腈)PBI 聚苯并咪唑PBMA 聚甲基丙烯酸正丁酯PBN 聚萘二酸丁醇酯PBR 丙烯-丁二烯橡胶PBS 聚(丁二烯-苯乙烯)PBT 聚对苯二甲酸丁二酯PC 聚碳酸酯PC/ABS 聚碳酸酯/ABS树脂共混合金PC/PBT 聚碳酸酯/聚对苯二甲酸丁二醇酯弹性体共混合金PCD 聚羰二酰亚胺PCDT 聚(1，4-环己烯二亚甲基对苯二甲酸酯)PCE 四氯乙烯PCMX 对氯间二甲酚PCT 聚对苯二甲酸环己烷对二甲醇酯PCT 聚己内酰胺PCTEE 聚三氟氯乙烯PD 二羟基聚醚PDAIP 聚间苯二甲酸二烯丙酯PDAP 聚对苯二甲酸二烯丙酯PDMS 聚二甲基硅氧烷PE PEA 聚丙烯酸酯PEAM 苯乙烯型聚乙烯均相离子交换膜PEC 氯化聚乙烯PECM 苯乙烯型聚乙烯均相阳离子交换膜PEE 聚醚酯纤维PEEK 聚醚醚酮PEG 聚乙二醇PEHA 五乙撑六胺PEN 聚萘二酸乙二醇酯PEO 聚环氧乙烷PEOK 聚氧化乙烯PEP 对-乙基苯酚聚全氟乙丙烯薄膜PES 聚苯醚砜PET 聚对苯二甲酸乙二酯PETE 涤纶长丝PETP 聚对苯二甲酸乙二醇酯PF 酚醛树脂PF/PA 尼龙改性酚醛压塑粉PF/PVC 聚氯乙烯改性酚醛压塑粉PFA 全氟烷氧基树脂PFG 聚乙二醇PFS 聚合硫酸铁PG 丙二醇PGEEA 乙二醇(甲)乙醚醋酸酯PGL 环氧灌封料PH 六羟基聚醚PHEMA 聚(甲基丙烯酸-2-羟乙酯)PHP 水解聚丙烯酸胺PI 聚异戊二稀PIB 聚异丁烯PIBO 聚氧化异丁烯起始字母为 R英文缩写 全称RE 橡胶粘合剂RF 间苯二酚-甲醛树脂RFL 间苯二酚-甲醛乳胶RP 增强塑料RP/C 增强复合材料RX 橡胶软化剂起始字母为 S英文缩写 全称S/MS 苯乙烯-α-甲基苯乙烯共聚物SAN 苯乙烯-丙烯腈共聚物SAS 仲烷基磺酸钠SB 苯乙烯-丁二烯共聚物SBR 丁苯橡胶SBS 苯乙烯-丁二烯-苯乙烯嵌段共聚物SC 硅橡胶气调织物膜SDDC N，N-二甲基硫代氨基甲酸钠SE 磺乙基纤维素SGA 丙烯酸酯胶SI 聚硅氧烷SIS 苯乙烯-异戊二烯-苯乙烯嵌段共聚物SIS/SEBS 苯乙烯-乙烯-丁二烯-苯乙烯共聚物SM 苯乙烯SMA 苯乙烯-顺丁烯二酸酐共聚物SPP ： 间规聚苯乙烯SPVC 悬浮法聚氯乙烯SR 合成橡胶ST 矿物纤维起始字母为 T英文缩写 全称TAC 三聚氰酸三烯丙酯TAME 甲基叔戊基醚TAP 磷酸三烯丙酯TBE 四溴乙烷TBP 磷酸三丁酯TCA 三醋酸纤维素TCCA 三氯异氰脲酸TCEF 磷酸三氯乙酯TCF 磷酸三甲酚酯TCPP 磷酸三氯丙酯TDI 甲苯二异氰酸酯TEA 三乙胺TEAE 三乙氨基乙基纤维素TEDA 三乙二胺TEFC 三氟氯乙烯TEP 磷酸三乙酯TFE 四氟乙烯THF 四氢呋喃TLCP 热散液晶聚酯TMP 三羟甲基丙烷TMPD 三甲基戊二醇TMTD 二硫化四甲基秋兰姆(硫化促进剂TT)TNP 三壬基苯基亚磷酸酯TPA 对苯二甲酸TPE 磷酸三苯酯TPS 韧性聚苯乙烯TPU 热塑性聚氨酯树脂TR 聚硫橡胶TRPP 纤维增强聚丙烯TR-RFT 纤维增强聚对苯二甲酸丁二醇酯TRTP 纤维增强热塑性塑料TTP 磷酸二甲苯酯起始字母为 U英文缩写 全称U 脲UF 脲甲醛树脂UHMWPE 超高分子量聚乙烯UP 不饱和聚酯起始字母为 W英文缩写 全称WF 新型橡塑填料WP 织物涂层胶WRS 聚苯乙烯球形细粒起始字母为 X英文缩写 全称XF 二甲苯-甲醛树脂XMC 复合材料起始字母为 Y英文缩写 全称YH 改性氯丁胶YM 聚丙烯酸酯压敏胶乳YWG 液相色谱无定型微粒硅胶起始字母为 Z英文缩写 全称ZE 玉米纤维ZH 溶剂型氯化天然橡胶胶粘剂ZN 粉状脲醛树脂胶","tags":[{"name":"知识点","slug":"知识点","permalink":"http://7086.site/tags/%E7%9F%A5%E8%AF%86%E7%82%B9/"}]},{"title":"孔隙率和空隙率","date":"2016-10-24T05:22:32.000Z","path":"posts/4775.html","text":"**(1)**材料的孔隙率 材料的孔隙率是指，材料内部孔隙的体积占材料总体积的百分率，它以P 表示。孔隙率P的计算公式为： P _——_材料孔隙率，％；_V_0 _——_材料在自然状态下的体积，或称表观体积，cm3或m3；V _——_材料的绝对密实体积，cm3或m3。 材料内部除了孔隙的多少以外，孔隙的特征状态也是影响其性质的重要因素之一。材料的孔特征表现为，孔隙是在材料内部被封闭的，还是在材料的表面与外界连通。前者为闭口孔，后者为开口孔。有的孔隙在材料内部是被分割为独立的，还有的孔隙在材料内部相互连通。此外，孔隙尺寸的大小、孔隙在材料内部的分布均匀程度等都是孔隙在材料内部的特征表现。 与材料孔隙率相对应的另一个概念，是材料的密实度。密实度表示材料内被固体所填充的程度，它在量上反映了材料内部固体的含量，对于材料性质的影响正好与孔隙率的影响相反。(2)材料的空隙率材料空隙率是指，散粒状材料堆积体积（_V_）中，颗粒间空隙体积所占的百分率，它以_P_′表示。空隙率_P_′的计算公式为： _P_′_——_材料空隙率，％；V _——_材料的自然堆积体积，cm3或m3；_V_0 _——_材料的颗粒体积，cm3或m3。 空隙率考虑的是材料颗料间的空隙，这对填充和粘结散粒材料时，研究散粒状材料的空隙结构和计算胶结材料的需要量十分重要。 个人理解 孔隙率：气体流过球床通道，气体流域是孔，许多金属球搭桥法形成一块金属，对体积运算，孔隙率=孔/（孔+金属） 空隙率：与孔隙率的区别是这些金属球是分散的，没有用搭桥法形成一个整体，各实心金属球的体积之和是金属体积。","tags":[{"name":"知识点","slug":"知识点","permalink":"http://7086.site/tags/%E7%9F%A5%E8%AF%86%E7%82%B9/"}]},{"title":"关于矢量字体type1/TrueType/OpenType","date":"2016-10-12T03:46:07.000Z","path":"posts/39924.html","text":"关于矢量字体type1/TrueType/OpenType 矢量字体是与点阵字体相对应的一种字体。矢量字体的每个字形都是通过数学方程来描述的，一个字形上分割出若干个关键点，相邻关键点之间由一条光 滑曲线连接，这条曲线可以由有限个参数来唯一确定。矢量字的好处是字体可以无级缩放而不会产生变形。目前主流的矢量字体格式有3 种：Type1，TrueType和OpenType，这三种格式都是平台无关的。 Type1全称PostScript Type1，是1985年由Adobe公司提出的一套矢量字体标准，由于这个标准是基于PostScript Description Language(PDL)，而PDL又是高端打印机首选的打印描述语言，所以Type1迅速流行起来。但是Type1是非开放字体，Adobe对使用 Type1的公司征收高额的使用费。 TrueType是1991年由Apple公司与Microsoft公司联合提出另一套矢量字标准。 Type1使用三次贝塞尔曲线来描述字形，TrueType则使用二次贝塞尔曲线来描述字形。所以Type1的字体比TrueType字体更加 精确美观。一个误解是：Type1字体比TrueType字体占用空间多。这是因为同样描述一个圆形，二次贝塞尔曲线只需要8个关键点和7段二次曲线；而 三次贝塞尔曲线则需要12个关键点和11段三次曲线。然而实际情况是一般来说 Type1比TrueType要小10%左右。这是因为对于稍微复杂的字形，为了保持平滑，TrueType必须使用更多的关键点。由于现代大部分打印机 都是使用PDL作为打印描述语言，所以True1字体打印的时候不会产生形变，速度快；而TrueType则需要翻译成PDL，由于曲线方程的变化，还会 产生一定的形变，不如Type1美观。 这么说来，Type1应该比TrueType更具有优势，为什么如今的计算机上TrueType反而比Type1使用更广泛呢？ 这是因为第一：Type1由于字体方程的复杂，所以在屏幕上渲染的时候，花费的时间多，解决方案是大部分Type1字体嵌入了点阵字体，这样渲染快， 但是边缘不光滑，比较难看。很多PS文档和PS转换的PDF文档都是这样，在计算机上浏览的时候字体很难看，但是打印出来很美观。TrueType则渲染 比较快，可以平滑的显示在屏幕上，看上去很美观。 第二个原因是Type1的高额使用费，使得Type1没有被所有的操作系统所支持。Windows家族只有OS/2和windows 2000及之后的版本从操作系统级别开始支持Type1。由于这个问题，Adobe只好在其所有的产品中嵌入Adobe Type Manager(ATM)作为渲染引擎。 OpenType则是Type1与TrueType之争的最终产物。1995年，Adobe公司和Microsoft公司开始联手开发一种兼容 Type1和TrueType，并且真正支持Unicode的字体，后来在发布的时候，正式命名为OpenType。OpenType可以嵌入Type1 和TrueType，这样就兼有了二者的特点，无论是在屏幕上察看还是打印，质量都非常优秀。可以说OpenType是一个三赢的结局，无论是 Adobe，Microsoft还是最终用户，都从OpenType中得到了好处。Windows家族从Windows 2000开始，正式支持OpenType。打开系统的字体目录（一般是C:WindowsFonts或C:WinntFonts），可以看到： 一个红色A的图标的是点阵字体，两个重叠的T的图标是TrueType字体，一个O的图标就是OpenType字体。","tags":[]},{"title":"热风循环烘箱的工作原理","date":"2016-08-10T07:40:40.000Z","path":"posts/51524.html","text":"热风循环烘箱属于通风干燥设备，又叫厢式干燥机，是一种对流式干燥机，整体呈封闭的箱体结构，故称作热风循环烘箱，它的用途非常广泛，适合批量不大的物料干燥，可用于医药、化工、食品、农副产品、水产品、轻工等行业物料的加热固化、干燥脱水。 热风循环烘箱的结构 热风循环烘箱主要由箱体、料盘、保温层、加热器、风机等组成。镕体采用轻金属材料制作，内壁为耐腐的不锈钢，中间为用耐火、耐潮的石棉等材料填充的绝热保温层。内置多层框架的料盘椎车。加热器通常采用电加热、热风炉加热以及翘片式水蒸气排管等，利用风机实现空气对流。为提高利用率，盛装物料的料盘通常摆放在推车上，整车进出。根据被干燥物料的外形和干燥介质的循环方向，推车呈不同结构，如用丁松散物料的浅盘推车、用于砖形物摆放的平板推车、物料悬娃推车、托盘推车等，有的箱底设有导轨，方便小车进出。 根据气流流动与物料间的关系分为平流式和穿流式。 在平流式热风循环烘箱中，热风沿平行于物料的方向从物料表面通过进行干燥。箱内风速约o．5—3m／s，物料厚度约20一50mm。因热空气只在物料表面流过，传热系数一般较低，热利用率较差，物料干燥均匀性相关较差。 穿流式热风循环烘箱的整体结构与平流式基本相同。物料干燥时，由于料盘为金属网或多孔板结构，热风呈穿流形式通过料层内，风速约为o．4—1．2m／s．物料厚度45—65mm。物料干燥速率较快，但动力消耗较大，使用时应避免物料的飞散。 这两种方式各有利弊，具体情况还要根据物料的性质来选取。 热风循环烘箱的废气可再循环使用，适量补充新鲜空气用以维持热风在干燥物料时足够的除湿能力。 热风循环烘箱性能主要影响因素 热风速率 为了提高干燥速率，需要有较大的传热系数率；同时，风速应小于物料临界风速，以防止物料被带出。 物料层的间炉 在烘箱内，多层框架L料盘之间形成了空气流动的通道。空气通道的大小凸框架层数有关，它对干燥介质的流速、流动方向和分布又与流速有关。 物料层的厚度 为丁保证干燥物料的质量，除采取降低厢内循环热风温度外，减小物料层厚度也是一个措施。物料层厚度由实验确定，通常为10一100mm。 风机的风量 风机的风量根据计算所得的理论值(丰气量)和干燥器内泄漏量等因素确定。为了使气流不出现死角，风机应安装在合适的位置，同时安装整流板，以控制风向，使热风分布均匀。","tags":[{"name":"废气设计","slug":"废气设计","permalink":"http://7086.site/tags/%E5%BA%9F%E6%B0%94%E8%AE%BE%E8%AE%A1/"}]},{"title":"计算活性炭吸附塔内风压的方法（仅供参考）","date":"2016-08-09T06:18:17.000Z","path":"posts/60.html","text":"通常用活性炭吸附塔来吸附有毒有害的气体，将废气处理至符合空气污染排放标准才允许排放，以免造成环境和人员危害。塔内的风压对于吸附性也是至关重要的，那么塔内风压如何计算呢?一、活性炭罐的其他设计参数：A、炭层高度： 0.2-0.5M B、表观接触：0.2~2.0S 标准1.2SC、流速：一般的流速范围是5-50cm/s 流速慢，吸附层短，设备大。流速快，设备小，吸收层长，破过时间短，吸收期变短。所以，一般工业上采用范围是20-40CM/S。二、压损计算，压力损失计算公式：△p=K 。Z。U1.5，4-8 mesh破碎炭 k=0.011，6-10mesh 破碎炭 k=0.023，4-6 mm 造粒炭 k=0.0036。P：压力损失 mm H2O，Z：活性炭层高 cm，U：气体线速度 cm/s，K：常数 1mmHg=133Pa,Hg的密度是水的13.6倍,所以1mmH2O=133/13.6=9.78Pa 按造粒炭计算，以风速0.6m/s，炭层高度H，则压力损失在1636H。三、气相用活性炭形状和粒度：气相吸附时，溶剂回收恶臭处理等吸收塔填充方式所使用的活性炭：破碎状4-8目，造粒炭3-6mm ,对于压力损失和气体的均一性，造粒炭有独到之处。四、气相吸附与水分的关系：含有不纯物的气体通过填充有活性炭的活性炭吸附塔，以达到净化气体的目的。和液相吸附一 样，吸附带和压力损失是重要的。气体吸附必须考虑到气体中的水分，活性炭本来是殊水性的，对水 没有亲和里，但是，气体具有较高的相对湿度时能吸附一定水分。在活性炭的表面，对有机物的吸附亲和力比对水吸附亲和力强，进入细孔内部的有机物和已被吸附 的水进行置换。吸附是放热反应，虽然由于放热的影响吸收量有些减少，但被置换水的脱离和蒸发能抑制放热反应，所以水分的影响可以忽视。但是，相对湿度很高时水分的影响不 可忽视。如活性炭内部的水分很多，有机物必须通过水层才能到活性炭内表面的吸附点，由于水中的扩散速度远远小于气相的扩散速度，导致吸附层变长，破过时间 变短。活性炭对水的吸附力，相对湿度超过70%，吸收量急剧增加，所以气体中水的相对湿度应在70%以下。气体温度上升，虽然相对湿度下降，但吸收能力也降低，所以效果一般。五、吸附塔直径和碳层高度的计算直径应根据要处理的气量来确定，一般选空塔气体速度(如选0.5米/秒)则就确定了塔径。碳层高度是根据进塔时在气体中要吸附物量的多少与出塔时在气体中要吸附物要控制量的多少来确定，一般用气体在活性碳中停留时间的确定而定出碳层高度。再根据结构需要确定塔的高度。了解活性炭吸附塔的直径和碳层高度以及塔内风压有助于了解设备的吸附能力，因此这都是必要的步骤。","tags":[{"name":"活性炭","slug":"活性炭","permalink":"http://7086.site/tags/%E6%B4%BB%E6%80%A7%E7%82%AD/"}]},{"title":"去除 CAD 教育版打印戳记后文件失效","date":"2016-08-03T05:55:50.000Z","path":"posts/13935.html","text":"解决这个问题的方法就是利用cad迷你画图，打开文件后选中复制到autocad中即可，重新保存文件。 以下是老方法 打开的带有 Auto CAD 教育版打印戳记的图纸,开始,会弹出对话框提示:貌似:检测 到教育版打印错戳记.如果继续操作,图形在打印时将带有以下标题:”由 AUTODESK 教育 版产品生成”之类的话语. 而且, 从带有这个戳记的 CAD 文件里复制出东西到自己创建的新 的 CAD 文件里,貌似由 AUTODESK 教育版产品生成”之类的对话框也跟着过来了,很不爽! 如何解决去除 Auto CAD 教育版打印戳记的问题呢? 1、不需要借助任何外部软件,直接用 AUTOCAD 软件来解决.先将 DWG 格式文件另存为 dxf 格式,记住一定要关闭 AUTOCAD。2、再重新启动 AUTOCAD,打开刚保存的 dxf 格式文件, 并另存为 dwg 格式的, 即可去除打印时的 Autodesk 教育版戳记。 3、如果是天正建筑软件设计的图纸，还要选将图纸转换“t3.dwg”格式的文件，再按以上的步骤操作就可以了。转换方法：启动天正建筑→屏幕菜单→文件布图→图形导出→保存较低本的文件。例如：把“景观广场平面图.dwg”通过转换后就成为“景观广场平面图_t3.dwg”了。把CAD2007的保存为CAD2004的或者更低的CAD2000就OK！了。不转换，在进行第二步操作时AUTOCAD 软件认为是无效文件，打不开的。如果不知道要转换，你就认为上面的方法不管用。会恼火的。我摸索了很久才找到上面的方法。非常有效。最后提醒: 转换后布局里的数据可能会丢失一部分数据，请大家要在布局里重新添加窗口，把不要的图层隐藏即可","tags":[{"name":"cad","slug":"cad","permalink":"http://7086.site/tags/cad/"}]},{"title":"PAM与PAC使用说明分析","date":"2016-08-02T16:10:22.000Z","path":"posts/43680.html","text":"1混凝剂的作用及常用药剂 1. 混凝剂的作用 废水中常常含有自然沉降法不能去除的细微悬浮物和胶体污染物，对于这类废水必须首先投加化学药剂来破坏胶体和细微悬浮物在水中形成的稳定分散系，使其聚集为具有明显沉淀性能的絮凝体，然后用重力法予以分离，这一过程包括凝聚和絮凝两步骤，二者总称为混凝。其中，凝聚是指使胶体、超胶体脱稳，凝聚为微絮体的过程，它包括胶体的脱稳，又包括颗粒的迁移和聚集；而絮凝则是微絮颗粒通过吸附、卷带和桥连而更大的絮凝体的过程，它只包括颗粒的迁移和聚集。 2. 混凝剂的混凝机理 投加的药剂有无机多价金属盐类和有机高分子聚合物两大类。前者主要由铝盐和鉄盐，后者主要有聚丙烯酰胺及其变形物。我们常用的无机盐有聚合氯化铝和硫酸亚铁，有机类的是聚丙烯酰胺（PAM）。 铝、铁盐混凝剂的混凝机理十分复杂，简单地说，是它们一系列离解和水解产物对水中胶体及细微悬浮物所具有的压缩双电层、电性中和以及吸附桥连和卷带网捕作用的综合结果。 铝、铁盐混凝剂在水解过程中发挥以下三种作用：Al3+或Fe3+和低聚合度高电荷的多核络离子的脱稳凝聚作用；高聚合度络离子的桥连絮凝作用以及以氢氧化物沉淀形态存在时的网捕絮凝作用，以上三种作用有时可能同时存在，但在不同条件下可能以某一种为主。通常在PH偏低、胶体及细微悬浮物浓度高、投加量尚不足的反应初期，脱稳凝聚是主要形式；在PH较高、污染物浓度低、投加量充分时，网捕作用是主要形式；而在pH和投加量适中时，桥连和絮凝成为主要形式。 聚合氯化铝（简称PAC），又称为碱式氯化铝或羟基氯化铝。通过它或它的水解产物使污水或污泥中的胶体快速形成沉淀，便于分离的大颗粒沉淀物。PAC的分子式为[AL2(OH)nCl6-n]m，其中，n为1-5的任何整数，m为聚合度，即链节的的数目，m的值不大于10。PAC的混凝效果与其中的OH和AL的比值（n值大小）有密切关系，通常用碱化度表示，碱化度 B=[OH]/(3[AL])X100% 。B要求在40-60%，适宜的PH范围5-9 。 鉄盐混凝剂的水解过程及机理与铝盐类似。 聚丙烯酰胺（简称 PAM），俗称絮凝剂或凝聚剂，属于混凝剂。PAM的平均分子量从数千到数千万以上，沿键状分子有若干官能基团，在水中可大部分电离，属于高分子电解质。根据它可离解基团的特性分为阴离子型聚丙烯酰胺、阳离子型聚丙烯酰胺、和非离子型聚丙烯酰胺。PAM外观为白色粉末，易溶于水，几乎不溶于苯，乙醚、酯类、丙酮等一般有机溶剂，聚丙烯酰胺水溶液几近是透明的粘稠液体，属非危险品，无毒、无腐蚀性，固体PAM有吸湿性，吸湿性随离子度的增加而增加，PAM热稳定性好；加热到100℃稳定性良好，但在150℃以上时易分解产中氮气，在分子间发生亚胺化作用而不溶于水，密度：1.302mg/l（23℃）。玻璃化温度153℃，PAM在应力作用下表现出非牛顿流动性。 阳离子、阴离子的PAM分别适用于带阴、阳电荷的污水或污泥。生化法产生的活性污泥带有阴电荷，应该使用阳离子型的。阴离子PAM用于带有阳电荷污水或污泥，如处理钢铁厂、电镀厂、冶金、洗煤及除尘等污水时的效果较好。非离子型的对于阳离子、阴离子都有较好的效果，但是，单价很贵，使处理成本增高。我厂二沉池的污泥用阳离子型的PAM较为合适。 3. 反应条件及投加要求 絮凝池的作用 絮凝池的作用是：使混凝剂加入原水中后，与水体充分混合，水中的大部分胶体杂质失去稳定，脱稳的胶体颗粒在絮凝池中相互碰撞、凝聚，最后形成可以用沉淀方法去除的絮体。 反应条件 絮体长大过程是微小颗粒接触与碰撞的过程。絮凝效果的好坏取决于下面两个因素：一是混凝剂水解后产生的高分子络合物形成吸附架桥的联结能力，这是由混凝剂的性质决定的；一是微小颗粒碰撞的几率和如何控制它们进行合理的有效碰撞。水处理工程学科认为，要想增加碰撞几率就必须增加速度梯度，增加速度梯度就必须增加水体的能耗，也就是增加絮凝池的流速，一方面，如果在絮凝中颗粒凝聚长大得过快会出现两个问题：(1)絮体长得过快其强度则减弱，在流动过程中遇到强的剪切就会使吸附架桥被剪断，被剪断的吸附架桥很难再连续起来，所以絮凝过程也是速度受限过程，随着絮体的长大，水流速度应不断减少，使已形成的絮体不易被打碎。(2)一些絮体过快的长大会使水中絮体比表面积急剧减少，一些反应不完善的小颗粒失去了反应条件，这些小颗粒与大颗粒碰撞几率急剧减少，很难再长大起来，这些颗粒不仅不能为沉淀池所截留，也很难为滤池截留。 投加要求 在投加混凝剂的反应前期，要尽可能增加药剂与污水碰触的机会，加大搅拌或流速。依靠水流与折板碰撞及水流在折板间多次转折提高速度，使水中颗粒碰撞机会增加，使絮体凝聚。而到反应后期，为使速度梯度减小，可以得到较好的絮凝、沉淀效果。 2PAM与PAC加药装置 构成加药装置的主要设备是：溶药罐、储药罐、加药搅拌器、加药泵与计量等设备。具体规格型号（略）。 3PAC配制方法及用量 配制时无特殊要求，配制溶液的重量比浓度一般为10-20%，应用时的投加量一般在200-300PPM左右（每升水中加入200-300mg的PAC）。 4PAM配制方法及用量 1. 配制方法 PAM的使用形态为0.1-0.2%水溶液，用自来水配制，配置时必须注意的是一定要将PAM均匀、分散的落在不断搅拌的水中，并且要确保入水时都是分散的单独颗粒，不形成团，不然，一旦形成大的颗粒团便很难继续溶解了,形成了水包药的大颗粒团。配制时要充分搅拌，使其溶解。配成的溶液容易水解，应在当天用完。 2. 加入量 污水或污泥中加入PAM后要有效混合，混合的时间一般在10-30秒，一般不超过2分钟。PAM的具体使用量与污水或污泥中的胶体、悬浮物的浓度、性质及处理设备等都有很大的关系，处理污水时的用量一般在3-10PPM之内，既每吨水加入3-10克，处理污泥时的用量要多一些，其最佳用量都要通过大量实验取得。根据最佳用量浓度（PPM1欲投加聚丙烯酰胺浓度）和进水流量（t/h）及所配置好的聚丙烯酰胺溶液浓度（PPM2配制的聚丙烯酰胺浓度），可求出加药泵流量计上的显示数值（LPM），即：进水流量（t/h)/60×PPM1欲投加聚丙烯酰胺浓度 /PPM2配制的聚丙烯酰胺浓度。如，进水量=100 t/h, 最佳用量PPM1=10ppm,配制浓度为2‰（3Kg药溶解在1.5t水中），则，加药流量指示应该调在100/60*10/2=8.3LPM刻度上。 注意：ppm是百万分之一；加药泵流量计数值的单位中：右面的，LPM为升/分钟；左面的，GPM为加仑/分钟（不用）。 5注意事项 1. 配制药液时严格按照操作规程及使用说明书进行； 2. 杂物不得混入药液中，以免堵塞加药泵、流量计等； 3. 根据进水量与下达的投加药剂通知单，要及时调整加药量，达到最佳处理效果。","tags":[{"name":"PAM","slug":"PAM","permalink":"http://7086.site/tags/PAM/"}]},{"title":"活性炭更换周期和吸附量的计算","date":"2016-07-29T04:39:00.000Z","path":"posts/25876.html","text":"来自环保之家论坛-废气处理版 案例： 活性炭的吸附量以及使用时间活性炭对不同的有机气体其吸附能力（用S表示）是不一样的，有以下表（参考《工业通风》，孙一坚主编第四版）： 按一个排污企业150mg/m3，风量在50000m3/h，一天工作时长15小时算，活性炭的平衡保持量取30%，1t活性炭达到饱合的时间为： T(d)=m*S/C*10-6（kg/mg）*F*t(15h/d) m：活性炭的质量，kg； S：平衡保持量，%； C:VOCs总浓度，mg/m3； F:风量，m3/h。 则T=1000*0.3/150*10-6*50000*15=2.67d 也就是1t的活性炭在上述条件下，2.67天就达到饱合了。 实例 方法一： 蜂窝活性炭比重：0.45g/cm3 1克/立方厘米=1000千克/立方米 参数：单套设备排风量：25000m3/h，废气总浓度为119.5mg/m3，运行8h/d 所采用蜂窝活性炭吸附的平衡保持量取75%计。 一块蜂窝活性炭质量：0.1×0.1×0.1×450kg/m3=0.45kg 单套设备需要蜂窝活性炭量为：0.8×1.31×1.33÷0.001=1400块×0.45=630kg 根据活性炭更换周期计算公式： T=m×S÷C×10-6×Q×t 式中： T—周期，单位天 M—活性炭的质量，单位kg S—平衡保持量，% 10-6—系数 Q—风量，单位m3/h T—运行时间，单位h/d T1=630×0.75÷119.5×10-6×25000×8=7.91天 所以单套设备蜂窝炭更换周期为约8天 方法二： 蜂窝炭1g能吸附600mg的有机废气 一块蜂窝活性炭质量：0.1×0.1×0.1×450kg/m3=0.45kg 单套设备蜂窝炭重量 0.8×1.31×1.33÷0.001=1400块×0.45=630kg 设备蜂窝炭的吸附能力为： 630kg=630000g 630000g×600mg=378000000mg 总过滤量为25000m3/h×119.5mg/m3=2987500mg/h 吸附满周期T2 378000000mg÷2987500mg/h=126.52h 每天工作8小时算 T2=126.52h÷8=15.81天 因为T2&gt;T1所以本项目活性炭更换周期为8—15天、建议10天一换 来自环保之家论坛-废气处理版，进入原帖发表你的观点","tags":[{"name":"活性炭","slug":"活性炭","permalink":"http://7086.site/tags/%E6%B4%BB%E6%80%A7%E7%82%AD/"}]},{"title":"有机废气吸附设计与计算","date":"2016-07-28T10:15:00.000Z","path":"posts/37157.html","text":"一、****基本原理 1****、吸附原理 当两相组成一个体系时，其组成在相界面与相内部是不同的，处在；两相界面处的成分产生了积蓄（浓缩），这种现象称为吸附。吸附处理废气时，吸附的对象是气态污染物，被吸附的气体组分称为吸附质，吸附气体组分的物质称为吸附剂。 使已被吸附的组分从达到饱和的吸附剂析出，吸附剂得以再生的操作称为脱附。即被吸附于界面的物质在一定条件下，离开界面重新进入体相的过程，也成解吸。而当吸附进行一段时间后，由于表面吸附质的浓集，使其吸附能力明显下降而不能满足吸附净化的要求，此时需要采用一定的措施是吸附剂上已吸附的吸附质脱附，恢复吸附剂的吸附能力，这个过程成为吸附剂的再生。因此，在实际工作中，正式利用吸附剂的吸附—再生—吸附的循环过程，达到除去废气中污染物质并回收废气中有用组分的目的。 脱附过程是在吸附剂结构不变化或者变化极小的情况下，将吸附质从吸附剂孔隙中除去，恢复它的吸附能力。通过再生使用，可以降低处理成本，减少废渣排放量，同时回收吸附质。被吸附的组分重新释放，释放的气体浓度高于原混合气的浓度。促进解吸的条件有：（1）提高温度（热再生；（2）抽真空以降低压力（变压解吸附）；（3）降低吸附剂周围组分的浓度（空气吹扫）。 2****、吸附机理 吸附和脱附互为可逆过程。当用新鲜的吸附剂吸附气体中的吸附质时，由于吸附剂表面没有吸附质，因此也就没有吸附质的脱附。但随着吸附的进行，吸附剂表面上的吸附质逐渐增多，也就出现了吸附质的脱附，且随着时间的推移，脱附速度不断增大。但从宏观上看，同一时间吸附质的吸附量仍大于脱附量，所以过程的总趋势认为是吸附。当同一时间吸附质的吸附量与脱附量相等时，吸附和脱附达到动态平衡，此时称为达到吸附平衡。平衡时，吸附质在流体中的浓度和在吸附剂表面上的浓度不再变化，从宏观上看，吸附过程停止。平衡时的吸附质在流体中的浓度称为平衡浓度，在吸附剂中的浓度称为平衡吸附量。 当吸附质与吸附剂长时间接触后，终将达到吸附平衡。吸附平衡量是吸附剂对吸附质的极限吸附量，亦称静吸附量分数或经活性分数，用表示，无量纲。它是设计和生产中十分重要的参数。吸附平衡时，吸附质在气、固两相中的浓度关系，一般用吸附等温线表示。吸附等温线通常根据实验数据绘制，也常用各种经验方程式来表示。 3****、吸附量 吸附量是指在一定条件下单位质量的吸附剂上所吸附的吸附质的量，通常以kg吸附质/kg吸附剂或质量分数表示，它是吸附剂所具有吸附能力的标志。在工业上吸附量称为吸附剂的活性。 吸附剂的活性有两种表示方法： （1）吸附剂的静活性 在一定条件下，达到平衡时吸附剂的平衡吸附量即为其静活性。对一定的吸附体系，静活性只取决于吸附温度和吸附质的浓度或分压。 （2）吸附剂的动活性 在一定的操作条件下，将气体混合物通过吸附床层，吸附质被吸附，当吸附一段时间后，从吸附剂层流出的汽提开始发现吸附质（或其浓度达到依规定的允许值）时，认为床层失败，此时吸附剂吸附的吸附质的量称为吸附剂的动活性。动活性除与吸附剂和吸附质的特性有关外，还与温度、浓度及操作条件有关。吸附剂的动活性值是吸附系统设计的主要依据。 二、吸附器选择的设计计算 1****、吸附器的确定 对吸附器的基本要求： （1）具有足够的过气段面和停留时间 （2）良好的气流分布 （3）预先除去入口气体中污染吸附剂的杂质 （4）能够有效地控制和调节吸附操作温度 （5）易于更换吸附剂 吸附工艺选用固定床吸附器。基本运行参数如下： 处理风量：40000m³/h 有机废气组分： 甲苯800 mg/ m ³，丙酮134 mg/ m ³，乙酸乙酯395 mg/ m ³ 材料：钢板δ=4 压降：常压 数量：两台并联，脱附吸附交替运行 2****、吸附剂的选择 如何选择、使用和评价吸附剂，是吸附操作中必须解决的首要问题。一切固体物质的表面，对于流体的表面都具有物理吸附的作用，但合乎工业要求的吸附剂则应具备以下一些要求： （1）具有大的比表面积 （2）具有良好的选择性吸附作用 （3）吸附容量大 （4）具有良好的机械强度和均匀的颗粒尺寸 （5）有足够的热稳定性及化学稳定性 （6）有良好的再生性能 （7）吸附剂的来源广泛、造价低廉 本设计采用活性炭纤维做吸附剂，活性炭纤维是常用吸附剂的一种。活性炭纤维对吸附质的吸附主要取决于表面的物理结构和化学结构，活性炭纤维以其表面大量的不饱和碳构筑成了独特的吸附结构，它是一种典型的微孔碳，其含有的许多不规则结构（杂环结构）或含有表面官能团的结构，具有极大的表面积，也就造成了微孔相对孔壁分子共同作用形成强大的分子场，提供一个吸附总分子物理和化学变化的高压体系。活性炭纤维不含有大孔，其微孔占大多数，当微孔与分子尺寸大小相当时，在范德华力作用下相距很近的吸附场发生叠加，引起微孔内吸附势的增加，而活性炭纤维表面的孔口多，容易吸附和脱附，而且吸脱行程短。因此，活性炭纤维是一种优良的吸附剂。（计算过程以活性炭颗粒为例） 3****、空塔气速和横截面积的确定 空塔气速为气体通过吸附器整个横截面积的速度，空塔气速的选择，不仅直接决定了吸附器的尺寸和压降的大小，而且还会影响吸附效率。气速很小，则吸附器尺寸很大，不经济；气速过大，则压降会增大，使吸附效率受到影响。通过实验确定最佳气速，吸附设计中不能追求过高的吸附效率，把空塔气速取值降小，那样会使吸附床体积、吸附剂用量和设备造价大为增高；反之也不宜取过大的空塔气速，那样设备费用虽低，但吸附效率下降很多，且体系压降会随空塔气速的增大上升很快，造成动力消耗过大，因此应选取合适的空塔气速，最适宜的空塔气速为0.8~1.2m/s，依此经验结论，本设计确定 空塔气速：U=1.0m/s 原始条件： 处理风量：Q=40000 m³/h，设计温度为常温，压力为常压 由于废气中，空气所占的比例远远大于污染物所占比例，因此，废气性质可以近似看作为干空气的热物理性质，查《化工原理》附录得以下数据： 空气混合物性质： 流体密度=1.185kg/m ³，黏度=1.835×Pa·s， 比热容=1.005kJ/(kg·℃)，吸附的粒状活性炭颗粒性质： 平均直径=0.003m，表观密度=670 kg/m ³，堆积密度=470 kg/m ³， 固定床孔隙率=0.5 横截面积: m² 4****、固定床吸附层高度的计算 采用透过曲线计算方法，通过实验将含有一定浓度污染物的气流连续通过固定床吸附器，在不同的时间内，确定吸附床不同截面处气流中污染物的浓度分布，当吸附床使用一段时间后，出口气体污染物浓度达到某一允许最大浓度时，认为吸附床失效。从气流开始通入至吸附床失效这段时间称为穿透时间，或保护作用时间。表示吸附床处理气体量与出气口污染物浓度之间的关系的曲线称为穿透曲线。穿透曲线的形状和穿透时间取决于固定床的操作方法。操作过程的实际速率和机理、吸附平衡性质、气流速度、污染物入口浓度，以及床层厚度等影响穿透曲线的形状，此过程比较复杂，目前仍是只是近似过程的计算。 假定吸附床到达穿透时间全部处于饱和状态，即达到它的平衡吸附量a，也称a为静活度，同时根据朗格缪尔等温线，假定静活度不再与气相浓度有关。在吸附作用时间ζ内，所吸附污染物的量为 X=aSL 式中：X——在时间ζ内的吸附量； a——静活度，重量，%； S——吸附层的截面积，m²； L——吸附层高度，m; [](http://eeblog.top/wp-content/uploads/2016/07/clip_image0241.gif)——吸附剂的堆积密度，设计为470 kg/m ³ 固定床虽然结构简单，但由于污染物在床层内浓度分布是随时间变化，计算比较复杂，因此目前工程上都是采用近似计算，通过计算活性炭的作用时间进行后处理的计算。活性炭的作用时间由下式算出： 式中，V——活性炭的装填量，m ³ C——进口气体污染物的浓度，mg/ m ³ Q——气流量，m ³/h t——活性炭的使用时间，h W——活性炭原粒度的重量穿透炭容，% d——活性炭的堆密度0.8t/ m ³ m ³/h 算出废弃的排放量： =（800+134+395）×40000×=53.16kg/h 假设吸附器的吸附效率为85%，则达标排放是需要吸附总的污染物的量为： 53.16×85%=45.19 kg/h 则在吸附作用时间内的吸附量： X=4.76×286=1361.6kg 根据X=aSL[](http://eeblog.top/wp-content/uploads/2016/07/clip_image0242.gif)得： 根据活性炭的吸附能力，设静活度为16kg甲苯/100kg活性炭 所以， 5****、吸附剂（活性炭）用量的计算 吸附剂的用量M： M=LS[](http://eeblog.top/wp-content/uploads/2016/07/clip_image0243.gif)\\=1.63×11.1×470=8530.7kg 吸附剂本身占体积 V=LS=1.63×11.1=18.09 m² 吸附床层体积： m ³ 6****、活性炭再生的计算 本设计采用升温脱附，即在等压下升高吸附床层温度，进行脱附，然后降温冷却，重新吸附。吸附床的操作温度为，原料中吸附质的分压为,当吸附床达饱和后，吸附剂吸附容量为，假定吸附阶段终了时，允许吸附后气体中的吸附容量低于。升温脱附可将吸附剂从[](http://eeblog.top/wp-content/uploads/2016/07/clip_image0421.gif)升温到[![clip_image050](http://eeblog.top/wp-content/uploads/2016/07/clip_image050_thumb.gif “clip_image050”)](http://eeblog.top/wp-content/uploads/2016/07/clip_image050.gif)，这时吸附剂容量可低于[![clip_image048[1]](http://eeblog.top/wp-content/uploads/2016/07/clip_image0481_thumb.gif “clip_image048[1]”)](http://eeblog.top/wp-content/uploads/2016/07/clip_image0481.gif)。 （1）干燥吸附剂时空气消耗量 式中：L——干燥吸附剂是空气的消耗量，kg l——空气的单位消耗量，即干空气/H2O，无量纲 [](http://eeblog.top/wp-content/uploads/2016/07/clip_image0461.gif)、[![clip_image048[2]](http://eeblog.top/wp-content/uploads/2016/07/clip_image0482_thumb.gif “clip_image048[2]”)](http://eeblog.top/wp-content/uploads/2016/07/clip_image0482.gif)——分别为离开、进入吸附剂层时空气的含湿量即H2O/干空气 W——干燥时驱走的水分，kg 由《化工原理》查表的，常温时饱和水蒸汽密度为0.02304kg/ m ³,则 kg (2)加热空气所消耗的空气热焓量 式中：——由加热器进入吸附器的空气热焓量，J/kg ——进入加热器的空气热焓量，J/kg 设利用120℃的热风进行脱附，查得常温时干空气的热焓量为1.005 kJ/(kg·℃)，120℃时为1.009 kJ/(kg·℃)，则：","tags":[{"name":"吸附","slug":"吸附","permalink":"http://7086.site/tags/%E5%90%B8%E9%99%84/"}]},{"title":"石墨降膜吸收器的设计计算","date":"2016-07-28T05:43:44.000Z","path":"posts/45403.html","text":"","tags":[]},{"title":"风机、水泵和电机的区别","date":"2016-07-27T15:04:36.000Z","path":"posts/4382.html","text":"电机，俗称“马达电动机”，是指依据电磁感应定律实现电能的转换或传递的一种电磁装置。是一种将电能转化成机械能的动力装置；风机是依靠输入的机械能，提高气体压力并排送气体的机械，它是一种从动的流体机械。有的风机是用电机带动的，有的可以是发动机带动的。 在电机的机头上安装上风叶就成了风机. 风机是送风排风的水泵是吸水排水的","tags":[{"name":"废气设计","slug":"废气设计","permalink":"http://7086.site/tags/%E5%BA%9F%E6%B0%94%E8%AE%BE%E8%AE%A1/"}]},{"title":"ppm、ppb、ppt是什么单位？","date":"2015-11-19T08:37:40.000Z","path":"posts/49086.html","text":"转fengye.aixiailian的博客 表达溶液浓度时，1ppm即为1ug/mL；表达固体中成分含量时，1ppm即为1ug/g或1g/t。1ppb为1ppm的千分之一。 ppm part per million 百万分之…… ppb part per billion 10亿分之…… ppt part per trillion 万亿分之…… part per thousand 千分之…… PPm PPb PPt单独拿出来，不能说是单位，就象％一样，不是单位。 使用的时候可以，可以定义为v/v n/n m/m g/l g/m3 等等。 PPm 是10的－6次方 PPb是10的－9次方 PPt是10的－12次方 ppm ——part per million，即百万分之一，是一个无量纲量，如果相知道ppm是何种含义，还需了解是体积比还是质量比或重量比。1ug/ml 是质量/体积比，如果溶液的密度是1 g/ml，则1ug/ml 相当于1ppm；如果溶液密度不是1 g/ml，则需要进行换算。对于气体而言，会更复杂一些，因为气体混合时，在多数压力温度下，各组份的变化不是理想的。 浓度及浓度单位换算1ppm=1000ppb1ppb=1000pptppm即：mg/L（毫克/升）ppb即：ug/L（微克/升）ppt即：ng/L（纳克/升）（一）、溶液的浓度 溶液浓度可分为质量浓度（如质量百分浓度）和体积浓度（如摩尔浓度、当量浓度）和体积浓度三类。 1、质量百分浓度 溶液的浓度用溶质的质量占全部溶液质量的百分率表示的叫质量百分浓度，用符号%表示。例 如，25%的葡萄糖注射液就是指100可注射液中含葡萄糖25克。 质量百分浓度（%）=溶质质量/溶液质量100% 2、体积浓度 （1）、摩尔浓度 溶液的浓度用1升溶液中所含溶质的摩尔数来表示的叫摩尔浓度，用符号mol表示， 例如1升浓硫酸中含18.4 摩尔的硫酸，则浓度为18.4mol。 摩尔浓度（mol）=溶质摩尔数/溶液体积（升） （2）、当量浓度(N) 溶液的浓度用1升溶液中所含溶质的克当量数来表示的叫当量浓度，用符号N表示。 例如，1升浓盐酸中含12.0克当量的盐酸(HCl)，则浓度为12.0N。 当量浓度=溶质的克当量数/溶液体积（升） 3、质量-体积浓度 用单位体积（1立方米或1升）溶液中所含的溶质质量数来表示的浓度叫质量-体积浓度，以符号g/m3或mg/L表示。例如，1升含铬废水中含六价铬质量为2毫克，则六价铬的浓度为2毫克/升（mg/L） 质量-体积浓度=溶质的质量数（克或毫克）/溶液的体积（立方米或升） 4、浓度单位的换算公式： 1）、当量浓度=1000.d.质量百分浓度/E 2）、质量百分浓度=当量浓度E/1000.d 3）、摩尔浓度=1000.d质量百分浓度/M 4）、质量百分浓度=质量-体积浓度（毫克/升）/104.d 5）、质量-体积浓度（mg/L）=104质量百分浓度 5、ppm是重量的百分率，ppm=mg/kg=mg/L 即:1ppm=1ppm=1000ug/L 1ppb=1ug/L=0.001mg 式中：E—溶质的克当量； d—溶液的比重； M—溶质的摩尔质量； （二）、气体浓度 对大气中的污染物，常见体积浓度和质量-体积浓度来表示其在大气中的含量。 1、体积浓度 体积浓度是用每立方米的大气中含有污染物的体积数（立方厘米）或（ml/m3）来表示， 常用的表示方法是ppm，即1ppm=1立方厘米/立方米=10-6。除ppm外，还有ppb和ppt， 他们之间的关系是： 1ppm=10-6=一百万分之一， 1ppb=10-9=十亿分之一 ， 1ppt=10-12=万亿分之一， 1ppm=103ppb=106ppt 2、质量-体积浓度 用每立方米大气中污染物的质量数来表示的浓度叫质量-体积浓度，单位是毫克/立方米 或克/立方米。 它与ppm的换算关系是： X=M.C/22.4 C=22.4X/M 式中： X—污染物以每标立方米的毫克数表示的浓度值； C—污染物以ppm表示的浓度值； M—污染物的分之子量。 由上式可得到如下关系： 1ppm=M/22.4(mg/m3)=1000.m/22.4ug/m3 例1：求在标准状态下，30毫克/标立方米的氟化氢的ppm浓度。 解：氟化氢的分子量为20，则： C=30.22.4/20=33.6ppm 例2、已知大气中二氧化硫的浓度为5ppm，求以mg/Nm3表示的浓度值。 解：二氧化硫的分子量为64。 X =5.64/22.4mg/m3=14.3mg/m3 3、在土壤、动植物、固体废弃物中ppm、ppb与质量含量换算： 1ppm=1mg/kg=1000ug/kg 1ppb=1ug/kg=10-3mg/kg 1mg/kg=1ppm=1000ug/kg 1ug/kg=1ppb=10-3ppm","tags":[]},{"title":"去除废水中重金属离子的综述","date":"2015-11-14T15:00:19.000Z","path":"posts/38087.html","text":"摘要：重金属污染已成为今天最严重的环境问题之一，因为它们对环境顽固不化和持久性的危害，所以重金属污染受到特别关注。近年来，把重金属从废水中去除的方法已被广泛研究。本文综述了当前已被应用于治理重金属废水的方法，并对这些技术进行了评估。这些技术包括：化学沉淀法、离子交换法、吸附法。 1.介绍 重金属元素的原子的重量在63.5和200.6之间，有一个特定的大于5.0的引力（Srivastava and Majumder, 2008）。随着金属电镀设备、矿业、化肥工业、制革厂、电池、造纸行业和杀从剂等这些行业的快速发展，越来越多的重金属污水直接或间接的排入环境，特别是发展中国家。与有机污染物不同，重金属是不能被生物降解的，它们很容易积聚在生物体内，有很多重金属我们都知道我有毒或致癌的。在工业废水的处理中，特别被关注的有毒重金属包括：锌、铜、镍、汞、镉、铅、铬。 锌是一种微量元素，对人体健康至关重要。它对活体组织的生理功能和调节许多生化工程具有重要的作用。然而，过多的锌又会导致严重的健康问题，如胃痉挛，皮肤过敏，呕吐，恶心和贫血（Oyaro et al., 2007）。铜是生物新陈代谢不可或缺，但过度的摄入铜则会带来极其严重的毒性问题，如，呕吐、痉挛、抽搐、甚至死亡(Paulino et al., 2006)。 镍超过其临界水平除了会带来肠胃不适，肺纤维症和皮肤皮炎（Borba et al., 2006）还有可能会带来严重的肺和肾脏问题。我们都知道镍是人类致癌物。汞是一种神经毒素，它会伤害到我们的中枢神经系统。高浓度的汞会造成肺和肾功能的损害，胸痛和呼吸困难(Namasivayam and Kadirvelu, 1999)。水银中毒的典型例子是水俣湾事件。镉已被美国环境保护机构列为很可能是人类致癌物，隔使人类的健康收到严重的威胁。慢性接触镉会导致肾功能异常，高水平的接触将会导致死亡。 铅可引起中央神经系统的损害。铅还可损害肾脏、肝脏和生殖系统，基本细胞流程和大脑功能。中毒的症状有，贫血、失眠、头痛、头晕、易怒、肌肉萎缩、幻觉和肾损伤(Naseem and Tahir, 2001)。铬在水中以两种形式存在：:铬((III)和铬(VI)。一般来说，铬(VI)毒性比铬((III)大，铬(VI)影响人体生理通过食物链的积累导致严重的健康问题，包括从简单的皮肤发炎到肺癌(Khezami and Capart, 2005)。 面对越来越严厉的法规，重金属已被列为环境优先污染物并成为其中最重要的环境问题。所以，为了保护人类和环境，这些有毒重金属应该从废水中去除。许多方法用于清除重金属离子包括化学沉淀法、离子交换法、吸附法、膜过滤法、电化学处理技术等。这篇文章讲述了目前用于处理重金属离子废水的技术以及对它们在应用程序上的优点和局限的评论。 2.重金属废水处理技术 2.1 化学沉淀法 化学沉淀法是有效的，到目前为止在工业中使用最广泛的方法(Ku and Jung, 2001)。因为，它操作起来相对而言比较简单和便宜。在沉淀反应过程中，化学物质与重金属离子形成不溶性颗粒。形成的沉淀物可以通过沉淀或过滤而从水中分离。然后，处理过的水可以适当的排放和重用。传统的化学沉淀法包括氢氧化物沉淀和硫化沉淀。 2.1.1.氢氧化物沉淀 氢氧化物沉淀由于其相对简单，成本低和易于pH值控制而成为最广泛使用的化学沉淀技术(Huisman et al., 2006)。 各种金属氢氧化物的溶解度最小化的pH范围在8.0-11.0之间。金属氢氧化物沉淀可以通过凝聚和沉淀去除。各种各样的氢氧化物一直被用来处理分水中的金属，基于其成本低和易于处理。在工业环境中石灰是首先的基本物质用于氢氧化物沉淀。 氢氧化物沉淀法使用Ca(OH)2和NaOH去除废水中的Cu(II)和Cr(VI)离子已被Mirbagheri and Hosseini (2005)核实。用硫酸亚铁将Cr(VI)转化成Cr(III)，Cr(III)的最大沉淀值在pH为8.7与Ca(OH)2反应，铬酸盐的浓度从30mg/L减少到0.01mg/L。铜铵的最佳去除量是在曝气的情况下，pH为12.0同时加入Ca(OH)2和NaOH铜离子的浓度可以从48.51 mg/L降低到0.694 mg/L。为了提高石灰沉淀法的效率，常用飞灰作为种子材料(Chen et al., 2009b)。这种用飞灰、石灰碳化法增大了沉淀物的体积，明显的提高了重金属的去除率。一定浓度的铬、铜、铅、锌等物质可以从初始浓度100.0mg/L分别降到0.08,0.14,0.03和0.45mg/L。 在氢氧化物沉淀过程中，增加的混凝剂如明矾，铁盐和有机聚合物能增强废水中重金属的去除率。Charerntanyarak(1999)通过石灰采用化学混凝、沉淀法来处理废水中的锌、哥、锰、镁，其初始浓度分别为450、150、1085和3154mg/L。他发现最佳pH值超过9.5时处理后的废水可以达到Wastewater教育部的标准。此外，如果添加了混凝剂，重金属浓度会进一步减少。 尽管氢氧化物沉淀法被广泛使用，但也有一些限制。首先，氢氧化物沉淀生成体积大密度相对较低的油泥，会呈现脱水和处理问题(Kongsricharoern and Polprasert,1995）。其次，一些金属氢氧化物是两性物质，对于混合金属就会出现另一个问题，用氢氧化物沉淀法，可能一种金属的理想pH值会让另一种金属又回到离子的状态。第三，当污水中混有络合剂，它们可能会抑制金属氢氧化物沉淀。 2.1.2.硫化物沉淀 硫化沉淀也是一个有效的治理有毒重金属的方法。其中使用硫化物的一个最主要的优点是金属硫化物沉淀的溶解度要大大的低于氢氧化物沉淀而且硫化物沉淀不是两性物质。因此，相对于氢氧化物沉淀，硫化沉淀可实现在较广pH值范围内金属污染程度较大的情况。相对氢氧化物沉底，硫化沉淀物也表现出更好的增厚和脱水特性。Özverdi and Erdem (2006)研究了黄铁矿和合成硫化铁去除Cu2+, Cd2+和Pb2+。金属去除反应的机制被确定为化学沉淀在低pH值（＜3），由于H2S一级反应(Eqs.(1)and(2))，和在高pH下的吸附(in the range of 3e6)。 FeS(s)+2H+(aq)→H2S（g)+Fe2+(aq) (1) M2+(aq)+H2S（g)→MS(s)+2H+(aq) (2) 最近，新的硫化物去除方法在硫酸盐还原菌（SRB)的基础上已开发出来。SBR氧化简单的有机化合物在厌氧条件下，SBR硫酸盐转化为硫化氢。 3SO42- + 2CH3CH(OH)COOH→ 3H2S + 6HCO3— （3） 这里CH3CH(OH)COOH代表简单的有机化合物。硫化氢与可溶性二价金属发生反应，形成不溶性金属硫化物(Eq. (2)）。 一些有吸引力的发现被Kousi（2007）等报道，并开发了一个上流式固定床SBR来监测治理过的锌轴承废水。他们发现，这个反应有相当大的能力能完全去除初始浓度高达6000mg/L的硫酸盐，完全去除初始浓度高达400mg/L的可溶性锌，并完全消除初始浓度为1500mg/L的TOC。使用SBR治理一种酸性矿山废水的可能性也在被研究(Alvarez et al., 2007)。 不过，在使用硫化物处理的过程中也存在隐患。因为我们知道，重金属往往在酸条件和硫化物沉淀剂在酸性条件下产生有毒的H2S烟雾。至关重要的是这种反应会在中性或碱性介质中进行。此外，金属硫化物沉淀容易形成胶体沉淀，引发在沉淀和过滤过程中的分离问题。","tags":[]},{"title":"事故水池、消防水池、初期雨水池相关规定","date":"2015-11-14T11:16:56.000Z","path":"posts/32427.html","text":"事故水池、消防水池、初期雨水池相关规定 （1）事故池容积确定应执行的标准或规范主要有：《化工建设项目环境保护设计规范》GB50483-2009、中国石化安环[2006]10号等，GB50483规定的应急事故水池容积确定方法，对所有涉及危险化学品环境风险事故排水的项目均应适用执行。且必须根据项目特点、行业标准或规范、事故池容积确定的具体要求等，注意区分各标准规范的适用范围和具体规定条款的执行。 对一般的小化工项目,是否需要设置消防水池应当依据消防水供给能力来确定;是否需要设计前期雨水池,应当根据前期雨水量污水处理站处理能力以及是否可与事故池共用等综合判断;是否需要设置事故池,应当根据GB50483-2009有关规定确定,以上三者可能需要设计单位建设单位安全评价单位环评单位等综合确定,环评只是复核责任,即保证前期雨水事故废水的得到处理并不污染外环境. （2）前期雨水池确定的依据及应执行的标准主要有：《化工建设项目环境保护设计规范》GB50483-2009，《室外排水设计规范》（GB50014-2006），《石油化工企业给水排水系统设计规范》SH3015-2003，《石油化工企业环境保护设计规范等》SH3024-95。 （3）消防水池确定的依据主要有：消防用水量确定、围堰或防火堤有效容积确定时应按《建筑设计防火规范》（GB50016-2006）、《石油化工企业设计防火规范》（GB50160-2008）、《石油库设计规范》（GB50074-2002）、《储罐区防火堤设计规范》（GB50351-2005）等有关规定执行。工厂水源直接供给不能满足消防用水量、水压和火灾延续时间内消防用水总量要求时，应建消防水池（罐），并应符合有关规定。 按GB50483的规定,如果罐区围堰足够容积并可用,可不建事故池,只需配事故水导排系统,提升至围堰内,然后再送污水处理设施.但一般考虑建设一个事故池，且事故水池宜采取地下式。容量计算也有相应要求。 （4）必须注意事故时进入事故水池的雨水量，与正常生产时初期雨水量（即前期雨水）的本质区别，不可混淆。 一是降雨历时不同，正常生产运营过程中初期雨水是指刚下的雨水，一次降雨过程中的前10～20min最大降水量[1]，其设计参数计算必须按GB50014规定的短历时暴雨强度公式确定；而事故时降水量应根据事故消防时间（参照GB50016、GB50160规定一般为2～6h）确定。二是汇水面积不同，初期雨水的汇水面积必须考虑生产区和储存区总的汇水面积；事故时只考虑装置区或罐区单独的能进入事故排水系统的最大降雨量，不作同时汇水考虑，且应采取措施尽量减少进入事故排水收集系统的雨水汇集面积。","tags":[]},{"title":"COD的理论计算","date":"2015-09-03T09:22:00.000Z","path":"posts/7965.html","text":"一、COD概念 化学需氧量又称化学耗氧量（chemical oxygen demand），简称COD。是利用化学氧化剂（如高锰酸钾、重铬酸钾）将废水中可氧化物质（如有机物、亚硝酸盐、亚铁盐、硫化物等）氧化分解，然后根据残留的氧化剂的量计算出氧的消耗量。 二、 COD****的测定 COD的测定方法主要有高锰酸钾法和重铬酸钾法。化学需氧量常由于氧化剂的种类、浓度及氧化条件等之不同，对氧化物质，特别是有机物质的氧化率也不相同。因此，在排水中存在有机物的情况下，除非是在间一条件下测定COD，否则不能进行对比。一般用高锰酸钾高温氧化法，其氧化率为50～60%，用重铬酸钾氧化法，其氧化率为80～90%。 二、COD理论计算公式 根据COD的定义，我们可以理解为COD就是将废水中可氧化物质（有机物等）完全氧化为CO2和水的过程中氧的消耗量。因此我们可以通过化学反应方程式进行理论计算，得到可氧化物质氧化过程中氧的消耗量。 因为我们环评工作主要针对炼化企业，现以炼油厂含油废水为例进行理论计算。 三、含油废水COD理论计算 含油废水中成分复杂，主要污染物包括石油类、挥发酚、硫化物、pH值、SS、氨氮、碱、各种盐类、化学添加剂、各种脂肪族化合物、杂环化合物和芳香烃等。 1、石油类的COD****计算 石油类是各种烃类的复杂混合物。在实验室模拟废水实验中，通常将正十六烷、异辛烷和苯按65：25：10比例配制成混合烃作为标准油溶液（我们实验室一同学曾经做过含油废水的处理试验，并配制相关废水）。 假设正十六烷、异辛烷和苯被完全氧化，则其耗氧量可通过以下公式进行计算： ① 正十六烷 C16H34+49O=16CO2+17H2O 226 784 根据反应方程式，废水中正十六烷转换成COD的理论值应为： 784（分子量）/226（分子量）=3.47 即：废水中每克正十六烷可以消耗3.47g的氧，相当于3.47克COD。 ② 异辛烷 C8H18+25O=8CO2+9H2O 114 400 400（分子量）/114（分子量）=3.5 即： 废水中每克异辛烷相当于3.5克COD。 ③ 苯 C6H6+15O=6CO2+3H2O 78 240 240（分子量）/78（分子量）=3.07 即：废水中每克苯相当于3.07克COD。 *综上所述，将三种物质所导致COD进行加权计算后，废水中每克石油类相当于3.44克COD，因为重铬酸钾氧化法氧化率为90%左右，因此可将其校正为废水中每克石油类相当于3.1克COD，也就是说如果废水中的石油类为100mg/L，则每升废水中COD为310mg/L。* 2、氨氮的COD****计算 根据文献资料，0–1400mg／L的NH3-N对COD几乎没有影响，这主要是因为： 一、我们用回流法做COD的时候，滴定是用硫酸亚铁铵来滴定的，这个里面是有铵根离子的，肯定不会对COD有影响。 二、做COD的时候加了很多的浓硫酸，整个环境是强酸性的，NH3-N都是铵根离子的形式存在，它是不可以被重铬酸钾氧化的，所以对COD没有影响。 总而言之：重铬酸钾法测COD时,氨氮对COD没有贡献！！！ 以上数据仅供参考，并请多多指正！","tags":[{"name":"COD","slug":"COD","permalink":"http://7086.site/tags/COD/"}]},{"title":"污水厂除臭设计臭气风量取值","date":"2015-05-15T01:20:00.000Z","path":"posts/46045.html","text":"当前关于臭气风量的计算方法有很多，有根据水面积乘以一个系数来确定气量，该系数的取值与构筑物的功能与形式有关。现分类来介绍方法：1、泵站、格栅、沉砂池：主要是缺氧产生的臭味，一般对构筑物或设备单独加罩，对于不进入操作的空间换气次数取2-3次，对于进入操作的空间换气次数取5-8次，对有挥发成分的工业污水不适用。2、污水生化处理池：对于缺氧部分，按不进入操作考虑，换气次数取2-3次，对于好氧部分，无特殊要求的情况下不建议进行收集，如必须收集时按照曝气风量再加1次左右的收集空间换气量。3、污泥浓缩与脱水：此部分是污水厂最主要的臭源之一，由于污泥浓缩池大部分有浓缩刮泥的设备，因此尽量在不影响运行的情况下采用加低盖进行收集，换气次数在3-5次，脱水系统一般针对污泥设备进行单独收集，对于密闭系统较好的脱水设备根据该设备标准的产气量进行收集，对于密闭系统较差的脱水设备（如带式压滤后采用半封口式抽风罩，开口处流速为0.6m/s）4、无法单独密封的系统，可以考虑对整个室内进行换气除臭，一般换气次数为6-8次。","tags":[{"name":"除臭","slug":"除臭","permalink":"http://7086.site/tags/%E9%99%A4%E8%87%AD/"}]},{"title":"关于水解池与缺氧池的区别","date":"2015-05-07T01:55:00.000Z","path":"posts/42657.html","text":"水解池主要作用是水解酸化，属于厌氧反应。水解和酸化是两个过程，水解在厌氧、缺氧和好养阶段都能发生，酸化则是典型的发酵过程，在厌氧条件下，这两个过程是不能分开的。水解酸化池中只是发生了厌氧消化中的前两个阶段，它的最终产物是低浓度的有机酸。这样，它的作用主要是加强污水的可生化性。由于在水解酸化池的污水中没有大量的硝态氮，即使是DO升至0.5mg/l，它也不可能发生反硝化。而缺氧池的作用，主要是作用为反硝化，脱氮除磷。及在A-A-O系统中，部分BOD都是在这单元除去的。 由于设计参数不同水解酸化池是控制停留时间，主要是厌氧反应的第一、第二阶段。缺氧持是控制DO、回流比，主要是兼氧、厌氧反映。根据二者工艺参数的控制、作用均不相同。","tags":[{"name":"废水设计","slug":"废水设计","permalink":"http://7086.site/tags/%E5%BA%9F%E6%B0%B4%E8%AE%BE%E8%AE%A1/"}]},{"title":"活性炭纤维与活性炭的区别","date":"2015-05-04T06:49:00.000Z","path":"posts/38007.html","text":"活性炭纤维(Activated carbon fiber,简称ACF)是由可炭化的有机纤维如粘胶纤维、聚丙稀腈纤维经过低温炭化、高温活化制备而成，具有发达微孔结构和优异的吸附性能。所以，活性炭纤维也成为“丝状或纤维状”活性炭，是现有粒状活性炭的替代产品，是新一代功能型高效炭质吸附材料。沈阳多介质过滤器,沈阳活性碳过滤器,沈阳叠片过滤器, 活性炭纤维的微孔发达，孔径均匀，分布于纤维表面，几乎都是有效孔，有效吸附表面积高达1000～2500m2/g，数倍于活性炭。活性炭纤维的有效吸附容量比颗粒活性炭(GAC)高10倍以上。所以，活性炭纤维吸附能力强、吸脱附速度快，对低浓度或微量的有毒有害气体有很好的吸附能力。 活性炭纤维产品成功进入市场后，很快引起了国内外客户的关注。活性炭纤维比活性炭更安全，更健康的环保用品。 活性炭是我们在装修后经常使用到去除空气有毒气体的物品。而目前，市场又出一种活性炭纤维的产品。活性炭纤维被称为是我国新一代功能性吸附材料。那做为新一代功能性吸咐材料，与我们平时所用的活性炭，区别在哪里呢？沈阳多介质过滤器,沈阳活性碳过滤器,沈阳叠片过滤器, 活性炭是一种由含炭材料制成的外观呈黑色、内部孔隙结构发达、表面积大，吸附能力强的粒状(GAC)炭质吸附材料。","tags":[{"name":"活性炭","slug":"活性炭","permalink":"http://7086.site/tags/%E6%B4%BB%E6%80%A7%E7%82%AD/"}]},{"title":"废气设计方案的一些摘抄2","date":"2015-04-27T02:29:00.000Z","path":"posts/30139.html","text":"1、关于活性炭吸附系统 2、含氟废气治理、含铅废气治理、含汞废气治理 3、恶臭废气 4、氯化氢废气治理技术 降膜吸收塔 高效气体吸收依赖于以下内容： 1。亲密接触 2。高效换热 这是在一个降膜吸收器本质上是在其中两个气体被吸收和吸收液体流顺流向下与提取的热由循环冷却水在壳体内的管壳式换热器来实现。该液体通过槽循环，直到所需的浓度来实现。在这样的速率，该管不流充分但不是液体流动，下降沿管作为薄膜的内壁重力。显然，这将产生一个送礼者流率比如果管满流可以得到更大的线速度。 降膜吸收塔产品特点 该设备可以作为一个数字水冷壁列的平行和各管上设置有顶部分配系统来实现的液体和气体，并形成薄液膜的均匀分布在管的内表面上。 降膜吸收塔突出特点： 1。吸收的热量被连续地除去。这可确保更好的吸收和产物浓度与传统的填料塔进行比较。 2。低停留时间和工作温度非常适合对热敏感的材料。 3。硼硅玻璃和PTFE接触部分确保腐蚀/无污染操作。 4。标准的和定制的单位可供选择。 5。能够从零操作到最大气体流量。 6。安装简便，由于重量轻。 7。无故障和一致的性能以最小的注意力。 8。适用范围广，如盐酸，氢溴酸，NH3，SO2，H2S，的Br2等。 9。更低的成本。 10。可以忽略不计的压降相对于传统的列。 11。紧凑的设计时尚而修长。 12。热和传质操作在单个设备中。 13。非常高的传热系数为液体落下，而不是流过。 14。工艺流体的比例是最小的，由于高速和易于清洗简单酸循环。 15。管道，水箱和水泵等。 5、酸性废气","tags":[{"name":"废气设计","slug":"废气设计","permalink":"http://7086.site/tags/%E5%BA%9F%E6%B0%94%E8%AE%BE%E8%AE%A1/"}]},{"title":"笨方法解决Gravatar头像被河蟹","date":"2015-04-25T03:52:00.000Z","path":"posts/54181.html","text":"打开wordpress程序根目录的wp-includes文件夹，找到pluggable.php打开，将大约2150至2157行： if ( is_ssl() ) { $host = ‘https://secure.gravatar.com&#39;; } else { if ( !emptyempty($email) ) $host = sprintf( “http://%d.gravatar.com”, ( hexdec( $email_hash[0] ) % 2 ) ); else $host = ‘http://0.gravatar.com&#39;; } 替换为： $host = ‘https://secure.gravatar.com&#39;; 之所以说“笨”是因为下次更新程序，还需要再次修改，不过这个方法最实用。 最新版的wp上面的方法可能失效，采用多说缓存， 下面的代码加到functions.php中 1 2 3 4 5 function duoshuo_avatar($avatar) { $avatar = str_replace(array(“www.gravatar.com&quot;,&quot;0.gravatar.com&quot;,&quot;1.gravatar.com&quot;,&quot;2.gravatar.com&quot;),&quot;gravatar.duoshuo.com&quot;,$avatar); return $avatar; } add_filter( ‘get_avatar’, ‘duoshuo_avatar’, 10, 3 );","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"袋式除尘器的选用技术标准","date":"2015-04-23T05:44:00.000Z","path":"posts/21115.html","text":"袋式除尘器在我们平时生活中经常用到，也给我们的生活带来了很多方便。袋式除尘器除尘效果的优劣与多种因素有关，但主要取决于滤料。袋式除尘器的滤料就是合成纤维、天然纤维或玻璃纤维织成的布或毡。根据烟气性质，选择出适合于应用条件的滤料。通常，在烟气温度低于120℃，要求滤料具有耐酸性和耐久性的情况下，常选用涤纶绒布和涤纶针刺毡；在处理高温烟气（&lt;250℃）时，主要选用石墨化玻璃丝布；在某些特殊情况下，选用炭素纤维滤料等。既然袋式除尘器对我们生活这么重要，那么我们该如何选择哪款除尘器，或者说那种除尘器更加适合自己的家庭，另外什么型号的除尘器会比较好，又有哪些注意事项呢，下面就从八个方便简单介绍下除尘器选型需要考虑的因素： 1、袋式除尘器使用温度对于袋式除尘器来说，其使用温度取决于两个因素，第一是滤料的最高承受温度，第二是气体温度必须在露点温度以上。对袋式除尘器来说，使用温度与除尘效率关系并不明显，这一点不同于电除尘，对电除尘器来说，温度的变化会影响到粉尘的比电阻等影响除尘效率。 2、袋式除尘器入口处的含尘浓度对于袋式除尘器来说，入口含尘浓度将直接影响下列因素：⑴压力损失和清灰周期。入口浓度增大，同一过滤面积上积灰速度快，压力损失随之增加，结果是不得不增加清灰次数。⑵滤袋和箱体的磨损。在粉尘具有强磨蚀性的情况下，其磨损量可以认为与含尘浓度成正比。⑶预收尘有无必要。预收尘就是在除尘器入口处前再增加一级除尘设备，也称前级除尘。⑷排灰装置的排灰能力。排灰装置的排灰能力应以能排出全部收下的粉尘为准，粉尘量等于入口含尘浓度乘以处理风量。⑸操作方式。袋式除尘器分为正压和负压两种操作方式，为减少风机磨损，入口浓度大的不宜采用正压操作方式。 3、出口含尘浓度出口含尘浓度指除尘器的排放浓度，表示方法同入口含尘浓度，出口含尘浓度的大小应以当地环保要求或用户的要求为准，袋式除尘器的排放浓度一般都能达到50g/Nm3以下。 4、袋式除尘器处理风量是指除尘设备在单位时间内所能净化气体的体积量。单位为每小时立方米（m3/h）或每小时标立方米（Nm3/h）。是袋式除尘器设计中最重要的因素之一。根据风量设计或选择袋式除尘器时，一般不能使除尘器在超过规定风量的情况下运行，否则，滤袋容易堵塞，寿命缩短，压力损失大幅度上升，除尘效率也要降低；但也不能将风量选的过大，否则增加设备投资和占地面积。合理的选择处理风量常常是根据工艺情况和经验来决定的。5、压力损失如果缺乏更恰当的设计经验，在过滤速度较低时可以把75×9．8帕作为典型数据。但若采取较高的过滤速度，或存在粘性或低孔率的灰尘层，应取稍高的数值。 6、过滤速度即气布比。它是被过滤的气体流量（m3/min）同除尘布袋面积（m2）的比值，其因次为m3/min.m2=m/min。这是速度的单位，它代表气体通过除尘布袋的平均速度，不考虑有许多面积被构成织物的纤维所占有。为此，常常又把它称为“表观表面速度”。 过滤速度是决定布袋除尘器性能的一个很重要的因素。过滤速度太高会造成压损过大，降低除尘效率，使除尘滤袋堵塞和过早损坏。但是，提高过滤速度可以减少布袋除尘器需要的过滤面积，从而可以用较小的除尘设备来处理同样体积的气体。 对某一组设计参数（即除尘器型式、清灰机构、除尘布袋纤维材料和织物结构、灰尘性质等）有一个最佳过滤速度。一般，细灰尘比粗灰尘取的过滤速度要低些，较小的除尘器往往采用比大除尘器高的过滤速度。脉冲式、反向射流式除尘器可以比振动式、反向气流式的过滤速度取得高些。 对于振动式和反向气流式除尘器，用于普通灰尘，过滤速度可以采用0.9m/min。从兼顾投资和维护两方面的角度出发，有人推荐饲料和谷物灰尘以及面粉的最大过滤速度可分别为0.98和0.75m/min。 7、过滤面积进入除尘器的气体流量（m3/min）除以所选用的过滤速度（m/min），即得实际需要的织物面积（m2）。由于温度变化，以及空气的额外增减，进人除尘器的舍尘气体体积不一定同生产过程所排出的体积相同。如果除尘器应用在流量有变化的场合，需要作出判断，究竟是按峰值流量还是平均流量来计算过滤面积。另外，还应考虑除尘器除尘布袋织物的储备量，以便进行清灰，检查和维修。 8、壳体结构一台袋式除尘器需要多少分隔室是比较容易确定的。在决定了每个分隔室的除尘布袋面积以后，就要决定最有利的除尘滤袋长度、直径和排列间距。一般长度的除尘滤袋最好有不小于50毫米的间距；特别长（如超过3米）的除尘滤袋间距应当更大些。除尘滤袋应当分组，在两组之间留下通道。如果只在一侧有通道，除尘布袋直径为150毫米，每组不应当多于三或四排滤袋；直径为300毫米的每组不应多于二排。如果两侧有通道，直径150毫米的不应多于八排，直径300毫米的不应多于四排。通道宽度为450～600毫米。每组除尘滤袋的总数取决于所用的振动机构。通常，一组滤袋内有一组振动机构操纵。一个分隔室可以包含若干组滤袋。","tags":[{"name":"除尘器","slug":"除尘器","permalink":"http://7086.site/tags/%E9%99%A4%E5%B0%98%E5%99%A8/"}]},{"title":"废气设计方案一些摘抄","date":"2015-04-20T09:28:00.000Z","path":"posts/41774.html","text":"1、排气筒的出口直径应根据出口流速确定，流速宜取15m/s 左右。当采用钢管烟囱且高度较高时或烟气量较大时，可适当提高出口流速至20m/s～25 m/s 左右。 2、常用的吸收装置有填料塔、喷淋塔、板式塔、鼓泡塔、湍球塔和文丘里等。 吸收塔的选择：a) 填料塔宜用于小直径塔及不易吸收的气体，不宜用于气液相中含有较多固体悬浮物的场合；b) 板式宜用于大直径塔及容易吸收的气体；c) 喷淋塔宜用于反应吸收快、含有少量固体悬浮物、气体量大的吸收工艺；d) 鼓泡塔宜用于吸收反应较慢的气体。 吸收塔选型设计：a) 根据被吸收气体、吸收液、吸收塔型式和要求的吸收效率，应选择技术经济合理的空塔气速；b) 吸收塔的高度应能保证气液有足够的有效接触时间；c) 对于易吸收的气体宜取小的液气比，不易吸收的气体宜取较大的液气比，特别难吸收的气体或一些特殊场合，宜采用大的液气比；d) 吸收塔的气体出口处应设置除雾装置；e) 吸收塔的气体进口段应设气流分布装置； f) 吸收液喷淋效果应均匀，防止沟流和壁流现象的发生。 3、吸附装置注意事项 6.3.2.1 废气预处理应除去颗粒物、油雾、难脱附的气态污染物，并调节气体温度、湿度、浓度和压力等满足吸附工艺操作的要求。6.3.2.2 进入吸附床的废气温度宜控制在40℃以下。6.3.2.3 进入吸附床的易燃、易爆气体浓度应调节至其爆炸极限下限的50%以下。6.3.2.4 颗粒物去除宜采用过滤及洗涤等方法，进入吸附装置的废气中颗粒物浓度应低于5mg/m3。 固定床吸附器吸附层的风速应根据吸附剂的材质、结构和性能确定；采用颗粒状活性炭时，宜取0.20 m/s～0.60m/s；采用活性炭纤维毡时，宜取0.10m/s～0.15m/s；采用蜂窝状吸附剂时，宜取0.70 m/s～1.20m/s。对于废气浓度特别低或有特殊要求的场合，风速可适当增加。 大气污染控制工程2001 大气污染控制工程2002","tags":[{"name":"废气设计","slug":"废气设计","permalink":"http://7086.site/tags/%E5%BA%9F%E6%B0%94%E8%AE%BE%E8%AE%A1/"}]},{"title":"废液算固体废物吗？","date":"2014-03-28T08:08:09.000Z","path":"posts/26352.html","text":"根据 《中华人民共和目固体废物污染环境防治法》(1995年公布) 固体废物的分类方法有多种，按其组成可分为有机机废物和无机废物;按其形态可分为固态废物、半固态废物和液态(气态）废物；按其污染特性可分为危险废物和一般废物等；按其来源可分为矿业的、工业的、城市生活的、农业的和放射性的。 此外，固体废物还可分为有毒和无毒的两大类。有毒有害固体废物是指具有毒性、易燃性、腐蚀性、反应性、放射性和传染性的固体、半固体废物。","tags":[]},{"title":"不同类型交通干线的定义","date":"2014-03-04T08:40:09.000Z","path":"posts/12855.html","text":"A.1 铁路 以动力集中方式或动力分散方式牵引，行驶于固定钢轨线路上的客货运输系统。 A2 高速公路 根据JTGB01，定义如下： 专供汽车分向、分车道行驶，并应全部控制出入的多车道公路，其中： 四车道高速公路应能适应将各种汽车折合成小客车的年平均日交通量 25000～55000辆： 六车道高速公路应能适应将各种汽车折合成小客车的年平均日交通量 45000～80000辆： 八车道高速公路应能适应将各种汽车折合成小客车的年平均日交通量 45000～80000辆： A3 一级公路 根据JTGB01，定义如下： 供汽车分向、分车道行驶，并可根据需要控制出入的多车道公路，其中： 四车道一级公路应能适应将各种汽车折合成小客车的年平均日交通量 15000～30000辆： 六车道一级公路应能适应将各种汽车折合成小客车的年平均日交通量 25000～55000辆： A4 二级公路 根据JTGB01，定义如下： 供汽车行驶的双车道公路。 双车道二级公路应能适应将各种汽车折合成小客车的年平均日交通量 5000～15000辆： A5 城市快速路 根据GB/T 50280，定义如下： 城市道路中设有中央分隔带，具有四条以上的机动车道，全部或部分采用立体交叉与控制出入，供汽车以较高速度行驶的道路，又称汽车专用道。 城市快速路一般在特大城市或大城市中设置，主要起连续城市内各主要地区、沟通对外联系的作用。 A6 城市主干路 联系城市各主要地区（住宅区、工业区以及港口、机场和车站等客货运中心等），承担城市主要交通任务的交通干道，是城市道路网的骨架。主干线沿线两侧不宜修建过多的车辆和行人出入口。 A7 城市次干路 城市各区域内部的主要道路，与城市主干路结合成道路网，起集散交通的作用兼有服务功能。 A8 城市轨道交通 以电能为主要动力，采用钢轮—钢轨为导向的城市公共客运系统。安装运量及运行方式的不同，城市轨道交通分为地铁、轻轨以及有轨电车。 A9 内河航道 船舶、排筏可以通航的内河水域及其港口。","tags":[{"name":"环评","slug":"环评","permalink":"http://7086.site/tags/%E7%8E%AF%E8%AF%84/"}]},{"title":"环评报告书的类别","date":"2014-02-28T09:45:25.000Z","path":"posts/15567.html","text":"编号 登 记 类 别 所对应的业务领域 1 一般项目环境影响报告表 可主持编制除输变电及广电通讯类、核工业类以外项目的环境影响报告表。 2 特殊项目环境影响报告表 可主持编制输变电及广电通讯类、核工业类项目的环境影响报告表。 3 轻工纺织化纤类环境影响 评价 (1)可主持编制下列项目环境影响报告书： -各种化学纤维、棉、毛、丝、绢等制造以 及服装、鞋帽、皮革、毛皮、羽绒及其制品的生产、加工等项目； -食品、饮料、酒类、烟草、纸及纸制品、 印刷业、人造板、家具、记录媒介的制造及加工等项目; (2)可主持编制一般项目环境影响报告表。 4 化工石化医药类环境影响 评价 (1)可主持编制下列项目环境影响报告书： －基本化学原料、化肥、农药、有机化学品、合成材料、感光材料、日用化学品及专用化学品的生产加工与制造等项目； －人造原油、原油、石油制品、焦碳（含煤气）的加工制造等项目； －各种化学药品原药、化学药品制剂、中药材及中成药、动物药品、生物制品的制造及加工等项目； －转基因技术推广应用、物种引进等高新技术项目； (2)可主持编制一般项目环境影响报告表。 5 冶金机电类环境影响评价 (1)可主持编制下列项目环境影响报告书： －普通机械、金属加工机械、通用设备、轴承和阀门、通用零部件、铸锻件、机电、石 化、轻纺等专用设备、农林牧渔水利机械、 医疗机械、交通运输设备、航空航天器、武器弹药、电气机械及器材电子及通信设备、仪器仪表及文化办公用机械、家用电器及金属制品的制造、加工及修理等项目； －拆船、电器拆解、电镀、金属制品表面处理等项目； －电子加工等项目； －黑色金属、有色金属、贵金属、稀有金属的冶炼及压延加工等项目； (2)可主持编制一般项目环境影响报告表。 6 建材火电类环境影响评价 (1)可主持编制下列项目环境影响报告书： －水泥、玻璃、陶瓷、石灰、砖瓦、石棉等各种工业及民用建筑材料制造与加工项目； －各种火电、脱硫工程、蒸汽、热水生产、 垃圾发电等项目； (2)可主持编制一般项目环境影响报告表。 7 农林水利类环境影响评价 (1)可主持编制下列项目环境影响报告书： －农、林、牧、渔业的资源开发、养殖及其服务项目； －防沙治沙工程项目； －水库、灌溉、引水、堤坝、水电、潮汐发电等项目； (2)可主持编制一般项目环境影响报告表。 8 采掘类环境影响评价 (1)可主持编制下列项目环境影响报告书： -地质勘查、露天开采、煤炭、石油及天然 气、金属和非金属矿、盐矿采选等项目； (2)可主持编制一般项目环境影响报告表。 9 交通运输类环境影响评价 (1)可主持编制下列项目环境影响报告书： －铁路、公路、地铁、城市交通、桥梁、隧道、港口、码头、航道、水运枢纽、光纤光缆等项目； －管线、管道、仓储建设及相关工程等项目； －各种民用、军用机场及其相关工程等项目； (2)可主持编制一般项目环境影响报告表。 10 社会区域类环境影响评价 (1)可主持编制下列项目环境影响报告书： －房地产、停车场、污水处理厂、城市固体废物处理（处置）、进口废物拆解、自来水生产和供应、园林、绿化等城市建设及综合整治项目； －卫生、体育、文化、教育、旅游、娱乐、 商业、餐饮、社会福利、社会服务设施、展览馆、博物馆、游乐场等项目； －流域开发、海岸带开发、围海造地、围垦造地；开发区建设、城市新区建设和旧区改建的区域性开发等项目； (2)可主持编制一般项目环境影响报告表。 11 海洋工程类环境影响评价 (1)可主持编制下列项目环境影响报告书： -海底管道、海底缆线铺设、海洋石油勘探 开发等项目； (2)可主持编制一般项目环境影响报告表。 12 输变电及广电通讯类环境 影响评价 (1)可主持编制下列项目环境影响报告书： -移动通讯、无线电寻呼等电讯、雷达和电 信等项目； -输变电工程及电力供应等项目； -邮电、广播、电影、电视等项目； (2)可主持编制各类项目环境影响报告表。 13 核工业类环境影响评价 (1)可主持编制下列项目环境影响报告书： -核设施、核技术应用等项目； -伴生放射性矿物资源开发利用、放射性天 然铀、钍伴生矿的开采、加工和利用及废渣的处理和贮存等项目； (2)可主持编制各类项目环境影响报告表。 14 环境影响技术评估 可主持编制环境影响技术评估报告。 15 竣工环境保护验收监测 可主持编制竣工环境保护验收监测报告（表）。 16 竣工环境保护验收调查 可主持编制竣工环境保护验收调查报告（表）。","tags":[{"name":"环评","slug":"环评","permalink":"http://7086.site/tags/%E7%8E%AF%E8%AF%84/"}]},{"title":"多吸头污水泵功率计算","date":"2014-02-25T02:23:14.000Z","path":"posts/25123.html","text":"按正常的计算公式：多吸头污水泵的电机功率=流量(m3/h)*扬程(米)*9.81/3600/效率 (一般多吸头污水泵的效率在55%左右)*1.2(电机安全系数)长沙水泵厂家天宏泵业认为多吸头排污泵的流量应按生活排水设计秒流量选定；当有排水量调节时,可按生活排水最大小时流量选定。消防电梯集水池内排水泵流量不小于10L/s。 多吸头排污泵的扬程按提升高度、管道损失计算确定后,再附加一定的自由水头。自由水头宜采用0.02～0.03MPa。排污泵吸水管和出水管流速不应小于0.7m/s,并不宜大于2.0m/s。 两台或两台以上的水泵共用一条出水管时,应在每台水泵出水管上装设阀门和止回阀。单台水泵排水有可能产生倒灌时,应设止回阀。不允许压力排水关与建筑内重力排水管合并排出。当多吸头潜水排污泵提升含有大块杂物时,多吸头潜水排污泵宜带有粉碎装置；当提升含较多纤维物污水时,宜采用大通道多吸头潜水排污泵。 当多吸头污水泵电机功率大于等于7.5kW或出水口管径大于等于DN100时,可采用水泵固定自耦装置；当潜水排污泵电机功率小于7.5kW或出水口管径小于DN100时,可设软管移动式安装。污水集水池采用潜水排污泵排水时,应设水泵固定自耦装置,方便水泵检修。","tags":[{"name":"设备","slug":"设备","permalink":"http://7086.site/tags/%E8%AE%BE%E5%A4%87/"}]},{"title":"人工湿地生活污水处理技术","date":"2014-02-24T03:49:01.000Z","path":"posts/38769.html","text":"技术概述 (一)基本概念 人工湿地实质是一个综合生态系统，主要应用生态系统中各个共生物种的能量和物质循环的再生作用，在促进废水中污染物良性循环的前提下，充分发挥资源生产潜力，获得污水处理与资源化的最佳效益，防止污水对环境造成二次污染。 (二)技术原理 人工湿地污水处理技术的原理是通过人工建造和控制来运行与沼泽地类似的地面，将污水有控制地投配到湿地上，使污水在湿地土壤缝隙和表面沿一定方向流动的过程中，利用土壤、人工介质、植物、微生物的物理、化学、生物三重协同作用，对污水进行处理的一种技术。其生态系统的作用机理包括吸附、滞留、过滤、沉淀、微生物分解、转化、氧化还原、植物遮蔽、残留物积累、蒸腾水分和养分吸收及各类动物的其他作用等。 (三)系统分类 人工湿地处理系统可以分为以下几种类型：自由水面人工湿地处理系统、潜流型人工湿地处理系统、垂直水流型人工湿地处理系统等。 系统去除的污染物范围广泛，包括N、P、SS、有机物、病原体等。在进水浓度较低的条件下，人工湿地对BOD5的去除率可达85%～95%，COD去除率可达80%以上，出水中BOD5的浓度在10mg/L，SS小于20mg/L。废水中大部分有机物作为异样微生物的养分，最终被转化为微生物有机体、CO2和H2O。 (四)技术特点 人工湿地处理系统同时具有缓冲容量大、处理效果好、工艺简单、投资少、运行费用低等优点，非常适合中、小型村庄生活污水的集中处理。 (五)适用范围 1.人工湿地污水处理技术易受气候条件影响，南北差异较大，北方大部分地区冬季温度较低，难以维持生态系统的正常运行或保证污水处理效果。因此在选用该技术时，要选取合适的植物，并且要充分考虑项目地植物过冬问题。 2.该处理技术适用于农村集中式和分散式污水处理，根据各地土地充裕情况、居住方式和经济状况而定。对于居住较为分散、土地宽裕的村庄，可选用分散式处理方式，以户为单位，充分利用农村零星空地，建设小规模湿地处理系统，可同时满足净化污水和美化环境的效果。集中式处理系统，更适宜于居住集中、土地有限的农村，尤其是撤村并镇和新建的农村社区，各户将污水通过管网或沟渠排入处理系统集中处理。 3.该技术对于项目地地形条件的要求较为宽松，设计时可因地制宜。 (六)注意事项 采用人工湿地处理技术，主要注意以下几点： 1.人工湿地处理技术必须做好防渗系统，对于农村地区湿地防渗可采用土工膜或三灰土夯实等简易实用的方法。 2.人工湿地植物的选取。湿地植物是湿地处理系统最明显的生物特征，它是人工湿地的主要组成部分，在污水处理过程中起着重要作用。湿地植物选取时应因地制宜，综合考虑植物的以下特征：耐水、根系发达、多年生、耐寒、吸收氮、磷量大、兼顾观赏性和经济性、要尽量选择当地的土著种。目前，常用的有芦苇、香蒲、菖蒲、美人蕉、风车草、彩虹鸟、水竹、水葱、大米草、鸢尾、蕨草、灯芯草等。 3.人工湿地植物栽种初期的管理主要保证其成活率。湿地植物栽种最好在春季，植物容易成活。如果不是在春季栽种而在冬季，应做好防冻措施，在夏季应做好遮阳防晒。总之，要根据实际情况采取措施以确保栽种植物的成活率。 4.植物栽种初期为了使植物的根扎得比较深，需要通过控制湿地的水位，促使植物根茎向下生长。 5.做好日常护理防止其他杂草滋生并及时清除枯枝落叶，防止腐烂污染。 6.对不耐寒的植物在冬季来临之前要做好防冻措施或及时收割。","tags":[{"name":"连片整治","slug":"连片整治","permalink":"http://7086.site/tags/%E8%BF%9E%E7%89%87%E6%95%B4%E6%B2%BB/"}]},{"title":"佛教之于华夏","date":"2014-02-14T05:42:14.000Z","path":"posts/23499.html","text":"佛教未入华夏之前，哪个异族能够长期践踏中原？来犯者莫不是被打得抱头鼠窜。不幸西域胡僧，自己家国被灭，只得出来流窜，入了中土，为果腹计，摇唇鼓舌，上诓人主，下惑黎民，妄说因果，捏造六道，使人皆务于清谈，荒了君臣人伦，及至异族来犯，个个念着阿弥，引颈受死。于是先有五胡乱华，汉人成了两脚羊；后有元清入主，汉人沦为四等奴。佛教借用华夏文字译经，偷换概念，置换华夏精神，对华夏文化造成了极大的伤害。佛教有如此危害，首先因为佛教在一些重大哲学概念上，陷入了鬼打墙。一、因果。我朝水中投石子，水面会有波纹；我朝山谷中喊，山谷会有回音。这是自然界的因果。投我以木瓜，报之以琼琚；君之视臣如土芥,则臣视君如寇仇。这是人类社会的因果。后种现象虽然发生在人类社会，但同样是直接的、自然的触发式反应，我们称为自然因果律。某人犯罪被法律惩罚了，这是人间道德律。人间道德律必然符合自然因果律，自然因果律却不一定要符合人间道德律。因为道是独立而不改、周行而不殆的，并不是为了照顾人间道德律的存在。普降甘霖，不独浇善人地；久逢大旱，不独干恶人田。因为是人法地、地法天、天法道、道法自然，而不是自然法道，道法天，天法地，地法人。用两个公式来表现就是：自然因果律＞人间道德律 自然因果律≠人间道德律 有句话叫“一切存在即是合理。”合于自然的理，不等于合于人类的道德上的理。所以邪恶被正义所惩罚，罪犯被法律所制裁。暴君为什么鱼肉百姓？这个从自然因果律的角度，有很多原因。可以从这个暴君从小的性格养成来说，以及这个国家的政治经济文化传统等。从他的成长环境来说，他长成暴君是有因可循的，但这不代表他做暴君是合理的，应该的。从人间道德律的角度来说，桀纣那样的暴君，就该被人民推翻。这样人间道德律才真正从更高的角度合于自然因果律。而佛教却在自然因果律中套入了人间道德律，把自然因果律的合理性等同于人间道德律的法理性。于是他看世界就扭曲了。暴君为什么鱼肉你们？OK，既然一切都是合乎因果的（佛教眼中那个自然因果律和人间道德律等同的因果），那么暴君鱼肉你们一定是合理的。那么，大概是因为你们前世欠他的。这样，佛教从逻辑上圆了谎，世道却被他的说法给越说越坏了。因为暴君前世做了好事，你们前世做了坏事。所以他今生高高在上鱼肉你们。感情做好事就像是存款，为了日后挥霍啊！佛教把自然因果律等同于人间道德律，因此，佛教既不承认世间有统一的主宰（这是佛教徒自诩的唯物论），而又认为因果会替人们摆平一切不平事。在这个悖论下，他不得不认为一个已经死了的生前“开悟”过的人的灵魂（佛）为最高主宰，而又不辞辛苦地挖出了十八层地狱，让十殿阎王来判看不完的善恶簿。为了圆这个逻辑上的谎，自称不打诳语的佛教打了无数的诳语。并且怒斥不信他的人会下地狱。像如傅奕，韩愈，王阳明，或是被佛教徒编为下地狱，或是和尚转世。感情地狱是他家开的，他让谁下谁就得下？佛教以此妄解因果，所以一切恶皆是合理，所以他的劝善变成了助恶，所以当西方宗教把侵略者变成虎狼的时候，佛教却把被侵略者变成羔羊。以上对因果的解释，读惯了佛教经段子的人，可能很难理解。不用难过嘛，看不懂你可以多看几遍。事实上这一点，当年你的祖师释迦摩尼也没有想通，你就不用难过了。释迦摩尼去劝鱼头族：不要打我的国家，施主，因果不爽啊！你现在打我们，来世也会被我们打！鱼头族头头说：那我现在去打你们，怎么知道不是你前世打了我们？释迦摩尼傻眼了，然后作高人状认命了。于是他那个小国家就被鱼头族灭了。就因为这个节点，害了释迦摩尼，也害了很多佛子佛孙。西域路上那么多佛国，都被伊斯兰灭了。华夏未灭，是因为诸子百家保护了华夏，顺便给了佛教一口饭吃。而不是佛教保卫了华夏。现在网上很多佛徒都说，应该取消死刑，因为今生被砍杀被坑被冤了的人，都是前世作孽的。我问一个南传佛教徒，你怎么看汶川大地震中死去的人，他开始就背经段子绕话，后来在我的追问下，他坦承：那些人就是前世作孽了，所以今生投胎到汶川去受死的。佛教乱解因果，导致信徒是非不分到这等地步，所以他们没有国家民族概念，没有华夷之辨，异族入侵时，屁颠屁颠去受死，也是很自然的了。二、生死。生死本来就不是个问题，只有当你把它当作是一个问题时，它才真的成了问题。所以，当你不了脱生死，就是最大的了脱。当你想要了脱，你就进了鬼打墙。有生必有死，如瓜熟蒂落，如十月怀胎自然分娩。我华夏先民，天生便有这等落拓的气魄和胸襟。看先秦《诗经》，面对生死，无不坦荡无畏。“岂曰无衣，与子同袍！”慷慨赴沙场拒敌，可曾哭哭啼啼畏惧生死来？释迦摩尼本就是个死亡焦虑症患者，所以见今日美人如玉，他便想他日红粉骷髅。他是没着美色相，倒是着了死人相。为了让自己摆脱死亡焦虑，所以跑出去睡坟地，扒了死人衣来穿。杯子里有半杯水，这是事实。乐观的人说，哇，真好，还有半杯水！——他说的是事实。悲观的人说：唉，真糟，已经有半杯水没了，剩下的半杯水也将被喝掉。——他说的也是事实。佛教就是这样，先放大生活中的悲观面，等你完全跟他情绪共振了，然后再来给你个解脱之法：要么让你看破，要么给你个西方极乐世界阿弥陀佛的幻想。所有很多人拼死捂着佛教，不是因为他信仰坚定，而是因为他有恐惧。用佛教心经的话来说，“心无挂碍，无有恐怖”，他做不到。他有挂碍，有恐怖，有求于佛教，所以放不下佛教。病好了自然就不吃药了。一直放不下佛药的，就因为他好不了心病。本来无心，何来心病？庸医乱下药，没病治出病。我华夏是先天了脱生死的，佛教来了说生道死，先激发了你的恐怖，然后你便有了病，然后你就放不下这药了。我华夏先天了脱生死的几种境界：1、无念生死。人生在世，当生则生，当爱则爱，当断则断，当死则死。这在《诗经》中有极好的体现。佛教生时怖死，爱时思断，总是活不在当下，故念头纷缠。后来的禅宗活在当下，看山还是山，不过是借着华夏的智慧、脱了佛教的牢笼、重回华夏的境界了而已，哪里算得是佛教的高明！就像庸医用错了药，害得你眼盲腿瘸，最后逼得你翻出爷爷的老药箱子，久病成医，你是该感谢你爷爷，还是感谢庸医？ 像如儒家的积极入世，修身齐家治国平天下，便是此列。做自己该做的事，为家国民族有大担当，只要民族绵延，家国永昌，我身枯朽何妨！不计生死，正是了脱了生死。2、道家的观点。老子曰：“吾所患者，为吾有身，及吾无身，吾又何患哉？”（道德经有从丹道角度解释的，在这里取用哲学的质朴理解。）活人担心生死，是因为他挂念自己的身体，如果身体消亡了，他还有什么好担心的？所以，生死正是生死的解药！何须另求？以此大无畏精神入世，所行皆是坦途。何须避父母，无君臣，弃红颜？3、仙家方法。导引练气，内丹外丹。推动化学和人体生命科学的进步。这也是实实在在的修行之法。既然生死无妨，那么失败了又何妨，成功了又何妨！4、神道观点。道生万物，长养八方。不会因为谁拜得勤一点，叫得嗲一点，就对他好一点。故极乐不独在西方，而善恶不判于野神。万民皆有归宿，无私无漏。华夏先民，殁后自然归于神山，乘风饮露，肌肤若冰雪，绰约如处子。长乐无极。若那辟小道，开后门，另收香火门票，威逼利诱者，不过是贪图香火和以生人意念为食的邪灵野神，绝非正道根本。华夏子孙，切不可失道而由径，背祖卖身，终落得飘零失根，四散无存。三．成住坏空 VS 生生之谓易。佛教把事物的发展概括为成住坏空，自以为得一切至理。其实，依然不过是他们的悲观思想在作怪。成住坏空成住坏空，这个链条本就是无限循环的，为什么不是坏空成住呢？我华夏先民，观事物生生之易，行自强不息之道，哪曾守着顽空悲悲切切来？和尚本着这种生无可恋的精神，自然事事与人辄相左，并自以为高明。你要生儿育女,我偏断子绝孙；你要身体发肤受之父母不可毁伤,我偏秃头烧胳膊；你讲孝道,我偏”出家“修行”；你说多子多孙好,我说这是你的”业障”；你讲自食其力,我偏作寄生虫吃”供养”；你说夫妇是道,我就说这个”邪淫”。这是全面的对抗，全面的去华夏。 佛教有此三者，足以坏一个民族的脊梁！有人说，至少佛教劝人向善，难道不好吗？——善是因为你愿意行善，还是佛要你行善？善是能劝来的吗？劝来的几乎都是伪善。又有人说，宗教信仰自由。我们不能或没有智慧来判断宗教的对错高低。——没有智慧来判断，不过是某些人明哲保身的遁词。是非对错已然明辨，是你自己贪恋迷醉之感，不愿意被惊醒罢了。再者，宗教信仰自由早期是清教徒为了叛离教会而喊出的口号，待清教徒站稳脚跟之后，这句话就成了西方人为了推广他们的宗教信仰而造出的虚假信条。那些向你谆谆阐述宗教信仰自由的人的本意是：“自由”地放下你原来的本民族信仰，然后来“自由”地加入他的信仰。宗教就是用来团结本族人、同化异族人的利器。如果宗教信仰真的自由，西方人就不应该如此热衷于向别的地区推广他们自己的信仰，因为别人本来已经有自己的信仰。既然宗教信仰从来无有真实自由之说，读者不妨考虑一下，到底什么才是符合自己民族本真面目的本来信仰？ 又有人说，历史上很多名人信佛。你有那些名人高明么？——我还会说英语会搞IT呢，那个某某历史名人他会么？名人不代表他什么都高明。会写字会画画，会吟诗作赋，就代表他很有智慧什么事都是对的么？莫扎特还很喜欢梅毒呢。那么梅毒就是对的么？ 又有人说，好多老法师勤恳说法几十年，没有功劳也有苦劳，你不能不尊老。——这又是佛教偷拿华夏文化来为自己诡辩的例子。孔子曾经说原壤，“幼而不孙弟，长而无述焉，老而不死是为贼！”佛教教人无父无君无妇无子，何止幼而不逊悌？自己不高明，如果无述也就罢了，还摇唇鼓舌乱述妄词，迷惑生民，盗用华夏文化，诱离中庸之道，你讲忠，我就讲愚忠，你讲孝，我就讲愚孝。这比无述更罪重百倍。如果是安安静静自己修行安度晚年的老和尚们，也就罢了，对那老而不安分、摇唇鼓舌的老和尚，劝你别倚老卖老，想想“老而不死是为贼”说的是什么样的人吧。 佛教有小智而堕大愚，似小悟而实大迷，遗小惠而生大害。明智的华夏子民哟，回归正道吧！","tags":[]},{"title":"word中使用visio绘图打印显示方框乱码","date":"2013-12-20T08:23:01.000Z","path":"posts/22506.html","text":"这几天时间清洁生产验收，半仙差点就悲剧了，报告中多处出现乱码，方框一样的东西， 网上搜罗一下方法，相当有用，再此就分享一下： 方法1： 1.右键查看并记录该对象的大小信息。 2.右键&gt;visio对象&gt;转换&gt;确定 3.重新设置对象大小就ok了。 方法2： 在复制visio图到word中时，采用选择性粘贴 1.若在Visio选择Visio图：选择Visio图形–&gt;切换到Word文档–&gt;菜单”编辑”–&gt;选择性粘贴–&gt;Microsoft Visio 绘图对象–&gt;确定 2.若Visio图形已经在Word中:选择Visio图形–&gt;菜单”编辑”–&gt;复制–&gt;选择性粘贴–&gt;Microsoft Visio 绘图对象–&gt;确定 方法3： 双击visio图，进入编辑模式；全选所有的图形（Ctrl＋A）；在选择的图形上点击右键选择“格式”－》“保护”；将“文本”选择框勾选后确定。这样设置之后，你的visio图就能正常打印了。 方法4： 在插入VISIO图与正文之间，多输入一个空行，插完图片后，再把空行删除 方法5： 在编辑模式下画的visio图，绝不会出现小方框的问题。所以对于有问题的visio图，双击visio图，进入编辑模式，在编辑模式下，对此图作任何修改（改变一下字体，里面的图移动一下位置等）再退出编辑模式。 方法6： Visio对象嵌入其他文档中(如WORD)打印时,出现汉字显示不正常,是Visio对象不能自动正确处理对象坐标单位和图形尺寸变化时文字的缩放和排列,你可将Visio对象保存为WMF或JPG图片,再嵌入其他文档中,可解决该问题.同时,对未安装Visio时,该文档也能正常使用. 最后介绍的方法，当图形较多，时间较急时，选择最好的方法是，用wps、office2010以上版本、或转换软件，半全文转换成pdf，再打印，则可以解决乱码问题。","tags":[{"name":"visio","slug":"visio","permalink":"http://7086.site/tags/visio/"}]},{"title":"word插入图片显示代码或白框的解决办法","date":"2013-12-15T07:16:50.000Z","path":"posts/8719.html","text":"最近年底了，同事们都忙了起来，像我们环境咨询行业只有埋头在word中奋斗了，经常用宏的同学都知道宏的快捷键是ALT+F8，这不问题来了。 折腾一番后，发现文档变少了十几页，原来是文档中图片全部变成了，形如，{EMBED Equation.DSMT4}这样， 这其实是，显示了文档中的域代码，原来刚刚按alt+f8错按成了alt+F9 再按一下alt+F9就可以恢复文档了。 或者，通过左上角的“OFFICE按钮” -》 “word选项” -》 高级 -》显示文档内容 对“显示域代码而非域值 ”去除勾选框。 有时插入的对象:图片,visio等等，全部显示为一个白框而没有内容 这时通过，左上角的“OFFICE按钮” -》 “word选项” -》 高级 -》显示文档内容对“显示图片框”去除勾选框，即可","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"EXCEL中“相对引用和绝对引用”","date":"2013-12-14T05:50:46.000Z","path":"posts/24642.html","text":"相对引用和绝对引用 1.相对引用 单元格或单元格区域的相对引用是指相对于包含公式的单元格的相对位置。例如，单元格 B2 包含公式 ＝A1 ;Excel 将在距单元格 B2 上面一个单元格和左面一个单元格处的单元格中查找数值。 在复制包含相对引用的公式时，Excel 将自动调整复制公式中的引用，以便引用相对于当前公式位置的其他单元格。例如，单元格 B2 中含有公式：=A1，A1 是 B2 左上方的单元格，拖动A2的填充柄将其复制至单元格 B3 时，其中的公式已经改为 =A2，即单元格 B3 左上方单元格处的单元格。 2.绝对引用 绝对引用是指引用单元格的绝对名称。例如，如果公式将单元格 A1 乘以单元格 A2 (=A1*A2)放到A4中，现在将公式复制到另一单元格中，则 Excel 将调整公式中的两个引用。如果不希望这种引用发生改变,须在引用的”行号”和”列号”前加上美元符号($)，这样就是单元格的绝对引用。A4中输入公式如下: =$A$1*$A$2 复制A4中的公式到任何一个单元格其值都不会改变 。 3.相对引用与绝对引用之间的切换 如果创建了一个公式并希望将相对引用更改为绝对引用(反之亦然)操作步骤如下: 步骤1:选定包含该公式的单元格； 步骤2:在编辑栏中选择要更改的引用并按 F4 键； 步骤3:每次按 F4 键时，Excel 会在以下组合间切换： ①绝对列与绝对行(例如，$A$1)； ②相对列与绝对行(A$1)； ③绝对列与相对行($C1)； ④相对列与相对行 (C1)。 例如，在公式中选择地址 $A$1 并按 F4 键，引用将变为 A$1。再一次按 F4 键，引用将变为 $A1，以此类推。如下图：","tags":[{"name":"excel","slug":"excel","permalink":"http://7086.site/tags/excel/"}]},{"title":"重点用能单位确定依据","date":"2013-12-04T04:42:02.000Z","path":"posts/54141.html","text":"中华人民共和国国家经济贸易委员会令 第7号 根据《中华人民共和国节约能源法》，现将《重点用能单位节能管理办法》予以公布，自公布之日起施行。 国家经济贸易委员会主任：盛华仁 一九九九年三月十日 重点用能单位节能管理办法第一章 总则 第一条 为加强重点用能单位的节能管理，提高能源利用效率和经济效益，保护环境，根据《中华人民共和国节约能源法》的规定，制定本办法。 第二条 本办法所称重点用能单位是指： （一）年综合能源消费量1万吨标准煤以上（含1万吨，下同）的用能单位； （二）各省、自治区、直辖市经济贸易委员会（经济委员会、计划与经济委员会，下同）指定的年综合能源消费量5000吨标准煤以上（含5000吨，下同）、不足1万吨标准煤的用能单位。能源消费的核算单位是法人企业。 第三条 重点用能单位应遵守《中华人民共和国节约能源法》及本办法的规定，按照合理用能的原则，加强节能管理，推进技术进步，提高能源利用效率，降低成本，提高效益，减少环境污染。 第二章 监督管理 第四条 国家经济贸易委员会负责全国重点用能单位节能监督管理工作。国务院有关部门在各自的职责范围内协助做好重点用能单位节能监督管理工作。各省、自治区、直辖市经济贸易委员会负责本行政区内重点用能单位节能监督管理工作。 第五条 国家经济贸易委员会会同国家统计局定期公布年综合能源消费量1万吨标准煤以上的重点用能单位名单，并定期发布年综合能源消费量1万吨标准煤以上的重点用能单位能源利用状况公报。 第六条 各省、自治区、直辖市经济贸易委员会会同同级统计部门，定期公布本行政区内年综合能源消费量5000吨标准煤以上、不足1万吨标准煤的重点用能单位名单，并报国家经济贸易委员会备案；定期发布本行政区内年综合能源消费量5000吨标准煤以上、不足1万吨标准煤的重点用能单位能源利用状况公报。 第七条 各省、自治区、直辖市经济贸易委员会按照年综合能源消费量制定重点用能单位分级管理方案并报国家经济贸易委员会备案。 实施分级管理的主管经济贸易委员会履行下列职责： （一）组织对重点用能单位的固定资产投资工程项目可行性研究报告中的节能篇（章）提出评价意见； （二）监督检查重点用能单位的主要耗能设备和工艺系统能源利用状况，委托具有检验测试资格的单位对重点用能单位进行节能的检验测试； （三）会同同级质量技术监督管理部门检查重点用能单位能源计量工作，会同同级统计管理部门检查重点用能单位能源消费和能源利用状况统计工作。 第八条 国家经济贸易委员会和省、自治区、直辖市经济贸易委员会负责委托具有培训条件的单位，对重点用能单位的能源管理人员进行节能培训。 第三章 重点用能单位的节能管理 第九条 重点用能单位应贯彻执行国家的节能法律、法规、方针、政策和标准。 第十条 重点用能单位应接受主管经济贸易委员会对其能源利用状况的监督、检查。 第十一条 重点用能单位应建立健全节能管理制度，运用科学的管理方法和先进的技术手段，制定并组织实施本单位节能计划和节能技术进步措施，合理有效地利用能源。 第十二条 重点用能单位每年应安排一定数额资金用于节能科研开发、节能技术改造和节能宣传与培训。 第十三条 重点用能单位应健全能源计量、监测管理制度，配备合格的能源计量器具、仪表，能源计量器具的配备和管理应达到《企业能源计量器具配备和管理导则》规定的国家标准。 第十四条 重点用能单位应建立能源消费统计和能源利用状况报告制度。重点用能单位应指定专人负责能源统计，建立健全原始记录和统计台帐。 重点用能单位应在每年1月底前向主管经济贸易委员会报送上一年度的能源利用状况报告。报告应包括能源购入、能源加工转换与消费、单位产品能耗、主要耗能设备和工艺能耗、能源利用效率、能源管理、节能措施和节能经济效益分析、预测能源消费等。 第十五条 重点用能单位应建立能源消耗成本管理制度。重点用能单位应根据国家经济贸易委员会和省、自治区、直辖市经济贸易委员会会同有关部门制定的单位产品能耗限额，制定先进、合理的企业单位产品能耗限额，实行能源消耗成本管理。 第十六条 重点用能单位应建立有利于节约能源、降低消耗、提高经济效益的节能工作责任制。明确节能工作岗位的任务和责任，通过岗位责任制和能耗定额管理等形式将能源使用管理制度化、落实到人，纳入经济责任制。 第十七条 重点用能单位应开展节能宣传与培训。主要耗能设备操作人员未经节能培训不得上岗。 第十八条 重点用能单位应设立能源管理岗位，聘任的能源管理人员应熟悉国家有关节能法律、法规、方针、政策，具有节能知识、三年以上实际工作经验和工程师以上（含工程师）职称，并报主管经济贸易委员会备案。能源管理人员负责对本单位的能源利用状况进行监督检查。 第四章 奖惩 第十九条 各级人民政府对在节能管理和节能技术进步中取得显著成绩的重点用能单位和个人给予表彰和奖励。 第二十条 重点用能单位应制定节奖超罚办法，安排一定的节能奖励资金，对节能工作中取得成绩的集体和个人给予奖励；对浪费能源的集体和个人给予惩罚。 第二十一条 重点用能单位违反本办法第十条规定，拒绝接受监督、检查的；或违反本办法第十四条规定，未建立能源消费统计和能源利用状况报告制度的；或违反本办法第十八条规定，未设立能源管理岗位或所聘能源管理人员不符合要求的，由主管经济贸易委员会以书面形式责令限期改正。逾期未改正的，对其及有关负责人给予通报批评。 第二十二条 重点用能单位虚报、瞒报、拒报、迟报、伪造、篡改能源消费统计资料的，按《中华人民共和国统计法》的有关规定予以处罚。 第五章 附则 第二十三条 本办法由国家经济贸易委员会负责解释。 第二十四条 本办法自公布之日起施行。 注：年综合能源消费总量是指一年内用能单位的物质生产部门和非物质生产部门实际消费的各种能源的总和。在计算时，用能单位的各种能源消费需要折算成标准煤，并扣除本用能单位能源加工转换产出的能源折标准煤的总量。用能单位的年综合能源消费总量只要达到或者超过了1万吨标准煤，该用能单位即为重点用能单位。（根据“综合能耗计算通则（GB/T2589—2008）”的规定：“计算综合能耗时，各种能源折算为一次能源的单位为标准煤当量。”）。","tags":[{"name":"能耗","slug":"能耗","permalink":"http://7086.site/tags/%E8%83%BD%E8%80%97/"}]},{"title":"生活污水排放系数0.8的确定依据","date":"2013-12-01T04:48:45.000Z","path":"posts/18780.html","text":"对于环保工作者而言，无论是在做环评还是在做可行性研究报告，经常遇到生活污水的排污系数的取值，通常我取0.8，当然也有人取0.85，0.6~0.7的，这些取值的依据主要从下面文件查找，我做个简单的归纳，主要包括《室外排水设计规范》GB50014-2006、《城市排水工程规划规范》GB50318-2000。 一、《室外排水设计规范》GB50014-2006 3.1.2.居民生活污水定额和综合生活污水定额应根据当地采用的用水定额，结合建筑内部给排水设施水平和排水系统普及程度等因素确定。可按当地相关用水定额的80%～90%采用。 二、《城市排水工程规划规范》GB50318-2000 表3.1.6 城市分类污水排放系数 城市污水分类 污水排放系数 城市污水 0.70～0.80 城市综合生活污水 0.80～0.90 城市工业废水 0.70～0.90 因此，通常我们取0.8还是比较科学的排污系数。","tags":[{"name":"排污系数","slug":"排污系数","permalink":"http://7086.site/tags/%E6%8E%92%E6%B1%A1%E7%B3%BB%E6%95%B0/"}]},{"title":"理解喷砂机与抛丸机区别","date":"2013-11-29T01:40:48.000Z","path":"posts/6994.html","text":"喷砂机与抛丸机是两种不同的表面除锈和表面粗糙化设备。两者的区别：1.喷砂采用压缩空气为动力，压缩空气带着砂子（金刚砂、刚玉等）冲击工件表面；抛丸采用电动的高速叶轮抛射钢丸冲击工件表面；2.冲击工件表面采用的材料不同，喷砂采用刚玉、金刚砂等高硬度耐磨材料，抛丸采用特制的各种特殊材质和形状的金属颗粒（称为抛丸）；3.喷砂和抛丸获得的表面硬度有所不同，抛丸有表面硬化作用。","tags":[{"name":"设备","slug":"设备","permalink":"http://7086.site/tags/%E8%AE%BE%E5%A4%87/"}]},{"title":"板框压滤机与离心机的应用","date":"2013-11-18T10:42:35.000Z","path":"posts/4735.html","text":"压滤机与离心机各有优点及缺点，只是适用范围不同罢了，下面是压滤机KO离心机的一些资料。 板框压滤机与脱水离心机都是固液分离行业中的过滤设备一、板框压滤机应用： 压滤机 是一种间歇性的加压过滤设备，适用于各种行业的股液体分离设备，压滤机作为一种成熟的脱水设备，被广泛应用到环保领域，成为污水污泥处理的重要设备。它是由滤板和板框(板框式)组成或有滤板排列(厢式)组成滤室，在输料泵的作用下，把悬浮液（液料）压入各个滤室，再利用过滤介质（常用滤㎡布，也可用滤纸、滤膜等）把固体和液体分离开来。厢式又有普通滤板和隔膜滤板之分。 压滤机 型号主要有320、450、630、800、1000、1250、1500、2000、Φ715、Φ810、Φ1000型板框式及厢式，过滤面积0.5㎡-1000㎡。板框材质有铸铁、球铁、增强聚丙烯、玻璃纤维聚丙烯（耐温120ºC）及不锈钢、铜等。压紧形式有手动压紧、千斤顶压紧、机械压紧、液压压紧、自动保压压紧、先进的微机程控全自动及程控快开式压滤机。过滤形式有明流、暗流、明流可洗、暗流可洗和双相交叉洗涤。聚丙烯材质具有化学性能稳定、耐酸碱、耐腐蚀、无毒、无味、无污染、操作简便等特点。 压滤机 广泛用于石油、化工、冶金、食品、环保、酿造、制药、制糖、淀粉、造纸、皮革、畜产、洗煤、及城市污水处理、流动性污泥、消化污泥、混合污泥等各个行业的生产过程及各种工业废水和城市生活污水的净化处理。二、离心机应用： 是利用离心机转子高速旋转产生的强大的离心力，加快液体中颗粒的沉降速度，把样品中不同沉降系数和浮力密度的物质分离开。所以需要利用离心机产生强大的离心力，才能迫使这些微粒克服扩散产生沉降运动。 离心机 主要用于化工、石油、食品、制药、选矿、煤炭、水处理等固液分离设备。三、优点及缺点： 压滤机与离心机都属于一种间歇性的固液分离设备，相比对于固液分离效率来说，在同等价格基础的设备上，压滤机要比离心机出泥量要到大3-5倍不等，而且效率要高，稳定性强，无噪音，操作劳动强度不大，设备稳定不容易坏，维修方便、费用不高。 压滤机优点：压滤机在操作使用是利用电控箱控制，采用液压装置作为压紧松开滤板的动力结构，并采用电接点压力表实现自动保压。操作简单安全，省力，整机工作稳定，电器部分配有多种安全装置，确保工作人员安全和压滤机的正常使用。 离心机缺点：离心机噪音大，对于需要过滤的原物料含水分高于50%时，鉴于不能溶于水的情况下，选用离心机。并且在操作过程中，离心机间歇性使用时，劳动力非常大，效率很低。从开始工作到卸料，离心机过滤物料只有很短时间。工人基本上是在不停的卸料，这样会造成工人劳动力下降，生产效率低的情况。而压滤机完全可以在物料少的情况下，不用中途卸料，直到把板框压滤机里面的滤室打满 方可卸料。四、压滤机与离心机设备性价比： 如果在使用压滤机过程中，工程生产量略大的时候，只需要添加几滤板或更换大梁长度 增大过滤面积、滤室容积，就可以满足生产需要。而离心机是一次购买使用，生产量受限制，只能二次购买。","tags":[{"name":"设备","slug":"设备","permalink":"http://7086.site/tags/%E8%AE%BE%E5%A4%87/"}]},{"title":"冷却塔的工作原理及选取","date":"2013-11-16T05:35:30.000Z","path":"posts/56057.html","text":"1、工作原理 冷却塔是水与空气直接接触进行热交换的一种设备，它主要由风机、电机、填料、播水系统、塔身、水盘等组成，主要由在风机作用下的温度比较低的空气与填料中的水进行热交换从而达到降低水温的目的。水塔的构造及设计工况在说明书上有注明，而我们现在采用的水吨为单位是国际上比较常用的单位。我们通常所说的冷却塔是指开放式冷却塔：是一种在塔内通过布水系统将热水喷洒成水滴或水膜状，水在填料中从上向下流动，空气在填料中由下向上或水平方向流动，利用水的蒸发及冷空气和热水的热传递带走水中废热的设备。 横流塔：是指热水从上向下穿过填料，而空气从水平方向流动穿过填料，热水和空气的流动方向呈近乎90°的一种冷却塔（有些厂家称为直交式或正交式冷却塔）。 横流冷却塔 逆流塔：是指热水从上向下穿过填料，而空气从下向上流动穿过填料，热水和空气的流动方向呈近乎180°的一种冷却塔（有些厂家称为对流式冷却塔）。 逆流冷却塔 2、选取 逆流式和横流式冷却塔各有优缺点，总的来说，噪音方面，逆流式冷却塔相对大一些；维修方面，横流冷却塔填料可以拆除清洗，电机、风机拆卸方便；实际应用中如果是建筑空调用，可以选择横流式冷却塔，噪音低，占地面积小，易检修；如果是工业用，则建议选择逆流式冷却塔，因横流塔冬季运行会挂冰，填料容易损坏。以上照片只是范例，实际中冷却塔形状各有不同。 通常工业中应用最多的是玻璃钢冷却塔","tags":[{"name":"设备","slug":"设备","permalink":"http://7086.site/tags/%E8%AE%BE%E5%A4%87/"}]},{"title":"CEB转PDF文件的终极办法","date":"2013-11-14T07:14:23.000Z","path":"posts/20978.html","text":"经网上查询CEB转PDF文件的办法较多，不是乱码，就是过程复杂不实用，涉及专业商业软件较多，需要付费。 本文涉及到的必备软件有：Adobe Acrobat（版本不限），Apabi Reader 4.4（经使用可行），Apabi Maker 5.0（经使用可行）。 一、 准备工作： 1. 安装以上三个文件。 2. 用Apabi Reader 打开CEB文件，选取“Adobe PDF”打印机无法打印，会弹出以下警示对话框： 3. 点击打开：开始——打印机和传真，将已安装的“Adobe PDF” 打印机改名，比如中间加一个下划线，改成“Adobe_PDF”。破解完成，知道如何点破窗户纸可不是那么容易！ 二、业余级CEB转换PDF 1. 用Apabi Reader 打开CEB文件，点击打印，选取“Adobe_PDF”打印机，点确定，即可直接在指定目录下转换出PDF文件。 2. 问题：该方法转换的PDF文件将字符转变为图像，大约72dpi，放大后“文字”不清楚，也无法选取，只适合今后阅读使用。经用排版文件打开此PDF文件后发现，每个字符图像均为单独的对象，可以编辑。 三、专业级CEB转换PDF 1. 本办法思想是先将CEB文件转为CEBX文件（好处见后面介绍），再将CEBX文件转为PDF文件。 2. 在安装了Apabi Maker后，在鼠标右键后会多出“转换为CEBX文件”选项。 3. 右键点击要转换的文件，弹出对话框: 选“转换为CEBX文件”选项，电脑自动打开“Apabi Maker ”，会在同目录下转出一个新的同名CEBX文件（因为格式不同，旧文件仍存在，不会被覆盖）。 4. 点击新的CEBX文件，电脑会用Apabi Reader 打开此文件。 5. 点击打印，选取“Adobe_PDF”打印机，点确定，即可直接在指定目录下转换出PDF文件。 6. 优缺点：该方法转换的PDF文件将字符转变为曲线字，放大后“文字”清楚，但仍无法选取，适合今后打印及其他特殊的使用。经用排版文件打开此PDF文件后发现，每个字符均为单独的曲线文字，可以编辑，放大、删除均可。 7. 以上2种方法产生的PDF文件将会较大，但2种方法产生的PDF文件大小差不多。 8. 如果有超长文件打印转换时发生乱码，可以采用分段打印的办法克服乱码现象。 以上方法经多次使用没有发现问题，当然用Apabi Reader 打不开的文件不在此列。 附：曾发现转换数百页文件时发生乱码，解决办法是每次转换100页即可解决。（然后再合并成一个文件，不会合并？用Adobe Acrobat 可以把多个文件合并成一个文件） 曾发现转换打印时发生错误提示，取消后再次打印即可。 注意：1. Apabi Reader 3.0版打不开cebx，4.5版已经不能采用此方法。 使用Apabi Reader 4.0-4.4版时请不要升级！（弹出升级窗口时关掉）","tags":[{"name":"pdf转换","slug":"pdf转换","permalink":"http://7086.site/tags/pdf%E8%BD%AC%E6%8D%A2/"}]},{"title":"畜禽养殖鼓励模式（核审减排）","date":"2013-11-13T06:52:34.000Z","path":"posts/7148.html","text":"一、鼓励模式1 蛋鸡和肉鸡养殖场（小区）采取干清粪、粪便全部生产有机肥、且无废水排放的，可认定COD、氨氮去除率100%； 二、鼓励模式2 五类畜禽养殖场（小区）建设治污设施的，无污水排放口，且所生产的废弃物综合利用产品（有机肥、沼渣、沼液及经处理后的污水等）经现场认定完全农田利用（需配备与养殖规模相适应的消纳土地，原则上以生猪计算每存栏5头不少于1亩土地，治污设施完全满足养殖规模需求，须提供详实的证明材料），可认定COD、氨氮去除率100%。 三、鼓励模式3 五类畜禽养殖场（小区）采取干清粪、粪便生产有机肥、污水进行厌氧-好氧-深度处理达标排放，且配备了在线监测或视频监控设备并联网的，可认定COD（氨氮）去除率99%（94%）； 四、鼓励模式4 五类畜禽养殖场（小区）采取干清粪、粪便农业利用、污水进行厌氧-好氧-深度处理达标排放，且出水全部利用的，可认定COD（氨氮）去除率为97%（89%）。 五、鼓励模式5 生猪、奶牛、肉牛规模化养殖场（小区）采取干清粪方式，建设废弃物储存设施，无污水排放口，且粪便、污水/尿液经现场认定完全农业利用（需配备与养殖规模相适应的消纳土地，原则上以生猪计算每出栏5头不少于1亩土地，储存设施满足养殖规模需求，须提供详实的证明材料），可认定COD（氨氮）去除率90%（70%）。 …. 全文给出下载地址：[reply] http://www.kuaipan.cn/file/id_12878021350448875.htm?source=1访问密码：JKbnHs [/reply]","tags":[{"name":"禽畜","slug":"禽畜","permalink":"http://7086.site/tags/%E7%A6%BD%E7%95%9C/"}]},{"title":"拒酒词--与领导喝酒的诀窍","date":"2013-11-09T14:08:35.000Z","path":"posts/19360.html","text":"工作中应酬真是必不可少，环保行业也特别明显，项目进展总是要和一些局长啊，专家啊什么的打交道，作为苦逼技术员，久经沙场的还好说，酒量不行的至少应该知道常用的拒词。酒桌这个交际场所，是挺考验人的。你不能喝酒，最好学会拒酒；你不能酒量让新友们痛快，那就凭三寸不烂之舌让大伙儿开心。这样，你即时伤自己的身体，又不让劝酒者扫兴，当然对领导、对朋友、对同事、对合作伙伴大家斟酌用词就是了。 与领导喝酒的27个诀窍诀窍1 酒桌上虽然“感情深，一口闷；感情浅，舔一舔”但喝酒的时候决不能把这句话挂在嘴上。诀窍2 韬光养晦，厚积薄发，切不可一上酒桌就充大。诀窍3 领导相互喝完才轮到自己敬。诀窍4 可以多人敬一人，决不可一人敬多人，除非你是领导。诀窍5 自己敬别人，如果不碰杯，自己喝多少可视乎情况而定，比如对方酒量，对方喝酒态度，切不可比对方喝得少，要知道是自己敬人。诀窍6 自己敬别人，如果碰杯，一句，我喝完，你随意，方显大度。诀窍7 自己职位卑微，记得多给领导添酒，不要瞎给领导代酒，就是要代，也要在领导确实想找人代，还要装作自己是因为想喝酒而不是为了给领导代酒而喝酒。比如领导甲不胜酒力，可以通过旁敲侧击把准备敬领导甲的人拦下。诀窍8 端起酒杯(啤酒杯)，右手扼杯，左手垫杯底，记着自己的杯子永远低于别人。自己如果是领导，知趣点，不要放太低，不然怎么叫下面的做人？诀窍9 如果没有特殊人物在场，碰酒最好按时针顺序，不要厚此薄彼。诀窍10 碰杯，敬酒，要有说词。诀窍11 桌面上不谈生意，喝好了，生意也就差不多了，大家心里面了然，不然人家也不会敞开了跟你喝酒。诀窍12 不要装歪，说错话，办错事，不要申辩，自觉罚酒才是硬道理。诀窍13 假如，纯粹是假如，遇到酒不够的情况，酒瓶放在桌子中间，让人自己添，不要傻不啦叽地去一个一个倒酒，不然后面的人没酒怎么办？诀窍14 最后一定还有一个闷杯酒，所以，不要让自己的酒杯空着。跑不了的～诀窍15 注意酒后不要失言，不要说大话，不要失态，不要唾沫横飞，筷子乱甩，不要手指乱指，喝汤噗噗响，不要放屁打嗝，憋不住上厕所去，没人拦你。诀窍16 不要把“我不会喝酒”挂在嘴上(如果你喝的话)，免得别人骂你虚伪，不管你信不信，人能不能喝酒还真能看出来。诀窍17 领导跟你喝酒，是给你脸，不管领导要你喝多少，自己先干为敬，记着啊，双手，杯子要低。诀窍18 花生米对喝酒人来说，是个好东西。保持清醒的头脑，酒后嘘寒问暖是少不了的，一杯酸奶，一杯热水，一条热毛巾都显得你关怀备至。酒量不行的9个技巧 1、不要主动出击，实行以守为攻战略；2、桌前放两个大杯，一杯放白酒，一杯放矿泉水，拿小酒盅干杯，勤喝水，到酒桌上主客基本都喝8分醉时，可以以水代酒，主动出击；(这条不建议用)3、干杯后，不要马上咽下去，找机会用餐巾抹嘴，把酒吐餐巾里；(适用女性)4、上座后先吃一些肥肉类、淀粉类食品垫底，喝酒不容易醉；5、掌握节奏，不要一下子喝得太猛；6、不要几种酒混着喝，特别容易醉；7、领导夹菜时，千万不要转酒桌中间的圆盘，领导夹菜你转盘是酒桌上的大忌；8、喝到六分醉时，把你面前的醋碟中的醋喝下，再让服务员添上……9、每次干杯时，倒满，然后在喝前假装没有拿稳酒盅，尽量洒出去一些，这样每次可以少喝进去不少小喝怡情，大喝伤身，强喝灰飞烟灭，希望个位尽量不要酗酒。","tags":[{"name":"百科","slug":"百科","permalink":"http://7086.site/tags/%E7%99%BE%E7%A7%91/"}]},{"title":"非甲烷总烃质量标准确定依据","date":"2013-11-09T02:16:52.000Z","path":"posts/15300.html","text":"前次环评评审会，专家专门对这个非甲烷总烃的质量标准强调了依据及出处。 中国环境空气质量标准中没有非甲烷总烃的标准。目前大家一致采用2mg/m3。数据来源出处是由中国环境科学出版社出版的国家环境保护局科技标准司的《大气污染物综合排放标准详解》，具体第244页。原文如下：由于我国目前没有“非甲烷总烃”的环境质量标准，美国的同类标准已废除，故我国石化部门和若干地区通常采用以色列同类标准的短期平均值，为5mg/m3。但考虑到我国多数地区的实测值，“非甲烷总烃”的环境浓度一般不超过1.0mg/m3，因此在制定本标准时选用2mg/m3作为计算依据。 给出下载地址：[reply]点我下载[/reply] 访问密码：VTKH0k","tags":[{"name":"标准","slug":"标准","permalink":"http://7086.site/tags/%E6%A0%87%E5%87%86/"}]},{"title":"真脸QQ表情制作教程","date":"2013-11-04T04:22:13.000Z","path":"posts/44159.html","text":"首先，Ps软件得有吧（Photoshop），打开准备好的素材如： 执行【图像】-【调整】-【去色】如： 把前景色跟背景色调为黑与白： 执行【滤镜】-【素描】-【影印】，细节跟暗度自己调： 接下来找到自己喜欢的表情模板，如： 用套索工具把脸部分抠出来， 粘贴到准备好的表情模板上去 【编辑】-【变换】-【水平翻转】 最后再把脸部旋转到跟模板角度平衡 好了，一个简单的真脸表情制作基本完成了，是不是感觉特逗，当然过程中，有些表情会出现较多的杂质，比如说原图人物脸部不完美，有皱纹等，影印出来之后就可以用橡皮擦处理一下，最后尽量线条简单明了","tags":[{"name":"表情","slug":"表情","permalink":"http://7086.site/tags/%E8%A1%A8%E6%83%85/"}]},{"title":"变频调速技术在节能中的应用","date":"2013-11-03T13:50:21.000Z","path":"posts/56254.html","text":"什么叫变频调速技术，它是一种以改变电机频率和改变电压来达到电机调速目的的技术。大家都知道，目前，无论哪种机械调速，都是通过电机来实现的。从大范围来分，电机有直流电机和交流电机。 过去的调速，多数用直流电机，由于直流机调速容易实现。但直流机固有的缺点：滑环和碳刷要经常拆换，给人们带来太大的麻烦。因此有人就想，如果把可靠简单的笼式交流电机用来调速那该多好！ 因而就出现了定子调速、变极调速、滑差调速、转子串电阻调速、串极调速、液力偶和调速等交流调速方式。当然也出现了滑差电机、绕线式电机、同步机、这些都是交流电机。 到20世纪80年代，由于电力电子技术、微电子技术和信息技术的发展，才出现了对交流机来说最好的变频调速技术，它一出现就以其优异的性能逐步取代其它交流电机调速方式，乃至直流电机调速，而 成为电气传动的中枢。因而说变频调速是时代的产物，只有在技术高度发展的今天，才能实现。为什么说它是基于电力电子、微电子、信息技术发展的产物？一是它的逆变部分都基于电流很大、电压很 高的 SCR、GTR、IGBT、GTO、MCT等电力电子器件来完成的。什么叫逆变：就是直流变交流（DC－AC）那么交流变直流就叫整流（AC－DC）。二是它的控制部分和负载状态的检测是由CPU（32位计算机来完成，这是微电子器件发展的结果。三是内置4－20mA 接口和 RS485 接口可以和仪表、DCS 相接，通过总线Profibus、Interbus 通讯。 调速节能原理从二个方面来说明： 1、风机水泵的节电原理就是用调速控制代替挡风板或节流阀控制风流量，这是一个节电的有效途径。在用档风板控制额定风量Q1=100%输出时，则轴功率N1与面积AH1 OQ1成正比，若风量减半Q2 =50%输 出时，则轴功率N2与面积BH2 OQ2成正比，它比N1减少不多，这是因为需要克服档风板阻力增大风压所致。如果采用调速控制同样风量减半输出时，转数由n1降至n2，按风机参数比例定律画出n2时的特性 曲线，C点为新的工矿点，这时轴功率N2与面积CH3OQ2成正比，在满足同样风量Q2情况下，轴功能降低很多，节省的功率耗损△N与面积BH2H3C成正比，可见节电效果十分显著。 2、流体力学的观点 流量∝转速，压力∝转速^2，轴功率∝转速^3，若转速下降20%，则功率下降到51.2% ；若转速下降50%，则轴功率下降到12.5% ，即使考虑调速装置本身的损耗等因素，节电也是相当可观的。 为此，许多行业、如钢铁、有色、石油、石化、化工、纺织、机械、电力、建材、医药、煤炭、造纸、卷烟、酒店、自来水等行业都在许多设备中采用交流电机变频调速技术，产生节电及增产的效果，下面举几个例子： 实例 1、空调类负载 家庭用空调只有0.5HP、1HP、2HP、3HP等，而工厂和宾馆的空调容量要大的多，节电明显。 北京丽都假日饭店动力中心是一个集中供冷、供热的工厂，安装有 20吨/小时蒸汽锅炉3台，300万大卡溴化锂制冷机4台，负责动力厂周围的丽都假日饭店、燕翔饭店、新万寿宾馆、国际学校、日本学校、德国学校及丽都饭店宿舍、托儿所、公园等涉外饭店、宾馆、公寓、学校的供热、供冷，供热面积30万平方米、供冷面积20万平方米。91年，对水泵制冷机、引风机采用变频控制，节电明显，一般在 30～60%，年节电17.5万KW，优于其他调速方式。广州市鸣泉居度假村在冷热水、喷泉等设施上采用了变频调速控制，节电效果非常好。我们深圳市的东华假日酒店的空调也采用了变频调速，节电显著、房间温度适度。 实例 2、泵类负载 泵类负载，量大面广，包括水泵、油泵、化工泵、泥浆泵、沙泵等，有低压中小容量，也有高压大容量。 茂名石化公司炼油厂从1990年开始先后在蒸馏、裂解、加氢、糠醛、酮笨等20多条生产线上使用161台变频调速装置。变频器总功率达8091KW。1990年10月至1992年2月对其中30台泵进行测试，在同等工 艺下，采用调节阀控制耗电999.9KW，而采用变频调速电耗为396.7KW，节电603.2KW,节电率60.3%。采用变频控制时，电机和泵的转数下降，轴承等机械部件磨损减低，泵端密封系统不易损坏，电机故障 率降低，维修工作量大为减少。94年后，该厂又采用了14套6KV大容量变频装置，节电40%到70%。1995年11月14日《中国石化报》第一版“茂名石化公司炼油节能居同行前面”文章称“仅通过变频调速技 术一年就节电2000万千瓦时”。深圳梅林水厂首期设计日供水能力为60万立方米，八套离心水泵有4套采用了高—低—高型变频调速装置，95年节电83万度。深圳市益力矿泉水公司也在水泵上安置变频调速装置，取得了较好的节电效果。 实例 3、电梯高架游览车类负载 由于电梯是载人工具，要求拖动系统可靠，又要频繁的加减速和正反转，电梯动态特性和可靠性的提高，便增加了电梯乘坐的安全感、舒适感和效率。过去电梯调速直流居多，近几年逐渐转为交流电机 变频调速，无论是日本，还是德国。我国不少电梯厂都争先恐后的用变频调速来装备电梯。如上海三菱、广州日立、青岛富士、天津奥的斯均采用交流变频调速。不少原来生产的电梯也进行变频改造。 许多人坐过深圳世界之窗的单轨高架游览车，该车行驶中频繁起动、停车、上坡、下坡，并要求起停平稳，车速恒定。由于是载人车，运行必须安全可靠，常年日晒雨淋，环境恶劣。以往要求调速性能 高的传动装置，多采用带测速反馈的矢量控制系统，价格较高。为了降低价格，并维修方便，我们采用了通用型变频器转矩矢量控制方式，成功解决了起动 /加速、停车/减速、恒速/变速行驶等，并防 止了“下滑”、“冲站”现象的产生，达到了安全可靠，用户非常满意。这次改造是由我们深圳华能电子有限公司完成的。 案例 4、搅拌机类负载 化工、医药行业搅拌机非常之多，采用变频调速取代其他调速方式，好处特多。 东北制药厂氢化发酵岗位共有 8台6.5吨发酵罐，电机功率为18.5KW，原为齿轮调速，如遇搅拌速度变化需拆卸三角皮带，既笨重又不安全。改用变频调速后，年节电8.6万KW，发酵过程明显好转，提高 了产品质量，减少了维修，仅减少三角带费用就节省3万元，减少了工人劳动强度，有益于工厂，有益于工人。又如：石家庄华曙制药厂用10套315KW变频器拖动搅拌机在制药工艺中生产土霉素。 实例 5 、注塑机类负载 注塑机是塑料加工成型的关键设备，数量多，耗电大。过去的节电方式多为通过△型转换 Y 型（星型）来节电的，效果一般。采用变频器调速不改变注塑机原来的结构，控制油泵几个过程的压力或流量 （如锁模、合模、射胶、保压、脱模、退模等），可节电20%～52%，较好的取代过去的比例阀节流调速方式，大幅度降低能耗，珠三角的不少注塑厂都进行了变频改造。改造注塑机时，要注意合模加速 ，否则产量降低；注意输入端和输出端的谐波干扰。 实例 6 、污水处理等环保类负载 环境保护越来越被重视，它关系到人类赖以生存的环境，连申奥也有环境指标。于是乎清洁能源、绿色城市均出现了。变频调速可用在三个方面的环保类负载。一是工业污水处理，二是垃圾电厂，三是 工业排烟、排气、除尘的控制。如广州炼油厂，改用曝气机污水处理的搅拌设备，采用笼式电机变频调速后，提高产品可靠性，节电40%以上，同时提高了活性污泥微生物群的寿命，提高了污水处理的效 果。再如佛山垃圾电厂在工艺中选用52台变频器。可见变频调速已成为环境保护的主要设备。中国石化总公司制定一个熄灭火炬（主要指大炼油厂的可烧气体）计划，即是把可燃气体输送到用变频调速 的压缩机柜回收。 实例7、音乐喷泉类负载 非常招揽游人的音乐喷泉，其水的高低和量的大小是靠变频控制的。亚洲喷水最高的广东河源市音乐喷泉和规模很大的山东济南泉城广场音乐喷泉均属于此，即节电又效果颇佳，在施工音乐喷泉时，要 注意变频器谐波对控制系统的干扰。 实例 8、卷烟机类负载 卷烟行业过去进口的卷烟机，不论莫林8、还是莫林10，均非无级调速。因而，在卷烟行业主要是解决无级调速和可靠性问题，技术简单，变频器用法简单，收效极大。 昭通卷烟厂十九台进口的格兰特4卷接包装联合机组采用变频调速后，日增产香烟200 箱，200箱香烟的利税相当19台变频器的价格，即一天收回投资。因而，卷烟机改造迅速，受益很大。现在国产的烟机大部分都装备了变频调速功能。 实例 9 、大型窑炉煅烧类负载 冶金、建材、烧碱等大型工业转窑（转炉）以前大部分采用直流、整流子电机、滑差电机、串极调速。由于这些调速方式或有滑环、或效率低，近年来，不少单位采用交流变频控制，效果很好。 株州冶炼厂锌浸出渣挥发回转窑是回收锌的主体设备，共有三台。窑外径2.8米，长44 米，原用正流子电机和滑差电机拖动，故障多，经常跳闸，维修量极大。由于现场环境恶劣，导电尘埃多，电机火 花不断。刷握、碳刷更换不断，90年小修56 次，更换碳刷1670只，刷握647只，严重的影响了生产。91年6月该厂完成了回转窑的变频调速改造。运行平稳、可靠、操作简单，没有发生因电机拖动故障而 影响生产。年节电12万度，超产117.82万元。唐山碱厂轻灰煅烧炉是纯碱生产关键设备，直径3.6米，炉身长30米，总重266 吨，采用 220KW变频器拖动，低频启动好，旋转稳定，可靠性高，提高了产品 质量，使该煅烧炉的生产进入全国先进行列。 实例 10 、吊车、翻斗车类负载 吊车、翻斗车等负载转矩大且要平稳，正反频繁且要可靠。变频装置控制吊车、翻斗车满足这些要求。 独子山石化厂酮苯车间为三台过滤器的安装而设置一台20吨桥式起重机，工艺要求防爆，采用防爆笼型电机。原生产的吊车主钩、辅钩、大车、小车无调速功能，不能定位。力矩小，吊起物体下滑，无 法吊装19吨重的过滤器机座，使该车间晚开工一年多，损失千万元。91年7月采用变频调速加制动功能，使主钩、辅钩、大车、小车五台电机由一台变频器控制，效果很好。过载试验吊起22吨，很快把3 台各重40吨的过滤机安装在10米高二层平台的机位上。 码头港机、车站龙门吊、货场堆取料机等都可以采用变频调速装置，以达到可靠、平稳、节电、少维修的目的。 变频调速装置，除节电显著外，还是某些生产工艺中必需的设备。 实例 11 、转炉类负载 转炉类负载，用交流变频代替直流机组简单可靠，运行稳定。 1994年5月1日，承德钢铁公司炼钢厂三套20吨转炉直流拖动系统全部处于故障状态。拟寻找一个“又快又好”的恢复生产的调速方式，请来了我国电气转动专家刘宗富教授。在刘教授的建议下，由该公 司经理定案，20吨转炉倾动和氧枪升降采用交流变频调速拖动。从供货到安装、调试、经过13 天，三台转炉全部正常投入生产。这是我国20吨转炉倾动和氧枪升降第一次采用变频调速。经过多年的生产 应用，该系统运行稳定可靠，技术指标完全满足工艺要求。转炉、氧枪主传动系统引起的热停工减少90%以上，年增产1.5万吨钢，节电22万度，直接经济效益231万元。为钢厂以后稳定的生产打下坚实的基穿,该系统1995年通过机械工业部鉴定，并被河北省评为技术进步一等奖。 实例 12 、特种电源类负载 许多电源，如实验电源，飞机拖动电源（400HZ）都可用变频装置来完成，好处是投资少、见效快、体积些操作简单。 粘胶纤维行业纺丝设备多数是高速电机，众多的纺绽电机为150HZ/160V 。长期以来，国内粘胶行业一直使用电动——发电机组中频电源供电，称动变频。由于这种方法弊病太多，而逐步采用交流变频电 源供电，称静变频。邵阳化纤厂是我国粘胶行业最早自行应用静变频的厂家，八台160KW 变频器分二组供电（每组一台备用）。自1992 年12月生产以来，比动变频有明显的优势。 A.可靠。运行多年，未发生故障跳闸。 B.运行稳定，电压、频率波动极些 C 调频方便，为工厂生产不同捻度的丝饼创造了条件。 D.噪音小，改善了操作人员的环境。 E.提高了产品质量。该厂一期工程（采用动变频供电），粘胶长丝合格率仅55.1% ，一等品合格率为零，二等品合格率为20%，而二期工程（采用静变频供电）平均合格率98.12%，一等品合格率88.7%。 F.增加了产量。一期工程设计能力2000 吨/年，试生产半年，产量仅65.53吨，而二期工程设计能力1000吨/年，试生产半年，生产长丝685.25吨，大大超过设计能力。 G.节电13%。 由于静变频为粘胶行业带来极大的好处，不少企业，如吉林化纤厂、九江化纤厂、宜宾化纤厂、湖北化纤厂、丹东化纤厂、潍坊化纤厂（除宜宾外，均属上市公司）等均采用了静变频技术。 变频调速除节电外，还有增产、降耗、优质的效果。由于它具有体积些重量轻、精度高、通用性强、工艺先进、功能丰富、保护齐全、可靠性高、操作简便等优点，深受使用人员欢迎，变频调速确是 节能、降耗、优质、高产的理想设备，是迈入21世纪的首要的传动技术，利国利民。","tags":[{"name":"节能","slug":"节能","permalink":"http://7086.site/tags/%E8%8A%82%E8%83%BD/"}]},{"title":"CAD2008转成PDF之后，字体变粗解决方案","date":"2013-11-02T08:56:57.000Z","path":"posts/4711.html","text":"经常用cad做图的同学，可能最喜欢把图转换为pdf了，因为pdf支持矢量图线，而且这样打印效果比较出众，前一段时间有同事问过我这个问题，说转换后pdf中自己写入的字体会变粗，当时也纠结了很久，修改图层、打印设置都没太管事，最终用了第三方的打印工具，可以解决，但是缺点也是显而易见的，一是转换速度会变慢很多，二就是第三方打印工具打出来的pdf已经不是矢量图了。 前一段时间，电脑升级换代了，用了较新的cad2012，发现这个问题竟然没有了，打印出的图纸字体都很清晰，而且界面大气，相信喜欢用office2010的同学，应该都会同样喜欢cad2012的，在此也建议，那些还坚持在cad2004、2008的同学，如果不是电脑太旧，升级吧，不错的，很好用。","tags":[{"name":"cad","slug":"cad","permalink":"http://7086.site/tags/cad/"}]},{"title":"能源当量值、等价值及折标煤的计算","date":"2013-11-01T04:20:37.000Z","path":"posts/57531.html","text":"清洁生产工作中，我们经常需要对企业做能源分析，难免就需要涉及到能源当量值与等价值，今天博主就谈一谈这个。 1、基本概念能量的当量值（energy calorific value），又称理论热值（或实际发热值），是指某种能源本身所含热量，按热量的多少可以折算成标准煤。当量热值的计算原则上要进行实测，按国家标准是根据试样在充氧的弹筒中完全燃烧所放出的热量测算的。 能量的等价值（energy equivalent value），是指为了得到一个单位的二次能源（或载热工质）实际要消耗的一次能源的热量，即加工转换产出的某种能源与相应投入的能源的当量。 能源等价热值 = 二次能源具有的能源/转换效率（%）。当量值与等价值的区别“当量值”是单位能源本身所具有的热量； “等价值”则是生产一个单位的能源产品所消耗的另外一种能源产品的热量。 2、何为1千克标准煤？ 我国规定，低（位）发热量等于29.27 MJ（或7000 kcal）的固体燃料，称1 kgce。即是1千克标准煤。 3、当量系数、等价系数 能源折标系数也有当量系数与等价系数之分，当量系数是按照燃料的当量热值（理论发热量）与标准煤发热量之比；等价系数是指二次能源的等价热值与标准热值之比。 4、关于电的折标计算 (1)电力折标当量系数基层企业计算电力能源消费量时，电力消费折标则采用当量值核算（即每千瓦小时电本身的热量860大卡/7000大卡=0.1229克标准煤量，也就是每万千瓦小时电折1.229吨标煤）。(2)电力折标等价系数电力等价热值是火电厂每供应1千瓦时电所消耗的热量，故电力折标准煤等价系数就是供电标准煤耗，供电的标准煤耗，随着发电机组效率的提高而逐年下降，电力等价热值的折标系数以当年的火力发电平均供电标准煤耗计算。折标煤等价系数随着发电煤耗的变化而变化，当量系数则是一定的，就数值大小而言，电力的等价系数是当量系数的3倍。自2006年起，能源统计中“电力”的折标系数，统一采用当量系数0.1229，即1万千瓦时电力，折合1.229吨标准煤，在此之前为4.04吨标准煤。 计算依据：2005年《国家统计局关于布置2005年统计年报和2006年定期统计报表制度的通知》（国家统计局[2005]85号文），2008年6月1日实施的《综合能耗计算通则》（GB/T 2589—2008） 5、关于水的折标计算 在企业能源统计中一般不给水折标计算。热水可以折标，常温水属于资源，不按能源统计。 工业用水通常属于耗能工质。新水折标煤系数取0.0857kgce/t。 耗能工质：在生产过程中所消耗的不作为原料使用、也不进入产品，在生产或制取时需要直接消耗能源的工作物质。 具体的各种折标系数，请查询《综合能耗计算通则》（GB/T 2589—2008）","tags":[{"name":"清洁生产","slug":"清洁生产","permalink":"http://7086.site/tags/%E6%B8%85%E6%B4%81%E7%94%9F%E4%BA%A7/"}]},{"title":"在Word2010中快速插入microsoft公式3.0","date":"2013-10-26T08:29:56.000Z","path":"posts/44254.html","text":"上面一篇文章我已经介绍了，如何设置word 2010中公式的字体，以及在word2010中插入microsoft公式3.0的方法，需要以下步骤：插入－对象－ Microsoft 公式 3.0 ，才可以实现，感觉太繁琐，今天博主介绍的方法是利用宏，快速快速插入公式3.0，对习惯使用旧版本公式的同学是福音了。 1、由于需要借助“宏”完成这一任务，若要在 Office Word 2010中使用宏，需要显示“开发工具”选项卡。 ①单击“文件” ，然后单击“选项”。 ②单击“自定义功能区”，勾选“开发工具”选项。 这时候word导航栏视图右边会多了一项开发工具 2 、在“开发工具”选项卡上的“代码”组中，单击“录制宏”。 3 、在“宏名”框中，键入宏名称，这里输入“公式”。 4 、单击“确定”按钮。 5 、在“插入”选项卡上的“文本”组中，单击“对象”。 6 、在弹出的“对象”对话框中，选择“对象类型”：“ Microsoft 公式 3.0 ”，单击“确定”按钮。 7 、此时即进入旧版的公式编辑器输入界面，不作任何输入，直接左键单击页面空白部分退出公式编辑器输入界面。 8 、单击“开发工具”选项卡上的“停止录制”。 9 、在选项卡上单击鼠标右键，单击“自定义快速访问工具栏”。 10 、在“ Word 选项”对话框中，单击“自定义功能区”，将“从下列位置选择命令”下面的列表框选为“宏”，选中刚录制的宏“ Normal.NewMacros. 公式”，单击“添加”按钮将其添加到右侧。这时候我们发现根本添加不了，我们只需要添加一个自定义选项卡，然后添加到该选项卡下就可以上了。 11 、当然可以通过下方的自定义键盘来设置快捷键，单击“自定义”按钮，将“显示名称”改为“公式”，输入快捷键“ctrl+j”，（其他的快捷键都很长用不便改设，唯“ctrl+j”分散居中可以不用）然后单击“指定”按钮即可（如上图）。 其实半仙写了这么多，还是要和大家说一下，新版的公式很不错，没必要一直守旧，没有特殊要求的话，就用新版的公式的吧，只不过要求文件后缀要为docx才行。","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"加密word文档破解教程","date":"2013-10-26T05:40:52.000Z","path":"posts/10425.html","text":"办公时，经常遇到业主给我们发的文档是加了密码的，今天半仙介绍的是破解加密的word文档，这些密码当然是设计单位加的了，但是有方法可以搞定。 方法1：插入法启动WORD，新建一个空白文档，执行“插入——〉文件”命令，打开“插入文件”对话框，定位到需要解除保护的文档所在的文件夹，选中相应文档，单击“插入”按钮，将加密保护的文档插入到新文档中，文档保护会被自动撤销。 方法2：文件另存法 打开保护的文档，执行“文件——〉另存为”命令，打开“另存为”对话框，将“文件类型”选定为“WORD97—2003&amp;6.0/95—RTF(*.doc)”，然后取名保存，关闭该文档，重新打开一下，执行“工具——〉取消文档保护”命令即可。或者将文件类型另存为HTML，然后将其中的内容，复制粘贴到新建文档中。 方法3：写字板法 启动写字板，打开保护的WORD文档，另存为WORD文档，同时可以取消对文档的保护。但此方法可能会使文档中的图片等要素丢失。 方法4：第三方软件法（即一般所说的解密软件） 好了，正常以上方法就可以搞定了，word的解密就到这里，有空半仙继续为大家介绍，cad的解密技巧。","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"化工里产率、得率、收率、出率、转化率、利用率、选择性详解","date":"2013-10-25T07:14:06.000Z","path":"posts/64301.html","text":"作为一名环保工作者，在接触到化工项目时，半仙也被化工里产率、得率、收率、出率、转化率、利用率、选择性等概念搞得头大，在此半仙就整理一下： 1、收率 我们也看一下概念：收率（yield 或percent yield）或称作反应收率，一般用于化学及工业生产，是指在化学反应或相关的化学工业生产中，投入单位数量原料获得的实际生产的产品产量与理论计算的产品产量的比值。同样的一个化学反应在不同的气压、温度下会有不同的收率。一般而言，收率在90%以上是很高的收率，75%以上是不错的收率，60%左右是一般的收率，30%以下是很低的收率。 也就是说： 收率=实际产品产量/理论产品产量 这是以产品作为基准 理论产量——指按反应方程式,实际消耗的基准原料全部转化成产物的质量。 在实际的化学反应中，由于存在副反应、反应进行不完全以及分离提纯过程中引起的损失等原因，实际产量往往低于理论产量。 在实际生产过程中要求产量高，而不是产率高，因为未反应的原料可循环使用。 其实化工正常应用中，我也经常把收率以全部反应原料为基准来测算。收率是指按反应物进行量计算，生成目的产物的百分数。一般用质量百分数或体积百分数表示。 即收率=（目的产物生成量/反应物进料量）×100%。 反应物料一次通过催化剂床层转化为目的产物的百分数称为单程收率。常用来衡量催化剂活性。 也可用生成某产物的实际产量占按加入的某一反应物计算生成该产物的理论产量的百分数来表示。 所以遇到这种纠结的问题搞清楚就可以了，半仙还是正常按照定义来计算收率。 2、产率、得率 产率=得率=收率=实际产品产量/理论产品产量 3、出率 在这里要点一下，出率通常是用于固液分离，液液分离，计算 出率=实际产出量/原有物料总量 4、转化率、原料利用率 是指反应物消耗占全部反应物的分率 转化率=利用率=反应消耗的量/全部该反应物的量 5、选择性 选择性是指生成目的产物所消耗的反应物与生成其它产物消耗反应物的比 收率与转化率及选择性的关系为：收率=转化率×选择性。 这都是概念性的东西，希望帮助到需要的人。","tags":[{"name":"收率","slug":"收率","permalink":"http://7086.site/tags/%E6%94%B6%E7%8E%87/"}]},{"title":"工业项目建议书的内容与深度要求（2000年试行版）","date":"2013-10-24T07:03:35.000Z","path":"posts/59527.html","text":"工业项目建议书的内容与深度 （2000年试行版） 项目名称： 建设单位： 法人代表： 项目负责人： 联系地址： 邮编： 电话： 传真（或e-mail）:【内容提要】 投资项目提出的必要性：2拟建项目和产品的方案3简述建设条件和资源情况4投资估算和资金筹措设想5项目大体进度安排6经济效益和社会初步评价。 一、承办企业的基本情况 企业概况（企业名称，注册日期，所有制，经营体制类别，联属关系。地理位置，主要生产经营范围）； 企业主要生产产品，规模，生产，经营情况。 二、项目建设项目的意义 1****、项目建设的必要性 扼要说明项目的背景； 根据国家，行业，地区规划，宏观经济政策，产业发展政策，说明项目建设的必要性； 技改项目或引进技术，设备项目说明技术差距及引进理由。 2****、项目建设意义 初步分析项目对地区，行业，企业发展影响，对国名经济效益，和社会效益影响。 三、产品方案，拟建规模 1****、产品市场初步预测 初步论述产品方案是否符合国家产业政策，技术政策。 初步分析产品生产量及市场需求量，销售情况，进出口情况，项目目标销售市场等。 2****、拟建规模和产品方案 拟建项目的产品品种，规格和产量； 分期建设设想（技改项目需说明原有生产能力及条件）。 四、工艺技术及设备 1****、工艺技术及生产流程 简述可选择的工艺技术，技术来源，初步分析七特点（先进性，成熟性。可靠性等）； 初步选择的工艺流程。 2****、工艺设备 说明项目需求设备的名称，规格，数量，制造厂商； 引进设备需说明引进的理由，引进设备名称，技术水平，规格，数量，进口国别厂商的初步考虑。 五、资源（原辅材料），建设条件，协作条件 1****、资源及主要原辅材料，燃料 简述资源供给的可能性和可靠性（如不涉及资源的作用，可略）； 主要原辅材料，燃料需求种类，规格，年需求量及来源； 2****、建设条件及厂址选择 建设地点区位条件及厂址的初步选择 l 建设地点自然条件，社会经济条件，交通运输条件； l 项目建设地点水电及其他公用设施条件； l 项目建设地点协作条件 附：厂址区域位置图和厂址初步方案示意图 老厂技改项目，应简要说明老厂的总图布置，拟安排项目在厂内的位置，老厂可提供项目建设的有利条件。 3****、协作条件 六、工程方案 1****、土建 土建初步方案（征地方案，占地面积，建筑面积主要建筑物结构考虑） 2****、公用工程 项目对水，电。汽等公用工程需求量，解决方案； 老厂技改项目说明应说明企业原有公用工程能力，富余量，技改中心对公用工程扩容的打算； 3****、辅助设施 辅助设施（仓库，运输，机修，试验中心，生活设施等）建设方案。 七、生态环境影响初步分析 1****、环境保护 （1） 项目建设地区环境质量现状。 （2） 拟建项目对环境影响预测。 说明项目生产中废气，废水，废渣，噪声的等污染物产生情况，预测对环境的影响。 （3） 项目“三同时”措施 拟建项目用的治理工艺及装置及预计效果。 2****、劳动保护与安全卫生 职业安全卫生防护措施。 3****、消防 项目特征及消防要求。 八、项目筹建计划及进度安排 1．工厂组织和管理机构设置打算 2．可行性研究计划 3．项目实施进度安排 九、投资估算和资金筹措 1****、总投资估算 1）固定资产投资总额估算 （1）固定资产投资估算编制的范围及依据。 简述项目建设性质，规模。 固定资产投资估算依据，范围。 明确估算中包括及不包括的投资内容及费用。 （2）固定资产投资内容及说明 固定资产投资按照费用性质，划分为建筑工程费，设备购置费。安装工程费，工程建设其他费用，预备费，固定资产投资方向调节税，建设期贷款利息等费用并分别予以说明估算依据 说明投资估算所选用的定额，设备购置，材料价格依据，以及各项费用的取费标准，依据或计算规定文件依据。 预备费，项目费包括基本预备费包括基本预备费和涨价预备费，基本预备费按行业规定计算，一般为5—10%。涨价预备费按国家计委《关于加强对基本建设大中型项目概算中“价差预备费”管理有关问题的通知》（计投资[1999]1340号）精神，投资价格指数按零计算。 说明估算中存在的问题及其他有关事项。 （3）固定资产投资方向调节税，说明项目性质，适应的税率及征税范围。按财政部，国家税务总局，国家发展计划委员会《关于暂停征收固定资产投资方向调节税的通知》（财税学）[1999]299号）规定，自2000年1月1日起新发生的投资额，暂停征收固定资产投资方向调节税。 （4）建设期借款利息 （5）固定资产投资总额 固定资产投资总额一般由固定资产投资，建设期利息两部分组成。 改建项目与企业已有生产经营活动，存在错综复杂的联系，因此。企业已有固定资产。凡继续使用的，一般采用账面减值或采取重估办法确定其原值和净值。继续使用的固定资产说明其资产名称，使用（折旧）年限，原值，净值。 2）流动资金估算 流动资金估算一般应采用分项详细法估算，遇特殊情况也可以采用扩大指标估算方法估算，采用分项详细估算方法估算流动资金时，应说明各项流动资产和流动负责的最低周转天数及其他依据。 3）项目总资金和总投资 项目总资金有固定资产投资总额和全部流动资金两部分组成。 项目总投资由固定资产投资总额和铺底流动资金两部分组成，铺底流动资金按项目正常流动资金的30%计算。 2****、资金筹措 1）融资方案 （1）固定资产投资资金来源 项目资本金，就资本金不同来源简要说明资本金金额，来源及其可靠性。 负债融资，简要说明负债融资的金额，来源，可靠性及其负债条件。 （2）流动资金来源 资本金，可用作项目铺底流动资金。 负债融资，说明流动资金贷款渠道，金额及贷款条件。 2）资金使用情况 （1）说明固定资产投资逐年资金筹措额和安排使用计划。 流动资金各年投入情况。 十、财务评价 1****、总成本费用估算 1）总成本费用估算方法、范围及说明 （1）总成本费用估算方法及范围。是按生产费用要素计算总成本费用还是按制造成本为基础计算总成本费用。 （2）总成本估算基本数据，说明项目计算期、建设期、投产期、达产期及生产期产品生产销售计划。 2）总成本费用估算依据说明 （1）原辅材料、燃料动力、包装物消耗定额、年耗用量及价格。 （2）人工工资、福利费估算依据。 （3）固定资产折旧方法、折旧年限、残值率、无形资产及递延资产摊销年限说明。固定资产折旧一般应采用分类直线折旧。 （4）修理费估算依据。 （5）销售费用估算衣服。 （6）其他费用：指制造费用、管理费用、财务费用和销售费用中扣除工资及福利、修理费、摊销费、利息支出后的费用。分别逐项说明其他费用内容、估算方法及取值依据。 （7）财务费用：财务费用由固定资产投资长期借款利息和流动资金借款利息两部分组成。 3）年总成本费用、经营成本、固定成本及可变成本的估算。 计算正常年总成本费用、年经营成本、年固定成本、年可变成本，说明总成本费用构成。 注：技术改造项目应就“有项目”“无项目”分别说明总成本费用估算依据，并计算增量指标。 2****、财务评价 1）年销售收入、销售税金及附加估算 （1）说明项目生产经营期各年各产品的生产销售量、销售价格（含增值税）。计算各年销售收入。 （2）说明项目生产经营期发生的消费税、营业税、资源税、城乡维护建设税和教育费附加计算方法及比率，计算销售税金及附加。 （3）按现行税法规定，产品销售税金及附加中不包含增值税。根据《方法与参数》（第二版），为方便计算，项目财务效益分析中将增值税与销售税金一并计算。 2）利润总额及分配 （1）正常年利润总额估算。 （2）所得税税率，法定公积金、法定公积金提取比例。 3）财务盈利能力分析 （1）静态指标 投资利润率 投资利税率 资本金净利润率 财务内部收益率（FIRR）。全部投资税前，前部投资税后。 财务净现值（FNPV）。全部投资税前，全部投资税后。 投资回收期。全部投资税前，全部投资税后。 列表说明全部投资税前和所得税后财务内部收益率、财务净现值、投资回收期。 4）清偿能力分析 固定资产投资借款还期计算应分资金渠道分别计算并说明还款期限及还款方式。外国政府贷款计算偿贷比。 3****、不确定性分析 1）盈亏平衡分析 计算正常生产年生产能力利用率表示的盈亏平衡点，并说明生产能力利用率变化的项目风险。 2）敏感性分析 对固定资产投资、销售收入、经营成本、生产负荷对项目财务效益进行敏感性分析，分析敏感性因素变化的项目风险。 4****、财务评价结论 1）财务评价结果汇总 以列表形式将主要经济数据经济评价指标进行汇总。 2）财务评价结论 从总投资、资金来源、财务指标、项目风险等方面对项目财务评价指标做出简要结论。 附表： 辅助报表1 固定资产投资估算表 辅助报表2 流动资金估算表 辅助报表3 投资使用计划于资金筹措表 辅助报表4 固定资产折旧无形资产与递延资产摊销估算表 辅助报表5 总成本费用估算表 辅助报表6 销售收入、销售税金及附加资产摊销估算表 辅助报表7 固定资产投资几款还本付息表 基本报表1 财务现金流量表（全部投资） 基本报表2 损益表 基本报表3 资金来源与运用表 总体感觉要求的内容已经灰常的细了，再此分享一下。","tags":[{"name":"可行性研究","slug":"可行性研究","permalink":"http://7086.site/tags/%E5%8F%AF%E8%A1%8C%E6%80%A7%E7%A0%94%E7%A9%B6/"}]},{"title":"office 2010公式编辑器字体设置","date":"2013-10-23T13:32:27.000Z","path":"posts/52148.html","text":"我们经常需要用到在word文档中插入一个公式，博主使用的当然是最好用的office2010，相比于2003，10插入公式有两种方式： 1、Microsoft 公式3.0 保存格式为doc兼容模式的情况下，10仅可以通过插入–对象–公式编辑器3.0插入公式，此时与2003采用的是同一个编辑器，样式如下： 我们假定需要把公式编辑器中的字体修改成Times New Roman 字体： 具体操作如下： 打开后界面如下，样式勾选文字的情况下，我们选择 样式–自定义，打开如下： 在第一行文字，选择字体，正常来说我们勾选倾斜。此时设置完毕。 2、office2010自带公式编辑器 首先说明，Word2010公式的默认字体是Cambria Math，该字体是Word2010中惟一完全支持“公式编辑器”中所有数学符号的字体，因此如果没有特殊要求，建议使用该默认字体。 我们依然假定需要把公式编辑器中的字体修改成Times New Roman 字体： 我们会发现输入公式后，word可以直接选中并修改字体，但是却不能成功，字体仍然为Cambria Math，修改失败，博主研究了一番，最终发现，原来只要选中公式，并修改为普通文本后，才可以正常修改字体，如下图： 至此，office 2010公式编辑器字体设置完美解决。","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"wordpress插入背景音乐与文章音乐的选择方案","date":"2013-10-22T05:56:00.000Z","path":"posts/29507.html","text":"前一段时间在研究怎么在博客首页及文章中插入背景音乐，在网上搜罗了一大圈，在此就做个简单的总结： 一、侧边栏音乐 就我个人而言，我更倾向于在博客首页加一个像小工具一样的音乐列表，当然不是每个选择方案都可以形成列表的，下面4种方案比较可行： 1、插件：flash-mp3-player.10.1.9 这款播放器除了是插件外，也是个widget，你可以在后台管理-&gt;外观-&gt;小工具中拖动此插件到右侧，以使得此播放器能显示在页面右侧中。 下载地址： http://wordpress.org/extend/plugins/flash-mp3-player/ 下载后也是解压至插件目录，然后激活，激活后在后台管理的设置可以对此插件进行设置，分别是： Settings/FMP、Settings/FMP，其中Settings/FMP是设置是否显示播放面板、字体颜色、以及播放器背景图片等等，背景图片插件自带一张图片，但建议将此背景只为空，另外你可以新建一个配置文件，此配置文件是一个XML格式的文件，你上传的音乐信息都会以一定的格式保存在文件中，但建议选择默认文件就够了 Settings/FMP中可以添加你的音乐链接，值得说明的是，各音乐位置之间是可以上下移动的，这点非常地不错！ 最后在后台管理-&gt;外观-&gt;小工具中拖动此插件到右侧，拖动后可以设置播放器宽高、XML文件等信息，一般除了宽高外，其他都可以不动。 这一款插件博主之前在用，但是后来还是放弃了，因为发生过列表丢失的现象，我看网上评价很高，建议优先选择这个尝试下吧，功能比较强大。 界面如图： 2、虾米音乐 吓米音乐易用性灰常高，注册一个号，可以直接把列表生成html代码，能过小工具中的文本放入侧边栏，可以对颜色等进行设置，个人感觉易用性高，唯一不足的是博主感觉音质不是很好，不能自定义歌曲地址，对于没有这个要求的同学，那一定是首选了。 下载地址：http://www.kuaipan.cn/file/id_12878021350456951.htm 3、抽屉音乐 抽屉音乐，下载地址：http://www.chouti.com/service/outputMp3.htm 这个我的博客正在用，主要优点就是更新歌曲不需要再次修改代码，注册个账号后，可以直接添加歌曲，虽然添加歌曲的界面让人匪夷所思。缺点就是不能改变歌曲的顺序，默认后添加的在最前。 试试就知道。播放界面见下图： 4、豆瓣音乐 网上搜罗的，代码如下： 提醒：用时替换掉MP3地址，同时，加入文章时需要以代码形式加入。 小工具截图： src：媒体文件地址。 autostart：是否自动播放，true为自动，false为手动。 loop：是否循环，true为循环，false只播放一次，也可直接设置数字，2表示播放2次，同理。 width：播放界面的宽度，一般在300到500之间最好。 height：播放界面的高度。根据视频、音频来定（音频时此值不必设太大）。 hidden：是否隐藏播放界面，true为不可见，false表示可见。 二、文章中音乐 可以选择上前文介绍4款音乐解决方案，当然对插入文中的音乐，还有其它更多的更好的解决方案： 1、Audio Player 下载地址：http://wordpress.org/plugins/audio-player/ 这个插件值得注意的是要设置一个默认音频目录的效验，其实就是检测下音频文件的默认搜索位置是否存在。当我们使用 [audio] 语法在日志或者页面里插入音乐的时候，如果没有提供 mp3 文件的绝对 URL （包含 “http://” 的完整 URL），Audio Player 会在这个目录中查找相关文件。默认音频目录的效验就是让你给Audio Player 指定一个有效的目录以便它进行查找，通常情况下Audio Player 会默认选择网站根目录下的 audio 文件夹，但是一般情况下我们没有建立audio文件夹，所以它是无效的，你在进行效验的时候则会显示：未找到音频目录。请检查您的服务器上是否存在下列目录，所以我们需要指定一个存在的目录，或者你可以直接使用根目录。 WordPress音乐播放插件：Audio Player 使用： 一般情况下，建议HTML编辑模式下添加代码，代码范例如图： 2、 Dewplayer 这款播放器的样式如图（截图，别点）： 下载地址： http://wordpress.org/extend/plugins/dewplayer-flash-mp3-player/ 下载后解压至插件目录，然后激活，在后台设置中进行设置，可以设置此播放器的显示样式、歌曲是否循环播放、是否自动播放等等，非常简单。 播放器可以插入到文章页面中，只需插入如下代码即可： [ dewplayer:http://www.hbgzz.com.com/mysong.mp3\\] 或多首歌曲： [ dewplayer:song1.mp3song2.mp3song3.mp3] 多首歌曲间以分隔。 注：将[后的空格全部去掉 不过此播放器不能像widget那样通过拖动放在页面的右侧等位置。 3、XiamiPlayer for WordPress 说明：XiamiPlayer 虾米Html5和Flash播放器 使用方法：登陆 WordPress 后台 》插件 》安装插件 》上传，把下载的 xiamiplayer for wordpress 1.0.0.zip 上传，然后激活就OK了 插件设置: 登陆 WordPress 后台 》设置 》安装插件 》XiamiPlayer 设置，来设置js、css加入位置。 播放界面截图： 综上所述， 大家选择自己最喜欢的音乐样式吧。","tags":[{"name":"插件","slug":"插件","permalink":"http://7086.site/tags/%E6%8F%92%E4%BB%B6/"}]},{"title":"最强大的PDF文字识别软件","date":"2013-10-20T07:07:28.000Z","path":"posts/12634.html","text":"办公时，我们经常会遇到把扫描版的pdf文件或图片转换成可编辑的文字，这类软件比较优秀的有pdf OCR 、汉王OCR、CAJ等，CAJ算是识别度比较高的了，但是对pdf支持不是太好，而且只能一段一段的识别，对于识别量较大时，反而比较麻烦了，汉王OCR的操作体验不是很好。 今天博主给大家介绍的是重量给的pdf全能软件，同时包含精准的文字识别功能 软件名：adobe acrobat x1 pro 软件功能当然十分强大，最重要的是，文本识别时，可以直接进行一键识别，识别后可以在pdf上直接对文字进行选中： 当然，更简单的是可以直接将文档另存为word文档，只要原始文档的清晰度不是太模糊，效果真的好过你的想象。 软件下载地址，可以点我adobe acrobat x1 pro及破解教程，按教程破解，问题不大。 下载密码：wlbz","tags":[{"name":"文字识别","slug":"文字识别","permalink":"http://7086.site/tags/%E6%96%87%E5%AD%97%E8%AF%86%E5%88%AB/"}]},{"title":"插入u盘或运行某个程序后，桌面图标突然不见解决办法","date":"2013-10-17T09:19:24.000Z","path":"posts/34875.html","text":"插入u盘或运行某个程序后，桌面图标有时会消失，今天博主给大家介绍个小方法，不用重启找回桌面： 图标消失界面如下图： 我们能过右击任务栏，打开资源管理器： 我们要找到explorer.exe进程，我们点击结束进程，然后会发现任务栏消失，没有关系，我们通过点文件、创建新任务，如下图： 能过浏览找到explorer.exe文件，然后点击确定，桌面成功找回！！！","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://7086.site/tags/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"}]},{"title":"编辑cad转换的pdf文件，扣出高清底图","date":"2013-10-16T11:21:32.000Z","path":"posts/33202.html","text":"在日常工作中，我们经常遇到需要把一个pdf文件，转换成图片。 如果这个pdf是由cad转换而来，如果我们需要的图片是这个文件的底图，我们应该如何操作？ 通常的办法，是先截图，然后用ps处理一下，但是当这个图片ps处理工程量浩大时，我们其实还可以用更简单的方法：、 这是我的原图： 一条长长的红线，我们如果用ps处理的画，可能要浪费不少时间。 博主今天为大家介绍一款软件，那就是福昕PDF套件高级编辑器 这个编辑器大家可能有人用过，可以满足我们的要求，但凡是通过cad添加在图片上的元素，我们都可以选中，然后删除。 软件下载密码：vdgcCU","tags":[{"name":"cad","slug":"cad","permalink":"http://7086.site/tags/cad/"}]},{"title":"Wordpress默认编辑器的增强代码","date":"2013-10-14T06:38:30.000Z","path":"posts/26603.html","text":"找到你正在使用的那个主题的模版函数文件（也就是functions.php这个文件），在其中加入下面这段代码： //增强编辑器开始 function add_editor_buttons($buttons) { $buttons[] = ‘fontselect’; $buttons[] = ‘fontsizeselect’; $buttons[] = ‘cleanup’; $buttons[] = ‘styleselect’; $buttons[] = ‘hr’; $buttons[] = ‘del’; $buttons[] = ‘sub’; $buttons[] = ‘sup’; $buttons[] = ‘copy’; $buttons[] = ‘paste’; $buttons[] = ‘cut’; $buttons[] = ‘undo’; $buttons[] = ‘image’; $buttons[] = ‘anchor’; $buttons[] = ‘backcolor’; $buttons[] = ‘wp_page’; $buttons[] = ‘charmap’; return $buttons; } add_filter(“mce_buttons_3”, “add_editor_buttons”); //增强编辑器结束 在开始前编辑框： 代码插入后： 附上搜集的按钮调用的Key： 1.剪切（cut）复制（copy）粘贴（paste）撤销（undo）重做（redo）居中（justifycenter） 2.加粗（bold）斜体（italic）左对齐（justifyleft）右对齐（justfyright） 3.两端对齐（justfyfull）插入超链接（link）取消超链接（unlink）插入图片（image） 4.清除格式（removeformat）下划线（underline）删除线（strikethrough） 5.锚文本（anchor）新建文本（newdocument） 6.字体颜色（forecolor）字体背景色（backcolor） 7.格式选择（formmatselect）字体选择（fontselect）字号选择（fontsizeselect） 8.样式选择（styleselect）无序列表（bullist）编号列表（numlist） 9.减少缩进（outdent）缩进（indent）帮助（wp_help） 10打开HTML代码编辑器（code）水平线（hr）清除冗余代码（cleanup） 11.上标（sub）下标（sup）特殊符号（charmap）插入more标签（wp_more） 12.插入分页标签（wp_page） 13.隐藏按钮显示开关（wp_adv） 14.隐藏按钮区起始部分（wp_adv_start） 15.隐藏按钮区结束部分（wp_adv_end） 16.拼写检查（spellchecker）","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"开word文档时出现'无效的加载项模版'错误标签解决办法","date":"2013-10-13T08:29:20.000Z","path":"posts/33208.html","text":"1、打开时命令无法执行。单击“确定”，然后关闭对话框以继续。 2、无效的加载项模版。（C:…STARTUP~$werword.dot） 解决办法： 打开word打开word－工具－选项－文件位置 将“启动”项改为word的安装位置就可以了.如 C:Documents and SettingsAdministratorApplication DataMicrosoftWord 如果上面方法没有成功，就删除C:Documents and SettingsAdministratorApplication DataMicrosoftWordSTARTUP下面的所有文件，再从C:Documents and SettingsAdministratorApplication DataMicrosofttemplates下拷贝normal.dot到C:Documents and SettingsAdministratorApplication DataMicrosoftWordSTARTUP 3、将 C:Documents and Settings用户名Application DataMicrosoftWordSTARTUP下 对应的无效模板的文件删除即可。","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"Word文档“内存或磁盘空间不足,保存失败”解决方案","date":"2013-10-11T06:46:12.000Z","path":"posts/19120.html","text":"word有时会出现如下的情况： 正常情况下有以下几种解决方案： 1、清理系统垃圾：通过360清理文件的工具对系统进行了清理； 2、禁止启动项：利用msconfig对系统启动项进行了一些未知项进行禁止； 3、查看其他：看电脑系统时间显示的非正常时间，自行修改不能改，利用相关工作对系统时间进行了设置，改为正常时间。 4、重启电脑：最后，通过重启电脑，进行word操作，看看是否可以保存了？","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"豆丁、百度、道客巴巴文档下载器","date":"2013-10-10T04:41:44.000Z","path":"posts/31786.html","text":"对于下载豆丁文档，个人建议，要求比较高的，需要下载原word文档的同学，可以去淘宝购买，1个豆是一毛钱，当然也可以用下载器，只不过下的是pdf文档，有水印的。 下载器地址： http://www.kuaipan.cn/file/id_12878021350455700.htm 密码：r4PLV7Hm 对于下载百度文库的文档，现在要容易的多，注册个账号每天都有送金币 或到这个地址去免费下载：http://www.haiwenku.com/wenku.html，当然这个有限制，要求不高的同学，也可以用上面的冰点下载器下载。 对于下载道客巴巴文档，需要用到下面的神器了，下载地址： http://www.kuaipan.cn/file/id_12878021350427868.htm 密码：Urn2Le2F","tags":[{"name":"下载器","slug":"下载器","permalink":"http://7086.site/tags/%E4%B8%8B%E8%BD%BD%E5%99%A8/"}]},{"title":"windows正在设置MIcrosoft Office Professional Plus 2010 解决办法","date":"2013-10-09T04:17:04.000Z","path":"posts/38513.html","text":"windows正在设置MIcrosoft Office Professional Plus 2010 ，导致打不到word文档，如下图： 按上面提示，我们只需要找到安装包中proplusww.msi文件即可。 我们只要需要解压原安装包，这个文件在安装包中的ProPlus.WW目录下，通过浏览找到这个msi，然后点确定即可以修复word了。","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"WORD利用宏一次性选中文档中所有表格","date":"2013-10-08T02:42:14.000Z","path":"posts/27050.html","text":"做文档时， 我们经常要改变文本中所有表格的格式，如边框加粗等，如果文档是几百页的大文档，表格又较多，手动则比较麻烦了，今天博主为大家推荐一个好方法，那就是利用宏： ALT+F8，打开宏对话框，创建名为SelectAllTables的宏，代码如下： Sub SelectAllTables() Dim tempTable As Table Application.ScreenUpdating = False ‘判断文档是否被保护 If ActiveDocument.ProtectionType = wdAllowOnlyFormFields Then MsgBox “文档已保护，此时不能选中多个表格！” Exit Sub End If ‘删除所有可编辑的区域 ActiveDocument.DeleteAllEditableRanges wdEditorEveryone ‘添加可编辑区域 For Each tempTable In ActiveDocument.Tables tempTable.Range.Editors.Add wdEditorEveryone Next ‘选中所有可编辑区域 ActiveDocument.SelectAllEditableRanges wdEditorEveryone ‘删除所有可编辑的区域 ActiveDocument.DeleteAllEditableRanges wdEditorEveryone Application.ScreenUpdating = True End Sub 可能上面的格式有点问题，代码下载如下：自动选中表格宏代码 好了，下面再通过ALT+F8，运行创建的宏就可以了，是不是所有的表格都被选中了呢？","tags":[{"name":"word","slug":"word","permalink":"http://7086.site/tags/word/"}]},{"title":"一般工业固体废物与危险废物贮存、处置场址与人群距离的确定要求","date":"2013-10-08T01:53:01.000Z","path":"posts/21418.html","text":"关于发布《一般工业固体废物贮存、处置场污染控制标准》（GB18599- 2001）等3项国家污染物控制标准修改单的公告 为贯彻《中华人民共和国环境保护法》和《中华人民共和国固体废物污染环境防治法》，防治污染，保护和改善生态环境，保障人体健康，完善国家环保标准体系，我部决定对《一般工业固体废物贮存、处置场污染控制标准》（GB 18599-2001）、《危险废物贮存污染控制标准》（GB 18597-2001）和《危险废物填埋污染控制标准》（GB 18598-2001）等3项国家污染物控制标准进行修改完善，制定了上述3项标准修改单，并由我部与国家质量监督检验检疫总局联合发布。 该标准修改单自发布之日起实施。 该标准修改单由中国环境科学出版社出版，标准内容可在环境保护部网站（bz.mep.gov.cn）查询。 特此公告。 (此公告业经国家质量监督检验检疫总局陈钢会签) 环境保护部 2013年6月8日 附件： 《一般工业固体废物贮存、处置场污染控制标准》（GB18599- 2001）等3项国家污染物控制标准修改单 为进一步完善国家污染物排放（控制）标准体系，我部决定修改《一般工业固体废物贮存、处置场污染控制标准》（GB 18599-2001）、《危险废物贮存污染控制标准》（GB 18597-2001）和《危险废物填埋污染控制标准》（GB 18598-2001）等3项国家污染物控制标准，修改内容如下： 一、《一般工业固体废物贮存、处置场污染控制标准》（GB 18599-2001）第5.1.2条修改为： 应依据环境影响评价结论确定场址的位置及其与周围人群的距离，并经具有审批权的环境保护行政主管部门批准，并可作为规划控制的依据。 在对一般工业固体废物贮存、处置场场址进行环境影响评价时，应重点考虑一般工业固体废物贮存、处置场产生的渗滤液以及粉尘等大气污染物等因素，根据其所在地区的环境功能区类别，综合评价其对周围环境、居住人群的身体健康、日常生活和生产活动的影响，确定其与常住居民居住场所、农用地、地表水体、高速公路、交通主干道（国道或省道）、铁路、飞机场、军事基地等敏感对象之间合理的位置关系。 二、《危险废物贮存污染控制标准》（GB 18597-2001）第6.1.3条修改为： 应依据环境影响评价结论确定危险废物集中贮存设施的位置及其与周围人群的距离，并经具有审批权的环境保护行政主管部门批准，并可作为规划控制的依据。 在对危险废物集中贮存设施场址进行环境影响评价时，应重点考虑危险废物集中贮存设施可能产生的有害物质泄漏、大气污染物（含恶臭物质）的产生与扩散以及可能的事故风险等因素，根据其所在地区的环境功能区类别，综合评价其对周围环境、居住人群的身体健康、日常生活和生产活动的影响，确定危险废物集中贮存设施与常住居民居住场所、农用地、地表水体以及其他敏感对象之间合理的位置关系。 三、《危险废物填埋污染控制标准》（GB 18598-2001）第4.4条、第4.5条、第4.7条合并为一条，内容修改为： 危险废物填埋场场址的位置及与周围人群的距离应依据环境影响评价结论确定，并经具有审批权的环境保护行政主管部门批准，并可作为规划控制的依据。 在对危险废物填埋场场址进行环境影响评价时，应重点考虑危险废物填埋场渗滤液可能产生的风险、填埋场结构及防渗层长期安全性及其由此造成的渗漏风险等因素，根据其所在地区的环境功能区类别，结合该地区的长期发展规划和填埋场的设计寿命，重点评价其对周围地下水环境、居住人群的身体健康、日常生活和生产活动的长期影响，确定其与常住居民居住场所、农用地、地表水体以及其他敏感对象之间合理的位置关系。","tags":[{"name":"固体废物","slug":"固体废物","permalink":"http://7086.site/tags/%E5%9B%BA%E4%BD%93%E5%BA%9F%E7%89%A9/"}]},{"title":"关于新建公路、铁路项目噪声评价量的确定。","date":"2013-09-25T10:26:49.000Z","path":"posts/60625.html","text":"","tags":[{"name":"环评","slug":"环评","permalink":"http://7086.site/tags/%E7%8E%AF%E8%AF%84/"}]},{"title":"wordpress如何设置文章置顶","date":"2013-09-25T08:12:04.000Z","path":"posts/57966.html","text":"很多博客都有自己的置顶文章，在默认情况下WP对置顶文章只是将它们的位置排在前面，除了位置差异外，跟其他文章是没有任何区别的。那我们怎样才能将它们区别开来呢？我这里有几种方法： 一、在WordPress****中如何设置文章置顶 相信很多朋友都还不知道WordPress本身就有置顶文章的功能，而苦苦地去寻找插件来实现置顶功能，真是浪费，我觉得有必要再说明一下怎么置顶文章。WordPress中设置文章置顶很简单，打开文章编辑页，右边栏的公布栏目即可设置，如图： 二、在标题处添加置顶字样 其实我们这篇文章要用到的函数也只有一个is_sticky()，这个函数用于判断该文章是否为置顶文章。置顶文章一般也只在首页显示，那现在就打开你的主题目录下的index.php，查找：the_title(); 然后将其改成： 复制代码 代码如下: the_title(); if( is_sticky() ) echo ‘&nbsp;&nbsp;置顶‘; 三、置顶文章不显示文章摘要 同样是打开index.php，查找：the_content 或 the_excerpt，给它添加一个判断，这样置顶文章就不显示摘要了，如： 复制代码 代码如下: if( !is_sticky() ) the_content(….); 或 复制代码 代码如下: if( !is_sticky() ) the_excerpt(….); 四、给置顶文章添加边框或背景等 这个方法不需要判断是否为置顶文章，我们只需给它添加一个CSS样式即可。打开主题目录下的index.php，找到每篇文章所在的div，一般的主题查找：class=”post” 这个div就是每篇文章所在的div了，我们现在给个这个div添加一个类，如将 改成（可将以下代码中的class=”post”去除）： 复制代码 代码如下: 如果是置顶文章，会自动给这个div添加一个类.sticky，我们现在打开主题目录下的style.css，添加类属性： 复制代码 代码如下: .sticky { background: #ff0000; border: 1px solid #ccc; } 这样，置顶文章就有了背景和边框，是不是很难看呢？你可以根据需要修改这个类属性，获得你满意的效果。","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"修改WordPress 地址URL错误导致进不了后台","date":"2013-09-24T11:24:45.000Z","path":"posts/34420.html","text":"修改WordPress 地址（URL）、站点地址（URL）方法： 已经转移空间换域名的时候也遇到过这种情况，进Mysql修改数据表“wp_options”中的siteurl和home，或者执行SQL命令修改 UPDATE wp_options SET option_value = replace(option_value, ‘http://要修改的URL1’,’http://修改后的URL2’) WHERE option_name = ‘home’ OR option_name = ‘siteurl’; 上面SQL命令的意思就是：讲URL1修改成URL2 执行后即可。 以后大家转空间的时候可能会遇到一样或者类似的问题，用上面的方法，可以解决。","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"如何把gif的头像换掉","date":"2013-09-24T02:59:54.000Z","path":"posts/5035.html","text":"网上找了很多方法，发现都比较麻烦，比如用photoshop，利用钢笔工具抠图，然后复制到另一幅图上 如果动态的gif替换头像，就要一张张对准位置，很麻烦 博主推荐的工具是ulead gif animator 5 具体的操作步骤是，打开你想编辑的gif，然后再添加图像（准备换成的头像），我们发现工具烂那一竖排有套索等选择工具，我们只 需要圈一下我们将换成的头像，然后ctrl+c ，假如原来的gif有10张图，我们只需要依次切换过去，按下ctrl+v，正常来说不需要调 整就可以了。然后另存为gif吧，当然这软件还可以缩小gif分辨率、改变gif大小，对于diy QQ表情实在是个好东西。 下载地址：ulead gif animator 5绿化版。","tags":[{"name":"gif","slug":"gif","permalink":"http://7086.site/tags/gif/"}]},{"title":"WordPress搬家教程：换空间与换域名","date":"2013-09-23T15:56:14.000Z","path":"posts/13298.html","text":"大体上来说搬家分为三步： 一、备份博客网站文件和数据库； 二、把网站文件传到新空间，在新空间导入数据库； 三、修改网站配置和数据库； 四、检查转移结果。 WordPress博客搬家的几种情况： 1. 换主机不换域名 2. 换域名不换主机 3. 换域名也换主机 第一步：备份博客网站文件和数据库 1.在原来的空间中把博客文件下载备份。要是原来空间支持在线解压缩，建议打包下载，这样下载大小变小了，时间也会节省很多。（本人基本时有什么文章更新，就用FTP同步备份到本地的，大家最好也有这个习惯，不然突然而来的事故会让追悔莫及！） 2.备份数据库。可以通过phpadmin，帝国备份王，或者WP-DBManager这样的数据库备份插件，您可以选择您会的，熟悉的一种方式来做。（建议对于sql，gz，zip多种格式尽量都备份一下，你不知道下一个主机会支持哪种） 第二步：上传博客文件，导入数据库 1.把博客文件用FTP传到新空间，和下载一样，要是新空间支持在线解压缩，建议打包上传，这样时间节省了很多，流量也能节省一部分。（WordPress目录是public_html/下，所以只要把之前在public_html/目录下的文件，上传到新主机的public_html/下即可。） 2.导入数据库.PHPMyAdmin，帝国备份王都可以做到。（你需要在新主机内创建一个数据库，然后将你之前导出的数据库，导入即可） 如图： 第三步：修改网站配置和数据库（关键） 1.修改wp-config文件，最好不要用记事本来修改，用notepad++或者UltraEdit等编辑器，把里面的数据库信息改为您新空间的数据库信息，如下： /** WordPress 数据库的名称 */ define(‘DB_NAME’, ‘你的新空间数据库名称’); /** MySQL 数据库用户名 */ define(‘DB_USER’, ‘你的数据库用户名’); /** MySQL 数据库密码 */ define(‘DB_PASSWORD’, ‘你的数据库登录密码’); /** MySQL 主机 */ define(‘DB_HOST’, ‘你的数据库地址’); 将你新的主机空间的数据库名称，数据库用户名和密码填进去即可。注意一下，MySQL主机这一项默认是’localhost’，如果你的是Windows主机，不用修改，如果是Linux主机，可能需要填上数据库的地址。 2. 进入新空间的phpadmin修改数据库：修改数据库表wp_options里的“siteurl”和“home”字段的值，改为你的新域名； 3.把用的域名解析到空间后，登录你wp后台，修改你blog的地址为你新的域名。 4.原来的文章里有链接或者图片是用以前域名的地址，所以还要修改那些地址。可以在phpadmin直接修改数据库或者velvet-blues-update-urls这个插件（推荐）。比如在phpadmin里，执行执行以下语句： UPDATE wp_options SET option_value = REPLACE(option_value,’旧地址’,’新地址’); UPDATE wp_posts SET post_content = replace(post_content,’旧地址’,’新地址’); UPDATE wp_posts SET post_excerpt= replace(post_excerpt,’旧地址’,’新地址’); UPDATE wp_posts SET guid= replace(guid, ‘旧地址’,’新地址’); 第四步：检查转移结果，按照以上做了一般就完好的搬家成功了。 看看你的Blog，恭喜您成功搬家！","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"大气环境防护距离与卫生防护距离","date":"2013-09-22T05:39:21.000Z","path":"posts/23136.html","text":"2008年下半年，在最后几次导则汇报与讨论会上，环境保护部环评司的领导提出要加入环境防护距离的管理要求和相关定义。虽然到现在为止，导则-总纲的正式版还没推出，这次修订版大气导则中率先提出了大气环境防护距离的定义和管理要求。 提出和规范大气环境防护距离的用意很明显，就是建立环保系统内的管理要求，以取代原有卫生部提出的卫生防护距离的概念。虽然这次定义和原来卫生防护距离很接近，包括对源的处理方法和管理要求，但还是有一些不同的地方，这些也是最近被咨询的比较多的地方： 1、计算大气环境防护距离，直接采用修订版大气导则的推荐模式进行计算即可。不需要考虑原来所涉及的提级、叠加周围点源的综合影响，也不考虑污染物的毒性。 2、注意这次大气环境防护距离的计算结果是以面源为中心的距离，然后以此为半径画圆，只有超出厂届以外区域才定义为项目的大气环境防护区域。注意最终是一个区域的概念，应该结合包络线来表达。原来习惯定义的场界外多少多少米作为卫生防护距离是不太科学的。 关于两个防护距离的执行，注意以下几个具体要求： 1、现行国家标准中尚有效的各行业卫生防护距离标准，首先应执行该卫生防护距离标准。在环评中可参考环境防护距离计算出一个结果，但只作为参考。 2、对于没有相关的行业卫生防护距离标准的，不必再采用原有91年的卫生防护距离公式进行计算。直接计算大气环境防护距离即可。 3、对于计算结果为没有超标的无组织排放源，不用再设置防护距离。 4、设置环境防护距离的前提是，无组织排放源场界监控点处排放达标。 最后转一个人的询问邮件：“关于进一步加强生物质发电项目环境影响评价管理工作的通知》中提及“6、环境防护距离 根据正常工况下产生恶臭污染物（氨、硫化氢、甲硫醇、臭气等）无组织排放源强计算的结果并适当考虑环境风险评价结论，提出合理的环境防护距离，作为项目与周围居民区以及学校、医院等公共设施的控制间距，作为规划控制的依据。新改扩建项目环境防护距离不得小于300米。”该通知是在新大气导则出台之前颁布的，按照以往计算卫生防护距离的要求，防护距离是从无组织排放的污染源边界开始计算，请问该通知中要求的300米的环境防护距离应从哪里开始计算。” 我的答复是，对于这些尚未失效的管理性的文件，仍应注意执行。同时，在环评中可参考环境防护距离计算出一个结果，但只作为参考。 从文字要求理解，该通知要求的300米的环境防护距离应从项目场界处开始计算。 排放达标是指无组织源排放达到排放标准。 计算结果超标指的是超过环境质量标准。","tags":[{"name":"环评","slug":"环评","permalink":"http://7086.site/tags/%E7%8E%AF%E8%AF%84/"}]},{"title":"洗煤厂工艺流程","date":"2013-09-22T05:37:22.000Z","path":"posts/27435.html","text":"洗煤厂工艺流程 煤炭加工、矸石处理、材料和设备输送等构成了矿井地面系统。其中地面煤炭加工系统由受煤、筛分、破碎、选美、储存、装车等主要环节构成。是矿井地面生产的主体。 受煤是在井口附近设有一定容量的煤仓，接受井下提升到地面的煤炭，保证井口上下均衡连续生产。 筛分 用带孔的筛面把颗粒大小不同的混合物料分成各种粒极的作业叫筛分。晒分所用的机器叫筛分机或者筛子。 在选煤厂中，筛分作业广泛地用于原煤准备和处理上。按照筛分方式不同，分为干法筛分和湿法筛分。 破碎 把大块物料粉碎成小颗粒的过程叫做破碎。用于破碎的机器叫做破碎机。在选煤厂中破碎作业主要有以下要求： 1）适应入选颗粒的要求；精选机械所能处理的煤炭颗粒有一定的范围度，超过这个范围的大块要经过破碎才能洗选。 2）有些煤快是煤与矸石夹杂而生的夹矸煤，为了从中选出精煤，需要破碎成更小的颗粒，使煤和矸煤分离 3）满足用户的颗粒要求，把选后的产品或煤快粉碎到一定的粒度 物料粉碎主要用机械方法，有压碎、劈碎、折断、击碎、磨碎等几种主要方式。 选煤 是利用与其它物质的不同物理、物理－化学性质，在选煤厂内用机械方法去处混在原煤中的杂质，把它分成不同质量、规格的产品，以适应不同有户的需求。 按照选煤厂的位置与煤矿的关选煤厂可以分为：矿井选煤厂、群矿选煤厂、中心选煤厂和用户选煤厂；我国现有的洗煤厂大多是矿井洗煤厂。现代化的洗煤厂是一个由许多作业组成的连续机械加工过程。 跳汰选煤 在垂直脉动的介质中按颗粒密度差别进行选煤过程。跳汰选煤的介质是水或空气，个别的也用悬浮液。选煤中以水力跳汰的最多。 跳汰机是利用跳汰分选原理将入选原料按密度大小分选为精煤、中煤和矸煤等产品设备。 重介选煤 在密度大于1g/cm的介质中，按颗粒密度的的大小差异进行选煤，叫做重介质选煤或重介选煤。选煤所用的重介质有重液和重选浮液两类。重介选煤的主要优点是分选效率高与其它选煤方法；入选力度范围宽，分选机入料粒为1000-6mm，漩流器为80-0.15mm生产控制易于自动化。重介选煤的缺点是生产工艺复杂，生产费用高，设备磨损快，维修量大。 重介选煤一般都分级入选。分选块煤一般在重力作用下用重介质分选机进行；分选沫煤在离心力作用下用重介质漩流器进行。 存储 储煤仓：为调节产、运、销之间产生的不平衡，保证矿井和运输部门正常和均衡生产而设定的有一定容量的煤仓，接受生产成品煤炭，保证能顺利出厂，进入最后的装车阶段。 **装车:**包括装车（船）、吊车和计量。 尾煤：煤炭采出来要经过浮选的 ,比重越轻的说明含岩石越少，品质就越好.尾煤就是经过浮选剩下的煤，含有大量岩石成分，是品质最差的煤.尾煤一般用来发电。 煤矸石：是采煤过程和洗煤过程中排放的固体废物，是一种在成煤过程中与煤层伴生的一种含碳量较低、比煤坚硬的黑灰色岩石。包括巷道掘进过程中的掘进矸石、采掘过程中从顶板、底板及夹层里采出的矸石以及洗煤过程中挑出的洗矸石。其主要成分是Al2O3、SiO2，另外还含有数量不等的Fe2O3、CaO、MgO、Na2O、K2O、P2O5、SO3和微量稀有元素（镓、钒、钛、钴）。","tags":[{"name":"工艺流程","slug":"工艺流程","permalink":"http://7086.site/tags/%E5%B7%A5%E8%89%BA%E6%B5%81%E7%A8%8B/"}]},{"title":"水电站的环境影响评价","date":"2013-09-22T05:30:23.000Z","path":"posts/60523.html","text":"水电是目前唯一一种技术上比较成熟的、可以进行大规模开发的可再生资源。大型水电站的正面生态环境效益远远超过负面影响。 目前我国可控的水库蓄水总量十分有限，尚不能起到拦蓄洪水、调节水资源的作用。因此还需要建设一批高坝大库的坝式水电站来调蓄水资源，只有让全流域具备一定的水库调节能力，我们才能实行全流域的统一调度，优化河流水资源的管理。大型蓄水水库，可增加流域讯期的蓄洪能力，增加可利用水资源总量。更好地解决防洪减灾和水资源短缺问题。 抽水蓄能电站是水电站发展的主流。抽水蓄能电站的蓄能机组有效水头越高，所需要的流量和库容越小，单位造价就可减少。故抽水蓄能电站的造价随水头增大而降低。 纯抽水蓄能电站的特征是只有很少甚至没有天然径流进入上水库。浙江天荒坪、广州和十三陵抽水蓄能电站为纯抽水蓄能电站。混合式抽水蓄能电站的上水库有天然径流汇入。我国混合式抽水蓄能电站蓄能机组受常规水电机组水头和天然落差限制，水头一般较低。岗南、密云、潘家口和响洪甸抽水蓄能电站为混合式。 对于没有水资源调配需求和土地紧张的地区，宜选择建设低水头水电站。低水头水电站梯级开发，可减少移民和淹没；采用灯泡贯流式发电机组，水力损失少，从而最大限度地减小对生态环境的不利影响。低水头水电站梯级开发，要结合流域龙头水库的调蓄来设计。每一条梯级开发的河流，应建立两处特有鱼类自然保护区，自然保护区应包含干流和支流，且干支流段均不应修建水电站。 天生桥一级水电站，是红水河十个梯级的龙头电站，调节库容57.96亿m3，（调节库容是正常蓄水位至死水位之间的水库容积，是为水利发电、航运、给水、灌溉等提供调节径流的水库容积，也称有效库容）； 岩滩水电站，调节库容15.6亿m3； 龙滩水电站，防洪库容70亿m3，（防洪库容是设计洪水位至正常蓄水位之间的容积，是为削减洪峰、防止下游洪水灾害而进行水库径流调节所需的库容）； 三峡水电站，为坝后式水电站，防洪库容221.5亿m3； 山西西龙池抽水蓄能电站，额定水头624m，上水库调节库容424.1万m3，下水库调节库容421.5万m3； 广州抽水蓄能电站，额定水头514m，上水库调节库容891万m3，下水库调节库容1121万m3； 新丰江水电站，额定水头514m，调节库容64.89亿m3，调洪库容31.024亿m3，（调洪库容是校核洪水位{水库在非常运用情况下，允许临时达到的坝前最高水位}至防洪限制水位之间的容积，它用以拦截洪水）； 生态基流是维持河流生态系统运转的基本流量。水电站应建立在保持生态基流的基础上。 内陆河合理开发利用程度为30%，而淮河水资源开发利用率却超过50%，每50平方公里就建有1座水库。金沙江规划的水库总库容将达到径流量的83%；长江上游地区水库总库容将达到河川径流量的61%。 北方河流的最小生态流量为多年平均流量的10%，南方河流为30% ： 黄河多年平均流量为1785m3/s，生态基流为179m3/s； 海河多年平均流量为7233m3/s，生态基流为723m3/s； 长江多年平均流量为28700m3/s，生态基流为8610m3/s； 引水式水电站比坝式水电站引用的流量小，但无蓄水库调节径流，水量利用率较差，综合利用效率较小。引水道会造成原河道脱水，引水道越长脱水河道越长。 坝后式水电站的厂房本身不承受上游水压力。其上游有较大容量的蓄水库可以调节流量，不会出现脱水河段，有利于加大电站的装机容量，适应电力系统的调峰要求，水能利用充分，综合利用效益高。适宜建在高山峡谷、淹没较小的地区。如三峡水电站、丰满水电站、东江水电站、龙羊峡水电站。 河床式水电站的厂房本身承受上游水压力。只建有低坝，水库容量和调节能力较小，主要依靠河流的天然流量发电，故又称径流式水电站。由于弃水较多，水能利用率低，综合利用效益小。如葛洲坝水利枢纽、富春江水电站、西津水电站、青铜峡水电站。 水电站对环境的有利影响： 1、与燃煤发电相比，水电在提供清洁能源的同时，大大减少了污染物的排放； 2、大型水电站均建有较大库容的水库，通过合理的运行调度，可防止或减少下游洪灾； 3、较大库容的水库，可通过干、支渠提供大面积的灌溉； 4、大库容水库所蓄之水是大的蓄热体，可调节局部气候；风速减小、雾日增多。 水电站对环境的不利影响： 1、水库改变了河道的水流形势，水流变缓，水体自净能力降低，，坝下形成减脱水河段，严重威胁水生生物生存；水电站的建设，特别是河流水能的梯级开发，改变了河溪的水文特征。引水式电站形成河道脱水、减水问题较为突出，脱水河段对下游水生态系统造成较大不利影响。 2、水库压力增高，会影响库岸稳定；具有调峰功能的电站，对下游河岸造成周期性波动冲刷，使河岸崩坍，产生水土流失。 3、库尾形成重金属和有机污染物的积累，消落区有可能引发传染病； 4、水库下泄的水温低，会影响下游鱼类生长； 5、库区沉积的泥沙，会减小库容，阻塞航道。 电站的生态恢复—— （1）对上下游河溪、库区水岸的生态修复： 采用变径混凝土桩仿拟树林直根，土工格栅仿拟树须根，格栅后的砂砾石形成水生动物栖息地，起到隔离、反滤、生物吸附作用，并可构成旁侧式湿地； 砾石后无纺布构成反滤层，防止土壤流失； 河流有护底要求时，采用经编土工格栅砾石网垫，网垫栽种挺水植物，形成水-岸间的生态过渡带，同时为植物群落的可操纵性创造条件。 （2）对水岸边坡的绿化混凝土生态化防护： 采用绿化混凝土作为河川防护材料，可解决硬化与绿化、安全与生态之间的矛盾。绿化混凝土是指能够适应植物生长、可进行植被作业的混凝土及其制品，即能够长草的混凝土。对墙式护岸可采用箱式绿化混凝土构件； 对坡式护岸可采用浇筑式或复合式绿化混凝土构件。 （3）对岩壁、刚性防护的生态修复： 仿拟元素选择自然界中岩基-风化层-植被层这种合理的生态系统构造。其中风化层以绿化混凝土为防拟材料，可克服自然风化层松散、稳定性差、植物营养元素不均衡等弊端。 （4）对下游脱水段的生态恢复： 选择一定间隔，拦截河床下潜水通道，并在河库上以天然材料为主，砌筑拟自然化的阻水建筑物，储蓄电站丰水期的弃水和区间径流水。在非弃水期和枯水期形成拟自然化河道，河床保持经常有水状态，为生物提供栖息环境，改善局部小气候；而在丰水期又可淹没并恢复为正常河道。","tags":[{"name":"环评","slug":"环评","permalink":"http://7086.site/tags/%E7%8E%AF%E8%AF%84/"}]},{"title":"三星RV415笔记本用u盘启动winpe方法","date":"2013-09-21T12:46:36.000Z","path":"posts/20111.html","text":"经过本人不断的试验，一直以为这台机子 就是不支持usb启动，后经过测试还是可以的，方法如下： 本方法只适合于三星rv415笔记本，或者是同系列不能正常usb启动的笔记本。 正常的usb，即是设置usb hdd为第一启动项，本机子有此引导项，可是却不能识别硬件，因此引导失败 后来，看到有人成功引导，说是要重启才能识别u盘，经我测试 ，没用。 今天因为巧合，让我启动成功，方法如下： 首先，bios中设置usb key 为第一引导项，为什么是这个我不知道， 然后，u盘插入电脑后，从关闭的机器开机即可成功引导，这里要说下，重新启动是不能引导的，必须关闭电源再按开机键方可引导成功。 最后，经测试，03pe，引导成功也进不了系统，使用win7pe，以及linux pe 都可平常使用。 希望帮助到用这台机器的人，呵呵。","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://7086.site/tags/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"}]},{"title":"印刷过程的主要污染来源","date":"2013-09-21T12:43:11.000Z","path":"posts/49377.html","text":"首先是油墨。目前印刷行业中广泛使用的还是传统的溶剂型油墨，溶剂型油墨由颜料、连结料、溶剂、填充剂和辅助剂组成，所用的溶剂主要是芳香烃类、酯类、酮类、醚类等有机溶剂，这些溶剂大都具有毒性，会污染所包装的食品、药物和化妆品等物品；且具有挥发性，有较浓的刺激性气味，会污染环境并影响工人的身体健康；有机溶剂易燃易爆，存在着生产安全隐患。 第二是润版液。润版液是保证印版空白部分形成亲水盐层的必要条件，目前胶印机上普遍采用的是酒精润版系统，异丙醇是润版溶液的添加剂之一。相对于传统的水润版系统来说，这种润版方式可大大减少水的用量，又避免了因水过量引起的纸张变形和油墨的过量乳化，从而大大提高印刷效果。但是，由于异丙醇挥发后产生的醇蒸汽有毒，有不良的气味，会对人体健康造成有害的影响，许多发达国家规定异丙醇在工作场地的阈限值仅为每立方米200——400毫升；而且，异丙醇排放物还会污染环境，异丙醇是一种光化学氧化剂，它与存在地面附近的其它痕量气体一样，受阳光照射会形成臭氧，从而导致所谓“夏季烟雾”现象，光化学烟雾会刺激人的眼睛和呼吸系统，危害人们的身体健康和植物的生长，因此，异丙醇是一种对环境、人体均有害的化学品，在印刷中减少其用量是一种必然的趋势。 第三，胶片和废定影液。目前印刷中用得最多的还是胶印，而胶印中用以制版的多半还是通过照排机出胶片制成PS版来上机印刷。胶片是银盐感光材料，里面含有银离子，而定影后的废定影液里也含有大量的银离子，这些物质若直接进入环境中，重金属银离子能污染自然水体而造成对环境的危害，同时，胶片的片基是高分子化合物，在环境中极难降解而污染土壤。 第四，塑料覆膜。塑料覆膜因其耐折、耐磨、可保护印刷品、增加光泽且成本低而备受出版商和消费者的青睐，但是，塑料覆膜无法降解而成为白色污染，覆膜后的纸张无法回收而造成资源浪费，同时，覆膜过程中使用了甲苯、天那水等有毒的挥发性溶剂，会危害工人的身体健康和污染环境。 第五，油性上光材料。上光工艺是印刷品后表面整理加工的一种工艺，经过上光可增加印品表面的光泽度、光洁度和挺度，起到保护印品、增加美观的作用。但是，油性上光材料使用的稀释剂主要是甲苯，而甲苯是有毒的挥发性物质，人体吸入一定量的甲苯会导致呼吸系统和血液系统发生病变，因此，油性上光工艺不符合环境保护要求，尤其是药品、食品等商品的包装物和儿童玩具、儿童书籍等更不宜使用油性上光工艺。 第六，塑料印刷废品。随着印刷包装业的快速发展，塑料等有机高分子材料的印刷越来越普遍，印刷厂产生的塑料印刷废品是一种不可忽视的固体污染物，由于它们的水不溶性和在自然界中极难降解，若直接进入环境必然造成危害。如果将废弃物就近烧毁，会产生大量的二恶英等毒性很强的气体，在极低浓度下二恶英能使人和动物发生畸变，而且是一种强致癌物质，会严重污染周围的空气。因此，塑料印刷废品必须经过合理的处理。","tags":[{"name":"环境","slug":"环境","permalink":"http://7086.site/tags/%E7%8E%AF%E5%A2%83/"}]},{"title":"如何改变wordpress分类目录排序","date":"2013-09-18T06:24:43.000Z","path":"posts/4087.html","text":"插件下载： http://wordpress.org/extend/plugins/order-categories/ 激活， manage—&gt;Category Order, 直接拖动，即可重新排序。","tags":[{"name":"wordpress","slug":"wordpress","permalink":"http://7086.site/tags/wordpress/"}]},{"title":"蓝光电影播器PowerDVD 13破解版及解决播放ISO问题","date":"2013-09-12T05:44:38.000Z","path":"posts/64497.html","text":"喜欢体验蓝光电影同学，可能会尝试很多款不同的播放器 体验了一下，蓝光电影确实强大，但是开始我用的是iDeer_Blu-ray_Player_这款，感觉颗粒感较重， 后尝试电脑中自带的QQ影音，发现画面清晰，难是没有声音 后体验强大的播放器PowerDVD 13 感觉直接播放iso放不了，于是采用虚拟光驱加载后播放，效果真得很棒。 分享PowerDVD 13破解版 http://pan.baidu.com/share/link?shareid=2241093767&amp;uk=521955440 虚拟光驱 http://pan.baidu.com/share/link?shareid=2244591029&amp;uk=521955440","tags":[{"name":"蓝光电影","slug":"蓝光电影","permalink":"http://7086.site/tags/%E8%93%9D%E5%85%89%E7%94%B5%E5%BD%B1/"}]},{"title":"如何看我的电脑是否支持win7  64位","date":"2013-09-11T09:18:50.000Z","path":"posts/44379.html","text":"此工具可以检测出你的电脑是否能安装win7（64位）的系统，运行即有提示：显示为 64 yes yes则可以安装，显示为：64 off off(或64 no no )则不能安装。 测试你的cpu支不支持vt虚拟化技术 Locked ON的意思：主板有“开和关”两种选择，ON表示，目前处于开启状态。OFF，表明处于关闭状态（Locked OFF并不能表明CPU是否支持，到底支持不支持，请到主板BIOS中，看是否有VT的开启开关，开后，如显示为ON那就成功了，如还是OFF，那表明CPU不支持)YES的意思：本机第三项为“YES”，手动创建虚拟机后提示无法启动，原因是BIOS中有设置项“virtualization”，但没有开启。开启之后方可运行。Virtualization虚拟技术中第三项Locked ON表明你的硬件平台处于开启状态 很多客户用SecurAble检测计算机是否支持VT。这款软件检测系统的三项技术：左边的是检测系统是否支持64位，中间的是是否支持硬件数据执行保护（也就是地址扩展），右边的是系统是否支持VT。在不同系统和不同的芯片组下会有各种不同的显示。 1、CPU和BIOS都不支持 右边显示红色的NO。 2、CPU不支持，BIOS支持 右边显示红色的Locked OFF 3、CPU和BIOS都支持 右边显示绿色的Locked ON/ z 4、其他显示 右边还会有显示绿色Yes的情况 第3和4是肯定支持VT的。 下载链接：http://pan.baidu.com/share/link?shareid=3481236979&amp;uk=521955440","tags":[]},{"title":"WordPress伪静态以及.htaccess规则","date":"2013-09-07T12:39:19.000Z","path":"posts/39661.html","text":"第一步：先在WordPress博客程序的后台找到“设置”选项，在菜单里打开“固定连接”，选择自定义结构，填写：/%post_id%.html,效果如下图所示 接着直接新建1个txt文档，再复制虚横线之下的代码内容，粘贴到txt文档里面保存后，再修改文档文件名为.htaccess就可以了。 将.htaccess文件直接上传到FTP空间的WEB文件夹根目录下，最后在固定链接中设置为自己想要的即可使用。经过空间测试暂时没有错误，其他空间商的服务器不一定能正常使用。注意：这个伪静态规则文件仅适合WordPress博客使用！htaccess文件怎么创建,如何创建.htaccess文件？ 1. 打开Windows内建的记事本； 2. 选取另存新文件“文件-&gt;另存为”； 3. 在另存为的“保存类型”下拉选单中选取“所有文件”类型； 4. 这时就可在“文件名”中输入.htaccess； 5. 选取要另存的路径再按下保存，一个.htaccess 文件就新增完成。然后，用FTP软件，将这个名称为.htaccess文件，上传到站点的Web目录下即可立即生效，路径为/web/.htaccess———————————————————————————# BEGIN WordPress &lt;IfModule mod_rewrite.c&gt; RewriteEngine On RewriteBase / RewriteRule ^index.php$ – [L] RewriteCond %{REQUEST_FILENAME} !-f RewriteCond %{REQUEST_FILENAME} !-d RewriteRule . /index.php [L] # END WordPress","tags":[]},{"title":"解决wordpress3.5后台没有链接管理页面","date":"2013-09-07T12:38:41.000Z","path":"posts/25346.html","text":"wordpress3.5版本已经隐藏了链接管理页面，那么我们该如何让它显示出来呢？ 我们需要安装一个插件，名字叫“Link manager”，这个插件可以实现后台显示链接管理，界面跟以前的版本一样。","tags":[]}]